S3=[
    {
     "dec": "استوفى",
     "moy": "5",
     "note_istidrak": 0,
     "exam": 7,
     "test": "2.5",
     "name": "الشيخ محمد الأمين اكواتيل",
     "num": 18772,
     "mat": "القرآن و علومه1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 0,
     "note_istidrak": 0,
     "exam": 0,
     "test": 0,
     "name": "الشيخ القاضي أحمدو الشيخ أحمدو",
     "num": 19697,
     "mat": "القرآن و علومه1 "
    },
    {
     "dec": "لم يستوف",
     "moy": "7.5",
     "note_istidrak": 0,
     "exam": "7.5",
     "test": 0,
     "name": "محمد محمود المختار اعل",
     "num": 20441,
     "mat": "القرآن و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 6,
     "note_istidrak": 0,
     "exam": 3,
     "test": 3,
     "name": "ميمونه حامد صلاحى",
     "num": "L21184",
     "mat": "القرآن و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 7,
     "note_istidrak": 5,
     "exam": 7,
     "test": 0,
     "name": "محمد فاضل محمد المامون الحاج",
     "num": "L21351",
     "mat": "القرآن و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 6,
     "note_istidrak": 0,
     "exam": 6,
     "test": 0,
     "name": "محمد محمد سيد آب",
     "num": "L21517",
     "mat": "القرآن و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 8,
     "note_istidrak": 0,
     "exam": 8,
     "test": 0,
     "name": "محمد محمد سيد آب",
     "num": "L21517",
     "mat": "القرآن و علومه1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 0,
     "note_istidrak": 0,
     "exam": 0,
     "test": 0,
     "name": "عمر باه",
     "num": "L21692",
     "mat": "القرآن و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 9,
     "note_istidrak": 9,
     "exam": 6,
     "test": 0,
     "name": "محمد هومن احمد سالم حمزة",
     "num": "L21771",
     "mat": "القرآن و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 12,
     "note_istidrak": 12,
     "exam": 9,
     "test": 0,
     "name": "فاطمة دحود الحمد",
     "num": "L22120",
     "mat": "القرآن و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 11,
     "note_istidrak": 8,
     "exam": 5,
     "test": 3,
     "name": "فاطمة الخراشي باكي",
     "num": "L22170",
     "mat": "القرآن و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 9,
     "note_istidrak": 8,
     "exam": 9,
     "test": 0,
     "name": "النين بوي النه الطالب اعل",
     "num": "L22215",
     "mat": "القرآن و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 13,
     "note_istidrak": 10,
     "exam": 6,
     "test": 3,
     "name": "ساره محمد فيصل امامه",
     "num": "L22287",
     "mat": "القرآن و علومه1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 9,
     "note_istidrak": 9,
     "exam": 9,
     "test": 0,
     "name": "محمد ناجي السيد ابنو",
     "num": "L22340",
     "mat": "القرآن و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 9,
     "note_istidrak": 7,
     "exam": "3.5",
     "test": 2,
     "name": "زينب محمد حبيب حبيب",
     "num": "L22394",
     "mat": "القرآن و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 14,
     "note_istidrak": 11,
     "exam": 0,
     "test": 3,
     "name": "اسماعيل محمد محمود بوبه",
     "num": "L22438",
     "mat": "القرآن و علومه1 "
    },
    {
     "dec": "لم يستوف",
     "moy": "8.5",
     "note_istidrak": 0,
     "exam": 6,
     "test": "2.5",
     "name": "أحمد سالم ابراهيم فال البخاري",
     "num": "L22447",
     "mat": "القرآن و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 12,
     "note_istidrak": 9,
     "exam": 6,
     "test": 3,
     "name": "خدجة محمد المختار محمد",
     "num": "L22697",
     "mat": "القرآن و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 6,
     "note_istidrak": 5,
     "exam": 6,
     "test": 0,
     "name": "محمد محمد عبد اﷲ محمد بوبه",
     "num": "L22715",
     "mat": "القرآن و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": "6.5",
     "note_istidrak": 0,
     "exam": 3,
     "test": "3.5",
     "name": "عيشه المصطفى تراورى",
     "num": "L22730",
     "mat": "القرآن و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 9,
     "note_istidrak": 5,
     "exam": 6,
     "test": 3,
     "name": "محمدو لمين دودو",
     "num": "L22731",
     "mat": "القرآن و علومه1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 9,
     "note_istidrak": 7,
     "exam": 2,
     "test": 2,
     "name": "محمد عبد اﷲ برهم",
     "num": "L22734",
     "mat": "القرآن و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 9,
     "note_istidrak": 9,
     "exam": 8,
     "test": 0,
     "name": "الطاهره الهيبه الشيخ محمد فاضل",
     "num": "L22737",
     "mat": "القرآن و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 10,
     "note_istidrak": 10,
     "exam": 8,
     "test": 0,
     "name": "ينصره سيد محمد",
     "num": "L22782",
     "mat": "القرآن و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 13,
     "note_istidrak": 10,
     "exam": 5,
     "test": 3,
     "name": "عائيش عبد اﷲ ميلود",
     "num": "L22804",
     "mat": "القرآن و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 12,
     "note_istidrak": 9,
     "exam": 3,
     "test": 3,
     "name": "مامه المخطار لبشاره",
     "num": "L22832",
     "mat": "القرآن و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": "12.5",
     "note_istidrak": 9,
     "exam": 5,
     "test": "3.5",
     "name": "زينب محمد اعمر ويس",
     "num": "L22833",
     "mat": "القرآن و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 10,
     "note_istidrak": 8,
     "exam": 6,
     "test": 2,
     "name": "محمد عبد اﷲ اسلم",
     "num": "L22839",
     "mat": "القرآن و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 8,
     "note_istidrak": 7,
     "exam": 6,
     "test": 1,
     "name": "عيشة ابراهيم امبارك",
     "num": "L22891",
     "mat": "القرآن و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 12,
     "note_istidrak": 9,
     "exam": 5,
     "test": 3,
     "name": "أم كلثوم اباخو محمد السالم",
     "num": "L22903",
     "mat": "القرآن و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 10,
     "note_istidrak": 10,
     "exam": 6,
     "test": 0,
     "name": "مريم محمد سالم عفان",
     "num": "L22920",
     "mat": "القرآن و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 15,
     "note_istidrak": 11,
     "exam": 0,
     "test": 4,
     "name": "الشيخ التجاني أحمد سالم",
     "num": "L22922",
     "mat": "القرآن و علومه1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 9,
     "note_istidrak": 5,
     "exam": 7,
     "test": 2,
     "name": "حنان محمد فاضل البشير",
     "num": "L22931",
     "mat": "القرآن و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": "13.5",
     "note_istidrak": 11,
     "exam": 6,
     "test": "2.5",
     "name": "محجوبة أحمدو بمب الصوفي",
     "num": "L23005",
     "mat": "القرآن و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 8,
     "note_istidrak": 7,
     "exam": 8,
     "test": 0,
     "name": "البتول يسلم يمب",
     "num": "L23035",
     "mat": "القرآن و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": "11.5",
     "note_istidrak": 9,
     "exam": 4,
     "test": "2.5",
     "name": "عيشة عبد القادر أحمد موجي",
     "num": "L23166",
     "mat": "القرآن و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": "7.5",
     "note_istidrak": 0,
     "exam": 6,
     "test": "1.5",
     "name": "خدجة زيدان العربي",
     "num": "L23195",
     "mat": "القرآن و علومه1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 4,
     "note_istidrak": 0,
     "exam": 0,
     "test": 4,
     "name": "نانه العالم اعبيدي",
     "num": "L23277",
     "mat": "القرآن و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 13,
     "note_istidrak": 9,
     "exam": 3,
     "test": 4,
     "name": "الشيخ محمد فاضل محمد الناجم",
     "num": "L23356",
     "mat": "القرآن و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 10,
     "note_istidrak": 8,
     "exam": 6,
     "test": 2,
     "name": "خدجة احمد افكينيش",
     "num": "L23416",
     "mat": "القرآن و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 12,
     "note_istidrak": 12,
     "exam": 0,
     "test": 0,
     "name": "أحمد محمدو يسلم سيد سالم",
     "num": "L23447",
     "mat": "القرآن و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": "10.5",
     "note_istidrak": 8,
     "exam": 7,
     "test": "2.5",
     "name": "محجوبه أحمد بلاله",
     "num": "L23478",
     "mat": "القرآن و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": "11.5",
     "note_istidrak": 9,
     "exam": 5,
     "test": "2.5",
     "name": "أحمد أحمد باب عمر",
     "num": "L23501",
     "mat": "القرآن و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": "12.5",
     "note_istidrak": 10,
     "exam": 1,
     "test": "2.5",
     "name": "حمد احمد عبد العزيز",
     "num": "L23524",
     "mat": "القرآن و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": "12.5",
     "note_istidrak": 10,
     "exam": 6,
     "test": "2.5",
     "name": "اقبال محمد محمود بيلاهي",
     "num": "L23533",
     "mat": "القرآن و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": "12.5",
     "note_istidrak": 10,
     "exam": 5,
     "test": "2.5",
     "name": "امباركه اسغير سالم",
     "num": "L23550",
     "mat": "القرآن و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": "10.5",
     "note_istidrak": 8,
     "exam": 7,
     "test": "2.5",
     "name": "اطويلت لعمر محمد سالم يحى",
     "num": "L23563",
     "mat": "القرآن و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 14,
     "note_istidrak": 9,
     "exam": 0,
     "test": 5,
     "name": "الشفاء محمد امين",
     "num": "L23619",
     "mat": "القرآن و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 13,
     "note_istidrak": 10,
     "exam": 5,
     "test": 3,
     "name": "خديجة المامون لمرابط",
     "num": "L23665",
     "mat": "القرآن و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": "14.5",
     "note_istidrak": 12,
     "exam": 7,
     "test": "2.5",
     "name": "اخت البنين محمد الامين محمد سيدي",
     "num": "L23850",
     "mat": "القرآن و علومه1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 8,
     "note_istidrak": 0,
     "exam": 8,
     "test": 0,
     "name": "الشيخ محمد المامي",
     "num": "L23858",
     "mat": "القرآن و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 10,
     "note_istidrak": 10,
     "exam": 5,
     "test": 0,
     "name": "محمد مختار بلدي",
     "num": "L23925",
     "mat": "القرآن و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 12,
     "note_istidrak": 9,
     "exam": 5,
     "test": 3,
     "name": "مريم زيدان موسى",
     "num": "L24096",
     "mat": "القرآن و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 12,
     "note_istidrak": 12,
     "exam": 9,
     "test": 0,
     "name": "السالم فال الحسين السملالي",
     "num": "L24185",
     "mat": "القرآن و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 8,
     "note_istidrak": 8,
     "exam": 5,
     "test": 0,
     "name": "ابراهيم اعمر مسعود",
     "num": "L24205",
     "mat": "القرآن و علومه1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 8,
     "note_istidrak": 8,
     "exam": 2,
     "test": 0,
     "name": "محمد لمين محفوظ سيد أحمد",
     "num": 5454,
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 8,
     "note_istidrak": 5,
     "exam": 1,
     "test": 3,
     "name": "عزيزة محمد الأمين اليعقوبي",
     "num": 18249,
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 5,
     "note_istidrak": 15,
     "exam": 6,
     "test": 1,
     "name": "الشيخ محمد الأمين اكواتيل",
     "num": 18772,
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 2,
     "note_istidrak": 0,
     "exam": 2,
     "test": 0,
     "name": "امو احمدباباسماعيل",
     "num": 19349,
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 15,
     "note_istidrak": 15,
     "exam": 4,
     "test": 0,
     "name": "فاطمة عبد القادر محمد زين",
     "num": "L21166",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 17,
     "note_istidrak": 15,
     "exam": 2,
     "test": 2,
     "name": "ميمونه حامد صلاحى",
     "num": "L21184",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 11,
     "note_istidrak": 8,
     "exam": 2,
     "test": 3,
     "name": "خديجة محمد شعيب محمد الأمين",
     "num": "L21192",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 15,
     "note_istidrak": 15,
     "exam": 6,
     "test": 0,
     "name": "محمد محمد سيد آب",
     "num": "L21517",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": "5.5",
     "note_istidrak": 0,
     "exam": "5.5",
     "test": 0,
     "name": "محمد محمد سيد آب",
     "num": "L21517",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 8,
     "note_istidrak": 0,
     "exam": 5,
     "test": 3,
     "name": "ميمونه محمد الياس سيد احمد",
     "num": "L21548",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 15,
     "note_istidrak": 15,
     "exam": 4,
     "test": 0,
     "name": "محمد هومن احمد سالم حمزة",
     "num": "L21771",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 0,
     "note_istidrak": 0,
     "exam": 0,
     "test": 0,
     "name": "محمد ابراهيم محمد الصغير",
     "num": "L21897",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 15,
     "note_istidrak": 15,
     "exam": 3,
     "test": 0,
     "name": "عيشة محمد المختار ميلود",
     "num": "L21902",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 0,
     "note_istidrak": 0,
     "exam": 0,
     "test": 0,
     "name": "محمد محفوظ محمد عبد اﷲ كبود",
     "num": "L21960",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 9,
     "note_istidrak": 6,
     "exam": 9,
     "test": 0,
     "name": "محمد محفوظ محمد عبد اﷲ كبود",
     "num": "L21960",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 9,
     "note_istidrak": 8,
     "exam": 3,
     "test": 1,
     "name": "فاطمة دحود الحمد",
     "num": "L22120",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 13,
     "note_istidrak": 12,
     "exam": 2,
     "test": 1,
     "name": "عبد اﷲ السالم احمدو فال الخيري",
     "num": "L22136",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 11,
     "note_istidrak": 9,
     "exam": 3,
     "test": 2,
     "name": "فاطمة الخراشي باكي",
     "num": "L22170",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 17,
     "note_istidrak": 13,
     "exam": 3,
     "test": 4,
     "name": "افيلاله أحمد الدوا",
     "num": "L22173",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 16,
     "note_istidrak": 14,
     "exam": 4,
     "test": 2,
     "name": "عبداﷲ مختار السالم المختار السالم",
     "num": "L22213",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 15,
     "note_istidrak": 15,
     "exam": 4,
     "test": 0,
     "name": "النين بوي النه الطالب اعل",
     "num": "L22215",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 9,
     "note_istidrak": 0,
     "exam": 7,
     "test": 2,
     "name": "حم سيد بوي بلال",
     "num": "L22272",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 16,
     "note_istidrak": 14,
     "exam": 1,
     "test": 2,
     "name": "ساره محمد فيصل امامه",
     "num": "L22287",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 15,
     "note_istidrak": 15,
     "exam": 3,
     "test": 0,
     "name": "فاطمة محمد محمود الداه",
     "num": "L22296",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 8,
     "note_istidrak": 0,
     "exam": 4,
     "test": 4,
     "name": "النموها محمد الامين عمار",
     "num": "L22320",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 9,
     "note_istidrak": 7,
     "exam": 4,
     "test": 2,
     "name": "محمد ناجي السيد ابنو",
     "num": "L22340",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 14,
     "note_istidrak": 10,
     "exam": 0,
     "test": 4,
     "name": "عائشه الطالب عبد اﷲ الشيخ أحمد",
     "num": "L22362",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 17,
     "note_istidrak": 15,
     "exam": 3,
     "test": 2,
     "name": "نسيبه محمد المختار حمود",
     "num": "L22369",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 9,
     "note_istidrak": 0,
     "exam": 7,
     "test": 2,
     "name": "محمد المختار سيدن اتلاميد",
     "num": "L22379",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 13,
     "note_istidrak": 8,
     "exam": 4,
     "test": 5,
     "name": "زينب محمد حبيب حبيب",
     "num": "L22394",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 11,
     "note_istidrak": 7,
     "exam": 0,
     "test": 4,
     "name": "محمد فاضل ابنو",
     "num": "L22429",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 13,
     "note_istidrak": 10,
     "exam": 6,
     "test": 3,
     "name": "اسماعيل محمد محمود بوبه",
     "num": "L22438",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 5,
     "note_istidrak": 0,
     "exam": 0,
     "test": 5,
     "name": "أحمد سالم ابراهيم فال البخاري",
     "num": "L22447",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 19,
     "note_istidrak": 15,
     "exam": 2,
     "test": 4,
     "name": "آمنة باباه باباه",
     "num": "L22634",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 17,
     "note_istidrak": 13,
     "exam": 5,
     "test": 4,
     "name": "المختار السالم احمدو اصلاي",
     "num": "L22635",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 10,
     "note_istidrak": 6,
     "exam": 2,
     "test": 4,
     "name": "الصديق سناد محمود الحاج",
     "num": "L22667",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 10,
     "note_istidrak": 10,
     "exam": 1,
     "test": 0,
     "name": "سيد أحمد اركيب محمد عال عبد المجيد",
     "num": "L22674",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 9,
     "note_istidrak": 8,
     "exam": 3,
     "test": 1,
     "name": "أحمد باباه سيدي",
     "num": "L22679",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 20,
     "note_istidrak": 15,
     "exam": 4,
     "test": 5,
     "name": "الشيخ جعفر احمد صافي",
     "num": "L22693",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 17,
     "note_istidrak": 15,
     "exam": 4,
     "test": 2,
     "name": "خدجة محمد المختار محمد",
     "num": "L22697",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 17,
     "note_istidrak": 15,
     "exam": 3,
     "test": 2,
     "name": "لال عيش سيد احمد الويمين",
     "num": "L22705",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 18,
     "note_istidrak": 15,
     "exam": 3,
     "test": 3,
     "name": "محمد محمد عبد اﷲ محمد بوبه",
     "num": "L22715",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 17,
     "note_istidrak": 15,
     "exam": 3,
     "test": 2,
     "name": "سيد أعمر محمد عبد اﷲ",
     "num": "L22717",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 19,
     "note_istidrak": 15,
     "exam": 4,
     "test": 4,
     "name": "سيد محمد أواه آج",
     "num": "L22719",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 17,
     "note_istidrak": 15,
     "exam": 5,
     "test": 2,
     "name": "محمد نافع ألمان النون",
     "num": "L22723",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 11,
     "note_istidrak": 10,
     "exam": 3,
     "test": 1,
     "name": "البانوني محمدن",
     "num": "L22724",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 17,
     "note_istidrak": 15,
     "exam": 3,
     "test": 2,
     "name": "عيشه المصطفى تراورى",
     "num": "L22730",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 12,
     "note_istidrak": 10,
     "exam": 3,
     "test": 2,
     "name": "محمدو لمين دودو",
     "num": "L22731",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 17,
     "note_istidrak": 15,
     "exam": 4,
     "test": 2,
     "name": "ميمونه عبد الرحمن عبد القادر",
     "num": "L22735",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 19,
     "note_istidrak": 14,
     "exam": 1,
     "test": 5,
     "name": "الطاهره الهيبه الشيخ محمد فاضل",
     "num": "L22737",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 17,
     "note_istidrak": 15,
     "exam": 3,
     "test": 2,
     "name": "بابي محمد محمود سيد لمين المحمود",
     "num": "L22738",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 17,
     "note_istidrak": 15,
     "exam": 4,
     "test": 2,
     "name": "عيشة سيد عبد اﷲ اعليات",
     "num": "L22753",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 17,
     "note_istidrak": 15,
     "exam": 4,
     "test": 2,
     "name": "حورية بوناه بوميه",
     "num": "L22759",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 17,
     "note_istidrak": 15,
     "exam": 1,
     "test": 2,
     "name": "صفيه أحمد كوري السالكي",
     "num": "L22777",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 12,
     "note_istidrak": 10,
     "exam": 3,
     "test": 2,
     "name": "أحمد نوح سيدي سيدي",
     "num": "L22781",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 15,
     "note_istidrak": 15,
     "exam": 5,
     "test": 0,
     "name": "ينصره سيد محمد",
     "num": "L22782",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 19,
     "note_istidrak": 15,
     "exam": 3,
     "test": 4,
     "name": "فاطمة محمد عيسى بله",
     "num": "L22796",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 18,
     "note_istidrak": 15,
     "exam": 3,
     "test": 3,
     "name": "عائيش عبد اﷲ ميلود",
     "num": "L22804",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 18,
     "note_istidrak": 15,
     "exam": 2,
     "test": 3,
     "name": "لاله محمد الب لكويري",
     "num": "L22808",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 7,
     "note_istidrak": 5,
     "exam": 3,
     "test": 2,
     "name": "سيد محمد محمد ابراهيم لخليفه",
     "num": "L22809",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 17,
     "note_istidrak": 15,
     "exam": 4,
     "test": 2,
     "name": "انوه ينج الشيخ عبد اﷲ",
     "num": "L22810",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 16,
     "note_istidrak": 14,
     "exam": 3,
     "test": 2,
     "name": "مامه المخطار لبشاره",
     "num": "L22832",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 16,
     "note_istidrak": 15,
     "exam": 4,
     "test": 1,
     "name": "زينب محمد اعمر ويس",
     "num": "L22833",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 9,
     "note_istidrak": 7,
     "exam": 5,
     "test": 2,
     "name": "محمد عبد اﷲ اسلم",
     "num": "L22839",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 15,
     "note_istidrak": 13,
     "exam": 2,
     "test": 2,
     "name": "آمنة محمد أحمد الشيخ سيدي",
     "num": "L22846",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 7,
     "note_istidrak": 4,
     "exam": 3,
     "test": 3,
     "name": "محمد يحي بلاهي",
     "num": "L22864",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 8,
     "note_istidrak": 6,
     "exam": 4,
     "test": 2,
     "name": "تمن محمد السالك سيدها",
     "num": "L22868",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "القرار",
     "moy": "المعدل",
     "note_istidrak": "درجة الاستدراك",
     "exam": "درجة الامتحان",
     "test": "درجة الاختبار",
     "name": "الاسم",
     "num": "الرقم",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 9,
     "note_istidrak": 0,
     "exam": 4,
     "test": 5,
     "name": "اسحاق حامد يعقوب",
     "num": "L22875",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 8,
     "note_istidrak": 0,
     "exam": 4,
     "test": 4,
     "name": "محمد أحمدالتجاني جاه",
     "num": "L22878",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 18,
     "note_istidrak": 15,
     "exam": 3,
     "test": 3,
     "name": "لميمه محفوظ بونعامه",
     "num": "L22882",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 10,
     "note_istidrak": 9,
     "exam": 6,
     "test": 1,
     "name": "عبد اﷲ شيخو سيسى",
     "num": "L22889",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 15,
     "note_istidrak": 15,
     "exam": 3,
     "test": 0,
     "name": "عيشة ابراهيم امبارك",
     "num": "L22891",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 8,
     "note_istidrak": 0,
     "exam": 5,
     "test": 3,
     "name": "سيدي محمد المولود أنجاي",
     "num": "L22898",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 15,
     "note_istidrak": 15,
     "exam": 3,
     "test": 0,
     "name": "أم كلثوم اباخو محمد السالم",
     "num": "L22903",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 8,
     "note_istidrak": 5,
     "exam": 2,
     "test": 3,
     "name": "عايشه احمدو لمليح",
     "num": "L22907",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 16,
     "note_istidrak": 14,
     "exam": 4,
     "test": 2,
     "name": "الطيب محمدو أحمد السالم",
     "num": "L22917",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 8,
     "note_istidrak": 8,
     "exam": 3,
     "test": 0,
     "name": "مريم محمد سالم عفان",
     "num": "L22920",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": "14.5",
     "note_istidrak": 10,
     "exam": 0,
     "test": "4.5",
     "name": "الشيخ التجاني أحمد سالم",
     "num": "L22922",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 16,
     "note_istidrak": 15,
     "exam": 4,
     "test": 1,
     "name": "فاله افكراش امسيعيد",
     "num": "L22926",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 17,
     "note_istidrak": 15,
     "exam": 5,
     "test": 2,
     "name": "حنان محمد فاضل البشير",
     "num": "L22931",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 5,
     "note_istidrak": 0,
     "exam": 5,
     "test": 0,
     "name": "عيش باب سمي",
     "num": "L22933",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 5,
     "note_istidrak": 0,
     "exam": 2,
     "test": 3,
     "name": "مريم محمد محمود امد لبهم",
     "num": "L22965",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 17,
     "note_istidrak": 15,
     "exam": 2,
     "test": 2,
     "name": "ام المؤمنين محمدانفع البن",
     "num": "L22980",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 17,
     "note_istidrak": 15,
     "exam": 3,
     "test": 2,
     "name": "الزينة ادبيه منى",
     "num": "L22989",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 11,
     "note_istidrak": 10,
     "exam": 5,
     "test": 1,
     "name": "احمد احمدو بوبيط",
     "num": "L22997",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 17,
     "note_istidrak": 15,
     "exam": 3,
     "test": 2,
     "name": "محجوبة أحمدو بمب الصوفي",
     "num": "L23005",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 16,
     "note_istidrak": 13,
     "exam": 5,
     "test": 3,
     "name": "البتول يسلم يمب",
     "num": "L23035",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 16,
     "note_istidrak": 14,
     "exam": 3,
     "test": 2,
     "name": "فاطمة محمد بيين",
     "num": "L23125",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 13,
     "note_istidrak": 10,
     "exam": 6,
     "test": 3,
     "name": "عيشة عبد القادر أحمد موجي",
     "num": "L23166",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 14,
     "note_istidrak": 10,
     "exam": 4,
     "test": 4,
     "name": "الفن الساة سيد عمار",
     "num": "L23180",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 16,
     "note_istidrak": 13,
     "exam": 3,
     "test": 3,
     "name": "فاطمة سيدي اسند",
     "num": "L23188",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 10,
     "note_istidrak": 0,
     "exam": 7,
     "test": 3,
     "name": "خدجة زيدان العربي",
     "num": "L23195",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 17,
     "note_istidrak": 15,
     "exam": 4,
     "test": 2,
     "name": "ديديه زين سيد احمد أعل",
     "num": "L23203",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 14,
     "note_istidrak": 10,
     "exam": 5,
     "test": 4,
     "name": "مريم فايزة ابوبكر أبييجه",
     "num": "L23230",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 14,
     "note_istidrak": 13,
     "exam": 3,
     "test": 1,
     "name": "تل سيدي اسند",
     "num": "L23237",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 14,
     "note_istidrak": 13,
     "exam": 3,
     "test": 1,
     "name": "الشيخ صالح محمد فال عيسي",
     "num": "L23261",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "لم يستوف",
     "moy": "7.5",
     "note_istidrak": 0,
     "exam": 3,
     "test": "4.5",
     "name": "فاطم امباركه محمد السالك المهدي",
     "num": "L23267",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 18,
     "note_istidrak": 15,
     "exam": 3,
     "test": 3,
     "name": "نانه العالم اعبيدي",
     "num": "L23277",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 9,
     "note_istidrak": 0,
     "exam": 9,
     "test": 0,
     "name": "ياسين بنعمار",
     "num": "L23374",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 6,
     "note_istidrak": 0,
     "exam": 6,
     "test": 0,
     "name": "إيمان البريني",
     "num": "L23384",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 3,
     "note_istidrak": 0,
     "exam": 3,
     "test": 0,
     "name": "المصطفى محمد عبد الرحمن سيدي يحي",
     "num": "L23398",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 14,
     "note_istidrak": 12,
     "exam": 5,
     "test": 2,
     "name": "خدجة احمد افكينيش",
     "num": "L23416",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 8,
     "note_istidrak": 6,
     "exam": 5,
     "test": 2,
     "name": "فاطمة بابه أحمد الشيخ المصطف",
     "num": "L23430",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 10,
     "note_istidrak": 10,
     "exam": 8,
     "test": 0,
     "name": "أحمد محمدو يسلم سيد سالم",
     "num": "L23447",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 15,
     "note_istidrak": 14,
     "exam": 3,
     "test": 1,
     "name": "يحي حمود بوسيف",
     "num": "L23460",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 18,
     "note_istidrak": 15,
     "exam": 3,
     "test": 3,
     "name": "محجوبه أحمد بلاله",
     "num": "L23478",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 9,
     "note_istidrak": 9,
     "exam": 3,
     "test": 0,
     "name": "نفيسه محمد حرمه الأمين",
     "num": "L23492",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 17,
     "note_istidrak": 15,
     "exam": 1,
     "test": 2,
     "name": "مريم محمد العتيق محمد المختار",
     "num": "L23498",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 8,
     "note_istidrak": 6,
     "exam": 1,
     "test": 2,
     "name": "أحمد أحمد باب عمر",
     "num": "L23501",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 13,
     "note_istidrak": 9,
     "exam": 3,
     "test": 4,
     "name": "اقبال محمد محمود بيلاهي",
     "num": "L23533",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 18,
     "note_istidrak": 15,
     "exam": 3,
     "test": 3,
     "name": "زبيدة ماء العينين محمد الحسن",
     "num": "L23544",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 19,
     "note_istidrak": 15,
     "exam": 5,
     "test": 4,
     "name": "امباركه اسغير سالم",
     "num": "L23550",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 18,
     "note_istidrak": 15,
     "exam": 3,
     "test": 3,
     "name": "اطويلت لعمر محمد سالم يحى",
     "num": "L23563",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 17,
     "note_istidrak": 15,
     "exam": 3,
     "test": 2,
     "name": "محمد مولود محمدوببان",
     "num": "L23600",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 10,
     "note_istidrak": 5,
     "exam": 1,
     "test": 5,
     "name": "محمد سالم محمد ابريك",
     "num": "L23610",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 20,
     "note_istidrak": 15,
     "exam": 0,
     "test": 5,
     "name": "الشفاء محمد امين",
     "num": "L23619",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": "15.5",
     "note_istidrak": 14,
     "exam": 0,
     "test": "1.5",
     "name": "عزه لمام محمد المختار",
     "num": "L23621",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 3,
     "note_istidrak": 0,
     "exam": 3,
     "test": 0,
     "name": "سيدي محمد الحسن الزافي",
     "num": "L23646",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 7,
     "note_istidrak": 5,
     "exam": 2,
     "test": 2,
     "name": "خديجة المامون لمرابط",
     "num": "L23665",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 17,
     "note_istidrak": 15,
     "exam": 3,
     "test": 2,
     "name": "النانة اسلم سيد القاظي",
     "num": "L23669",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 10,
     "note_istidrak": 10,
     "exam": 9,
     "test": 0,
     "name": "فطمة محمد يسلم عبد اﷲ",
     "num": "L23711",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 7,
     "note_istidrak": 7,
     "exam": 3,
     "test": 0,
     "name": "عبد المحسن محمد عبد اﷲ محمد",
     "num": "L23750",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 2,
     "note_istidrak": 0,
     "exam": 0,
     "test": 2,
     "name": "مريم محمد المختار البوساتي",
     "num": "L23843",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "لم يستوف",
     "moy": "3.5",
     "note_istidrak": 0,
     "exam": 3,
     "test": "0.5",
     "name": "اخت البنين محمد الامين محمد سيدي",
     "num": "L23850",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "لم يستوف",
     "moy": "4.5",
     "note_istidrak": 0,
     "exam": "4.5",
     "test": 0,
     "name": "الشيخ محمد المامي",
     "num": "L23858",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 16,
     "note_istidrak": 15,
     "exam": 3,
     "test": 1,
     "name": "الماميه احمد عمار",
     "num": "L23889",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 3,
     "note_istidrak": 0,
     "exam": 3,
     "test": 0,
     "name": "ورده محمد سالم محمد العباس",
     "num": "L23890",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 12,
     "note_istidrak": 8,
     "exam": 3,
     "test": 4,
     "name": "عبد اﷲ سالو سوماري",
     "num": "L23903",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 15,
     "note_istidrak": 15,
     "exam": 3,
     "test": 0,
     "name": "محمد عمر محمد اليعقوبي",
     "num": "L23960",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 10,
     "note_istidrak": 10,
     "exam": 3,
     "test": 0,
     "name": "فاطمة محمد المختار سيداتي",
     "num": "L23978",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 9,
     "note_istidrak": 0,
     "exam": 9,
     "test": 0,
     "name": "محمدن السالم",
     "num": "L23982",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 14,
     "note_istidrak": 14,
     "exam": 3,
     "test": 0,
     "name": "ابراهيم الطالب دابو",
     "num": "L24033",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 8,
     "note_istidrak": 8,
     "exam": 3,
     "test": 0,
     "name": "مريم زيدان موسى",
     "num": "L24096",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 15,
     "note_istidrak": 15,
     "exam": 5,
     "test": 0,
     "name": "اطيبه محمد امبارك لكوري",
     "num": "L24180",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 10,
     "note_istidrak": 10,
     "exam": 6,
     "test": 0,
     "name": "السالم فال الحسين السملالي",
     "num": "L24185",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 15,
     "note_istidrak": 14,
     "exam": 3,
     "test": 1,
     "name": "ابراهيم اعمر مسعود",
     "num": "L24205",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "القرار",
     "moy": "المعدل",
     "note_istidrak": "درجة الاستدراك",
     "exam": "درجة الامتحان",
     "test": "درجة الاختبار",
     "name": "الاسم",
     "num": "الرقم",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 9,
     "note_istidrak": 0,
     "exam": 4,
     "test": 5,
     "name": "اسحاق حامد يعقوب",
     "num": "L22875",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 8,
     "note_istidrak": 0,
     "exam": 4,
     "test": 4,
     "name": "محمد أحمدالتجاني جاه",
     "num": "L22878",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 18,
     "note_istidrak": 15,
     "exam": 3,
     "test": 3,
     "name": "لميمه محفوظ بونعامه",
     "num": "L22882",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 10,
     "note_istidrak": 9,
     "exam": 6,
     "test": 1,
     "name": "عبد اﷲ شيخو سيسى",
     "num": "L22889",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 15,
     "note_istidrak": 15,
     "exam": 3,
     "test": 0,
     "name": "عيشة ابراهيم امبارك",
     "num": "L22891",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 8,
     "note_istidrak": 0,
     "exam": 5,
     "test": 3,
     "name": "سيدي محمد المولود أنجاي",
     "num": "L22898",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 15,
     "note_istidrak": 15,
     "exam": 3,
     "test": 0,
     "name": "أم كلثوم اباخو محمد السالم",
     "num": "L22903",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 8,
     "note_istidrak": 5,
     "exam": 2,
     "test": 3,
     "name": "عايشه احمدو لمليح",
     "num": "L22907",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 16,
     "note_istidrak": 14,
     "exam": 4,
     "test": 2,
     "name": "الطيب محمدو أحمد السالم",
     "num": "L22917",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 8,
     "note_istidrak": 8,
     "exam": 3,
     "test": 0,
     "name": "مريم محمد سالم عفان",
     "num": "L22920",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": "14.5",
     "note_istidrak": 10,
     "exam": 0,
     "test": "4.5",
     "name": "الشيخ التجاني أحمد سالم",
     "num": "L22922",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 16,
     "note_istidrak": 15,
     "exam": 4,
     "test": 1,
     "name": "فاله افكراش امسيعيد",
     "num": "L22926",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 17,
     "note_istidrak": 15,
     "exam": 5,
     "test": 2,
     "name": "حنان محمد فاضل البشير",
     "num": "L22931",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 5,
     "note_istidrak": 0,
     "exam": 5,
     "test": 0,
     "name": "عيش باب سمي",
     "num": "L22933",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 5,
     "note_istidrak": 0,
     "exam": 2,
     "test": 3,
     "name": "مريم محمد محمود امد لبهم",
     "num": "L22965",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 17,
     "note_istidrak": 15,
     "exam": 2,
     "test": 2,
     "name": "ام المؤمنين محمدانفع البن",
     "num": "L22980",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 17,
     "note_istidrak": 15,
     "exam": 3,
     "test": 2,
     "name": "الزينة ادبيه منى",
     "num": "L22989",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 11,
     "note_istidrak": 10,
     "exam": 5,
     "test": 1,
     "name": "احمد احمدو بوبيط",
     "num": "L22997",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 17,
     "note_istidrak": 15,
     "exam": 3,
     "test": 2,
     "name": "محجوبة أحمدو بمب الصوفي",
     "num": "L23005",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 16,
     "note_istidrak": 13,
     "exam": 5,
     "test": 3,
     "name": "البتول يسلم يمب",
     "num": "L23035",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 16,
     "note_istidrak": 14,
     "exam": 3,
     "test": 2,
     "name": "فاطمة محمد بيين",
     "num": "L23125",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 13,
     "note_istidrak": 10,
     "exam": 6,
     "test": 3,
     "name": "عيشة عبد القادر أحمد موجي",
     "num": "L23166",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 14,
     "note_istidrak": 10,
     "exam": 4,
     "test": 4,
     "name": "الفن الساة سيد عمار",
     "num": "L23180",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 16,
     "note_istidrak": 13,
     "exam": 3,
     "test": 3,
     "name": "فاطمة سيدي اسند",
     "num": "L23188",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 10,
     "note_istidrak": 0,
     "exam": 7,
     "test": 3,
     "name": "خدجة زيدان العربي",
     "num": "L23195",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 17,
     "note_istidrak": 15,
     "exam": 4,
     "test": 2,
     "name": "ديديه زين سيد احمد أعل",
     "num": "L23203",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 14,
     "note_istidrak": 10,
     "exam": 5,
     "test": 4,
     "name": "مريم فايزة ابوبكر أبييجه",
     "num": "L23230",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 14,
     "note_istidrak": 13,
     "exam": 3,
     "test": 1,
     "name": "تل سيدي اسند",
     "num": "L23237",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 14,
     "note_istidrak": 13,
     "exam": 3,
     "test": 1,
     "name": "الشيخ صالح محمد فال عيسي",
     "num": "L23261",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "لم يستوف",
     "moy": "7.5",
     "note_istidrak": 0,
     "exam": 3,
     "test": "4.5",
     "name": "فاطم امباركه محمد السالك المهدي",
     "num": "L23267",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 18,
     "note_istidrak": 15,
     "exam": 3,
     "test": 3,
     "name": "نانه العالم اعبيدي",
     "num": "L23277",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 9,
     "note_istidrak": 0,
     "exam": 9,
     "test": 0,
     "name": "ياسين بنعمار",
     "num": "L23374",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 6,
     "note_istidrak": 0,
     "exam": 6,
     "test": 0,
     "name": "إيمان البريني",
     "num": "L23384",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 3,
     "note_istidrak": 0,
     "exam": 3,
     "test": 0,
     "name": "المصطفى محمد عبد الرحمن سيدي يحي",
     "num": "L23398",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 14,
     "note_istidrak": 12,
     "exam": 5,
     "test": 2,
     "name": "خدجة احمد افكينيش",
     "num": "L23416",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 8,
     "note_istidrak": 6,
     "exam": 5,
     "test": 2,
     "name": "فاطمة بابه أحمد الشيخ المصطف",
     "num": "L23430",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 10,
     "note_istidrak": 10,
     "exam": 8,
     "test": 0,
     "name": "أحمد محمدو يسلم سيد سالم",
     "num": "L23447",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 15,
     "note_istidrak": 14,
     "exam": 3,
     "test": 1,
     "name": "يحي حمود بوسيف",
     "num": "L23460",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 18,
     "note_istidrak": 15,
     "exam": 3,
     "test": 3,
     "name": "محجوبه أحمد بلاله",
     "num": "L23478",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 9,
     "note_istidrak": 9,
     "exam": 3,
     "test": 0,
     "name": "نفيسه محمد حرمه الأمين",
     "num": "L23492",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 17,
     "note_istidrak": 15,
     "exam": 1,
     "test": 2,
     "name": "مريم محمد العتيق محمد المختار",
     "num": "L23498",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 8,
     "note_istidrak": 6,
     "exam": 1,
     "test": 2,
     "name": "أحمد أحمد باب عمر",
     "num": "L23501",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 13,
     "note_istidrak": 9,
     "exam": 3,
     "test": 4,
     "name": "اقبال محمد محمود بيلاهي",
     "num": "L23533",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 18,
     "note_istidrak": 15,
     "exam": 3,
     "test": 3,
     "name": "زبيدة ماء العينين محمد الحسن",
     "num": "L23544",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 19,
     "note_istidrak": 15,
     "exam": 5,
     "test": 4,
     "name": "امباركه اسغير سالم",
     "num": "L23550",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 18,
     "note_istidrak": 15,
     "exam": 3,
     "test": 3,
     "name": "اطويلت لعمر محمد سالم يحى",
     "num": "L23563",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 17,
     "note_istidrak": 15,
     "exam": 3,
     "test": 2,
     "name": "محمد مولود محمدوببان",
     "num": "L23600",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 10,
     "note_istidrak": 5,
     "exam": 1,
     "test": 5,
     "name": "محمد سالم محمد ابريك",
     "num": "L23610",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 20,
     "note_istidrak": 15,
     "exam": 0,
     "test": 5,
     "name": "الشفاء محمد امين",
     "num": "L23619",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": "15.5",
     "note_istidrak": 14,
     "exam": 0,
     "test": "1.5",
     "name": "عزه لمام محمد المختار",
     "num": "L23621",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 3,
     "note_istidrak": 0,
     "exam": 3,
     "test": 0,
     "name": "سيدي محمد الحسن الزافي",
     "num": "L23646",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 7,
     "note_istidrak": 5,
     "exam": 2,
     "test": 2,
     "name": "خديجة المامون لمرابط",
     "num": "L23665",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 17,
     "note_istidrak": 15,
     "exam": 3,
     "test": 2,
     "name": "النانة اسلم سيد القاظي",
     "num": "L23669",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 10,
     "note_istidrak": 10,
     "exam": 9,
     "test": 0,
     "name": "فطمة محمد يسلم عبد اﷲ",
     "num": "L23711",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 7,
     "note_istidrak": 7,
     "exam": 3,
     "test": 0,
     "name": "عبد المحسن محمد عبد اﷲ محمد",
     "num": "L23750",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 2,
     "note_istidrak": 0,
     "exam": 0,
     "test": 2,
     "name": "مريم محمد المختار البوساتي",
     "num": "L23843",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "لم يستوف",
     "moy": "3.5",
     "note_istidrak": 0,
     "exam": 3,
     "test": "0.5",
     "name": "اخت البنين محمد الامين محمد سيدي",
     "num": "L23850",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "لم يستوف",
     "moy": "4.5",
     "note_istidrak": 0,
     "exam": "4.5",
     "test": 0,
     "name": "الشيخ محمد المامي",
     "num": "L23858",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 16,
     "note_istidrak": 15,
     "exam": 3,
     "test": 1,
     "name": "الماميه احمد عمار",
     "num": "L23889",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 3,
     "note_istidrak": 0,
     "exam": 3,
     "test": 0,
     "name": "ورده محمد سالم محمد العباس",
     "num": "L23890",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 12,
     "note_istidrak": 8,
     "exam": 3,
     "test": 4,
     "name": "عبد اﷲ سالو سوماري",
     "num": "L23903",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 15,
     "note_istidrak": 15,
     "exam": 3,
     "test": 0,
     "name": "محمد عمر محمد اليعقوبي",
     "num": "L23960",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 10,
     "note_istidrak": 10,
     "exam": 3,
     "test": 0,
     "name": "فاطمة محمد المختار سيداتي",
     "num": "L23978",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 9,
     "note_istidrak": 0,
     "exam": 9,
     "test": 0,
     "name": "محمدن السالم",
     "num": "L23982",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 14,
     "note_istidrak": 14,
     "exam": 3,
     "test": 0,
     "name": "ابراهيم الطالب دابو",
     "num": "L24033",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 8,
     "note_istidrak": 8,
     "exam": 3,
     "test": 0,
     "name": "مريم زيدان موسى",
     "num": "L24096",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 15,
     "note_istidrak": 15,
     "exam": 5,
     "test": 0,
     "name": "اطيبه محمد امبارك لكوري",
     "num": "L24180",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 10,
     "note_istidrak": 10,
     "exam": 6,
     "test": 0,
     "name": "السالم فال الحسين السملالي",
     "num": "L24185",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": 15,
     "note_istidrak": 14,
     "exam": 3,
     "test": 1,
     "name": "ابراهيم اعمر مسعود",
     "num": "L24205",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "القرار",
     "moy": "المعدل",
     "note_istidrak": "درجة الاستدراك",
     "exam": "درجة الامتحان",
     "test": "درجة الاختبار",
     "name": "الاسم",
     "num": "الرقم",
     "mat": "الحديث و علومه1 "
    },
    {
     "dec": "استوفى",
     "moy": "15.5",
     "note_istidrak": 15,
     "exam": 4,
     "test": "0.5",
     "name": "عزيزة محمد الأمين اليعقوبي",
     "num": 18249,
     "mat": "أصول الدين1  "
    },
    {
     "dec": "لم يستوف",
     "moy": 4,
     "note_istidrak": 0,
     "exam": "3.5",
     "test": "0.5",
     "name": "امو احمدباباسماعيل",
     "num": 19349,
     "mat": "أصول الدين1  "
    },
    {
     "dec": "لم يستوف",
     "moy": 0,
     "note_istidrak": 0,
     "exam": 0,
     "test": 0,
     "name": "الشيخ القاضي أحمدو الشيخ أحمدو",
     "num": 19697,
     "mat": "أصول الدين1  "
    },
    {
     "dec": "لم يستوف",
     "moy": 1,
     "note_istidrak": 1,
     "exam": 0,
     "test": 0,
     "name": "محمد محمود المختار اعل",
     "num": 20441,
     "mat": "أصول الدين1  "
    },
    {
     "dec": "لم يستوف",
     "moy": "1.25",
     "note_istidrak": 1,
     "exam": 1,
     "test": "0.25",
     "name": "خديجة محمد شعيب محمد الأمين",
     "num": "L21192",
     "mat": "أصول الدين1  "
    },
    {
     "dec": "استوفى",
     "moy": 10,
     "note_istidrak": 10,
     "exam": 8,
     "test": 0,
     "name": "محمد فاضل محمد المامون الحاج",
     "num": "L21351",
     "mat": "أصول الدين1  "
    },
    {
     "dec": "استوفى",
     "moy": 10,
     "note_istidrak": 10,
     "exam": 8,
     "test": 0,
     "name": "محمد فاضل محمد المامون الحاج",
     "num": "L21351",
     "mat": "أصول الدين1  "
    },
    {
     "dec": "استوفى",
     "moy": "9.25",
     "note_istidrak": 2,
     "exam": "9.25",
     "test": 0,
     "name": "محمد هومن احمد سالم حمزة",
     "num": "L21771",
     "mat": "أصول الدين1  "
    },
    {
     "dec": "استوفى",
     "moy": 7,
     "note_istidrak": 2,
     "exam": 7,
     "test": 0,
     "name": "عيشة محمد المختار ميلود",
     "num": "L21902",
     "mat": "أصول الدين1  "
    },
    {
     "dec": "لم يستوف",
     "moy": 0,
     "note_istidrak": 0,
     "exam": 0,
     "test": 0,
     "name": "محمد محفوظ محمد عبد اﷲ كبود",
     "num": "L21960",
     "mat": "أصول الدين1  "
    },
    {
     "dec": "لم يستوف",
     "moy": 9,
     "note_istidrak": 5,
     "exam": 9,
     "test": 0,
     "name": "محمد محفوظ محمد عبد اﷲ كبود",
     "num": "L21960",
     "mat": "أصول الدين1  "
    },
    {
     "dec": "استوفى",
     "moy": "15.25",
     "note_istidrak": 15,
     "exam": 0,
     "test": "0.25",
     "name": "محجوبة زين العابدين أحمد زروق",
     "num": "L22060",
     "mat": "أصول الدين1  "
    },
    {
     "dec": "استوفى",
     "moy": "14.5",
     "note_istidrak": "14.5",
     "exam": 3,
     "test": 0,
     "name": "فاطمة دحود الحمد",
     "num": "L22120",
     "mat": "أصول الدين1  "
    },
    {
     "dec": "استوفى",
     "moy": "15.75",
     "note_istidrak": 15,
     "exam": "4.5",
     "test": "0.75",
     "name": "عبد اﷲ السالم احمدو فال الخيري",
     "num": "L22136",
     "mat": "أصول الدين1  "
    },
    {
     "dec": "استوفى",
     "moy": 16,
     "note_istidrak": 15,
     "exam": 3,
     "test": 1,
     "name": "فاطمة الخراشي باكي",
     "num": "L22170",
     "mat": "أصول الدين1  "
    },
    {
     "dec": "استوفى",
     "moy": "16.5",
     "note_istidrak": "14.5",
     "exam": 4,
     "test": 2,
     "name": "افيلاله أحمد الدوا",
     "num": "L22173",
     "mat": "أصول الدين1  "
    },
    {
     "dec": "استوفى",
     "moy": "15.25",
     "note_istidrak": 15,
     "exam": 1,
     "test": "0.25",
     "name": "عبداﷲ مختار السالم المختار السالم",
     "num": "L22213",
     "mat": "أصول الدين1  "
    },
    {
     "dec": "استوفى",
     "moy": 8,
     "note_istidrak": 8,
     "exam": 8,
     "test": 0,
     "name": "النين بوي النه الطالب اعل",
     "num": "L22215",
     "mat": "أصول الدين1  "
    },
    {
     "dec": "استوفى",
     "moy": "14.25",
     "note_istidrak": "13.5",
     "exam": "1.75",
     "test": "0.75",
     "name": "محمد عالي الشيخ محمد محمد الطاهر",
     "num": "L22229",
     "mat": "أصول الدين1  "
    },
    {
     "dec": "استوفى",
     "moy": "5.25",
     "note_istidrak": 5,
     "exam": 3,
     "test": "0.25",
     "name": "حم سيد بوي بلال",
     "num": "L22272",
     "mat": "أصول الدين1  "
    },
    {
     "dec": "استوفى",
     "moy": "17.5",
     "note_istidrak": 15,
     "exam": 1,
     "test": "2.5",
     "name": "ساره محمد فيصل امامه",
     "num": "L22287",
     "mat": "أصول الدين1  "
    },
    {
     "dec": "لم يستوف",
     "moy": "4.5",
     "note_istidrak": 0,
     "exam": "4.25",
     "test": "0.25",
     "name": "النموها محمد الامين عمار",
     "num": "L22320",
     "mat": "أصول الدين1  "
    },
    {
     "dec": "لم يستوف",
     "moy": "8.25",
     "note_istidrak": "7.5",
     "exam": 8,
     "test": "0.25",
     "name": "محمد ناجي السيد ابنو",
     "num": "L22340",
     "mat": "أصول الدين1  "
    },
    {
     "dec": "استوفى",
     "moy": 17,
     "note_istidrak": 15,
     "exam": 3,
     "test": 2,
     "name": "زينب محمد المختار بيبات",
     "num": "L22361",
     "mat": "أصول الدين1  "
    },
    {
     "dec": "استوفى",
     "moy": "17.25",
     "note_istidrak": 15,
     "exam": 6,
     "test": "2.25",
     "name": "عائشه الطالب عبد اﷲ الشيخ أحمد",
     "num": "L22362",
     "mat": "أصول الدين1  "
    },
    {
     "dec": "استوفى",
     "moy": "7.75",
     "note_istidrak": "7.5",
     "exam": 3,
     "test": "0.25",
     "name": "نسيبه محمد المختار حمود",
     "num": "L22369",
     "mat": "أصول الدين1  "
    },
    {
     "dec": "لم يستوف",
     "moy": "3.75",
     "note_istidrak": 0,
     "exam": "3.5",
     "test": "0.25",
     "name": "محمد المختار سيدن اتلاميد",
     "num": "L22379",
     "mat": "أصول الدين1  "
    },
    {
     "dec": "استوفى",
     "moy": 15,
     "note_istidrak": 15,
     "exam": "2.75",
     "test": 0,
     "name": "زينب محمد حبيب حبيب",
     "num": "L22394",
     "mat": "أصول الدين1  "
    },
    {
     "dec": "استوفى",
     "moy": 15,
     "note_istidrak": 15,
     "exam": "7.25",
     "test": 0,
     "name": "محمد فاضل ابنو",
     "num": "L22429",
     "mat": "أصول الدين1  "
    },
    {
     "dec": "استوفى",
     "moy": 16,
     "note_istidrak": 15,
     "exam": 1,
     "test": 1,
     "name": "اسماعيل محمد محمود بوبه",
     "num": "L22438",
     "mat": "أصول الدين1  "
    },
    {
     "dec": "لم يستوف",
     "moy": "0.25",
     "note_istidrak": 0,
     "exam": 0,
     "test": "0.25",
     "name": "أحمد سالم ابراهيم فال البخاري",
     "num": "L22447",
     "mat": "أصول الدين1  "
    },
    {
     "dec": "لم يستوف",
     "moy": "2.25",
     "note_istidrak": 0,
     "exam": 2,
     "test": "0.25",
     "name": "أسلام أحمد أعبيدل",
     "num": "L22478",
     "mat": "أصول الدين1  "
    },
    {
     "dec": "استوفى",
     "moy": "15.25",
     "note_istidrak": 15,
     "exam": 3,
     "test": "0.25",
     "name": "المختار السالم احمدو اصلاي",
     "num": "L22635",
     "mat": "أصول الدين1  "
    },
    {
     "dec": "استوفى",
     "moy": "15.25",
     "note_istidrak": 15,
     "exam": 1,
     "test": "0.25",
     "name": "الصديق سناد محمود الحاج",
     "num": "L22667",
     "mat": "أصول الدين1  "
    },
    {
     "dec": "استوفى",
     "moy": "13.25",
     "note_istidrak": 9,
     "exam": 0,
     "test": "4.25",
     "name": "أحمد باباه سيدي",
     "num": "L22679",
     "mat": "أصول الدين1  "
    },
    {
     "dec": "استوفى",
     "moy": "19.75",
     "note_istidrak": 15,
     "exam": 1,
     "test": "4.75",
     "name": "الشيخ جعفر احمد صافي",
     "num": "L22693",
     "mat": "أصول الدين1  "
    },
    {
     "dec": "استوفى",
     "moy": "15.5",
     "note_istidrak": 15,
     "exam": "4.75",
     "test": "0.5",
     "name": "خدجة محمد المختار محمد",
     "num": "L22697",
     "mat": "أصول الدين1  "
    },
    {
     "dec": "استوفى",
     "moy": "15.25",
     "note_istidrak": 15,
     "exam": 3,
     "test": "0.25",
     "name": "لال عيش سيد احمد الويمين",
     "num": "L22705",
     "mat": "أصول الدين1  "
    },
    {
     "dec": "استوفى",
     "moy": "6.75",
     "note_istidrak": 0,
     "exam": "4.25",
     "test": "2.5",
     "name": "محمد محمد عبد اﷲ محمد بوبه",
     "num": "L22715",
     "mat": "أصول الدين1  "
    },
    {
     "dec": "استوفى",
     "moy": "15.25",
     "note_istidrak": 15,
     "exam": 9,
     "test": "0.25",
     "name": "سيد أعمر محمد عبد اﷲ",
     "num": "L22717",
     "mat": "أصول الدين1  "
    },
    {
     "dec": "استوفى",
     "moy": "15.25",
     "note_istidrak": 15,
     "exam": "3.5",
     "test": "0.25",
     "name": "سيد محمد أواه آج",
     "num": "L22719",
     "mat": "أصول الدين1  "
    },
    {
     "dec": "استوفى",
     "moy": "15.25",
     "note_istidrak": 15,
     "exam": "2.5",
     "test": "0.25",
     "name": "محمد نافع ألمان النون",
     "num": "L22723",
     "mat": "أصول الدين1  "
    },
    {
     "dec": "استوفى",
     "moy": "9.25",
     "note_istidrak": 9,
     "exam": 1,
     "test": "0.25",
     "name": "محمدو لمين دودو",
     "num": "L22731",
     "mat": "أصول الدين1  "
    },
    {
     "dec": "استوفى",
     "moy": "15.25",
     "note_istidrak": 15,
     "exam": "3.5",
     "test": "0.25",
     "name": "ميمونه عبد الرحمن عبد القادر",
     "num": "L22735",
     "mat": "أصول الدين1  "
    },
    {
     "dec": "استوفى",
     "moy": 19,
     "note_istidrak": 15,
     "exam": 3,
     "test": 4,
     "name": "الطاهره الهيبه الشيخ محمد فاضل",
     "num": "L22737",
     "mat": "أصول الدين1  "
    },
    {
     "dec": "استوفى",
     "moy": "15.25",
     "note_istidrak": 15,
     "exam": 1,
     "test": "0.25",
     "name": "عيشة سيد عبد اﷲ اعليات",
     "num": "L22753",
     "mat": "أصول الدين1  "
    },
    {
     "dec": "استوفى",
     "moy": "19.75",
     "note_istidrak": 15,
     "exam": "3.5",
     "test": "4.75",
     "name": "حورية بوناه بوميه",
     "num": "L22759",
     "mat": "أصول الدين1  "
    },
    {
     "dec": "استوفى",
     "moy": 16,
     "note_istidrak": 15,
     "exam": 5,
     "test": 1,
     "name": "صفيه أحمد كوري السالكي",
     "num": "L22777",
     "mat": "أصول الدين1  "
    },
    {
     "dec": "لم يستوف",
     "moy": "2.25",
     "note_istidrak": 2,
     "exam": 1,
     "test": "0.25",
     "name": "أحمد نوح سيدي سيدي",
     "num": "L22781",
     "mat": "أصول الدين1  "
    },
    {
     "dec": "استوفى",
     "moy": 15,
     "note_istidrak": 15,
     "exam": "5.5",
     "test": 0,
     "name": "ينصره سيد محمد",
     "num": "L22782",
     "mat": "أصول الدين1  "
    },
    {
     "dec": "استوفى",
     "moy": "15.25",
     "note_istidrak": 15,
     "exam": 7,
     "test": "0.25",
     "name": "عائيش عبد اﷲ ميلود",
     "num": "L22804",
     "mat": "أصول الدين1  "
    },
    {
     "dec": "استوفى",
     "moy": "15.25",
     "note_istidrak": 15,
     "exam": "2.5",
     "test": "0.25",
     "name": "لاله محمد الب لكويري",
     "num": "L22808",
     "mat": "أصول الدين1  "
    },
    {
     "dec": "لم يستوف",
     "moy": 5,
     "note_istidrak": 2,
     "exam": "4.5",
     "test": "0.5",
     "name": "سيد محمد محمد ابراهيم لخليفه",
     "num": "L22809",
     "mat": "أصول الدين1  "
    },
    {
     "dec": "استوفى",
     "moy": 16,
     "note_istidrak": 15,
     "exam": 2,
     "test": 1,
     "name": "زينب محمد اعمر ويس",
     "num": "L22833",
     "mat": "أصول الدين1  "
    },
    {
     "dec": "استوفى",
     "moy": "15.25",
     "note_istidrak": 15,
     "exam": 1,
     "test": "0.25",
     "name": "محمد عبد اﷲ اسلم",
     "num": "L22839",
     "mat": "أصول الدين1  "
    },
    {
     "dec": "استوفى",
     "moy": "15.25",
     "note_istidrak": 15,
     "exam": 1,
     "test": "0.25",
     "name": "آمنة محمد أحمد الشيخ سيدي",
     "num": "L22846",
     "mat": "أصول الدين1  "
    },
    {
     "dec": "لم يستوف",
     "moy": "7.75",
     "note_istidrak": "7.5",
     "exam": "6.5",
     "test": "0.25",
     "name": "محمد يحي بلاهي",
     "num": "L22864",
     "mat": "أصول الدين1  "
    },
    {
     "dec": "استوفى",
     "moy": "19.25",
     "note_istidrak": 15,
     "exam": 2,
     "test": "4.25",
     "name": "تمن محمد السالك سيدها",
     "num": "L22868",
     "mat": "أصول الدين1  "
    },
    {
     "dec": "لم يستوف",
     "moy": "4.75",
     "note_istidrak": 0,
     "exam": "4.5",
     "test": "0.25",
     "name": "اسحاق حامد يعقوب",
     "num": "L22875",
     "mat": "أصول الدين1  "
    },
    {
     "dec": "لم يستوف",
     "moy": "4.75",
     "note_istidrak": 0,
     "exam": "4.5",
     "test": "0.25",
     "name": "محمد أحمدالتجاني جاه",
     "num": "L22878",
     "mat": "أصول الدين1  "
    },
    {
     "dec": "استوفى",
     "moy": "15.25",
     "note_istidrak": 15,
     "exam": 3,
     "test": "0.25",
     "name": "لميمه محفوظ بونعامه",
     "num": "L22882",
     "mat": "أصول الدين1  "
    },
    {
     "dec": "لم يستوف",
     "moy": 3,
     "note_istidrak": 2,
     "exam": 2,
     "test": 1,
     "name": "عبد اﷲ شيخو سيسى",
     "num": "L22889",
     "mat": "أصول الدين1  "
    },
    {
     "dec": "استوفى",
     "moy": "15.25",
     "note_istidrak": 15,
     "exam": "8.5",
     "test": "0.25",
     "name": "عيشة ابراهيم امبارك",
     "num": "L22891",
     "mat": "أصول الدين1  "
    },
    {
     "dec": "لم يستوف",
     "moy": 2,
     "note_istidrak": 0,
     "exam": 0,
     "test": 2,
     "name": "سيدي محمد المولود أنجاي",
     "num": "L22898",
     "mat": "أصول الدين1  "
    },
    {
     "dec": "استوفى",
     "moy": "15.25",
     "note_istidrak": 15,
     "exam": "3.25",
     "test": "0.25",
     "name": "أم كلثوم اباخو محمد السالم",
     "num": "L22903",
     "mat": "أصول الدين1  "
    },
    {
     "dec": "استوفى",
     "moy": "17.75",
     "note_istidrak": "14.5",
     "exam": 3,
     "test": "3.25",
     "name": "عايشه احمدو لمليح",
     "num": "L22907",
     "mat": "أصول الدين1  "
    },
    {
     "dec": "استوفى",
     "moy": "14.25",
     "note_istidrak": 14,
     "exam": 4,
     "test": "0.25",
     "name": "الطيب محمدو أحمد السالم",
     "num": "L22917",
     "mat": "أصول الدين1  "
    },
    {
     "dec": "القرار",
     "moy": "المعدل",
     "note_istidrak": "درجة الاستدراك",
     "exam": "درجة الامتحان",
     "test": "درجة الاختبار",
     "name": "الاسم",
     "num": "الرقم",
     "mat": "العقيد1 "
    },
    {
     "dec": "استوفى",
     "moy": "14.5",
     "note_istidrak": 10,
     "exam": 0,
     "test": "4.5",
     "name": "الشيخ التجاني أحمد سالم",
     "num": "L22922",
     "mat": "العقيد1 "
    },
    {
     "dec": "استوفى",
     "moy": "15.25",
     "note_istidrak": 15,
     "exam": "2.75",
     "test": "0.25",
     "name": "فاله افكراش امسيعيد",
     "num": "L22926",
     "mat": "العقيد1 "
    },
    {
     "dec": "لم يستوف",
     "moy": "3.75",
     "note_istidrak": 0,
     "exam": "3.25",
     "test": "0.5",
     "name": "حنان محمد فاضل البشير",
     "num": "L22931",
     "mat": "العقيد1 "
    },
    {
     "dec": "استوفى",
     "moy": 14,
     "note_istidrak": 14,
     "exam": 8,
     "test": 0,
     "name": "عيش باب سمي",
     "num": "L22933",
     "mat": "العقيد1 "
    },
    {
     "dec": "استوفى",
     "moy": "15.25",
     "note_istidrak": 15,
     "exam": "5.75",
     "test": "0.25",
     "name": "مريم محمد محمود امد لبهم",
     "num": "L22965",
     "mat": "العقيد1 "
    },
    {
     "dec": "استوفى",
     "moy": 19,
     "note_istidrak": 15,
     "exam": "3.75",
     "test": 4,
     "name": "ام المؤمنين محمدانفع البن",
     "num": "L22980",
     "mat": "العقيد1 "
    },
    {
     "dec": "استوفى",
     "moy": "15.25",
     "note_istidrak": 15,
     "exam": "8.75",
     "test": "0.25",
     "name": "الزينة ادبيه منى",
     "num": "L22989",
     "mat": "العقيد1 "
    },
    {
     "dec": "لم يستوف",
     "moy": "2.25",
     "note_istidrak": 0,
     "exam": 2,
     "test": "0.25",
     "name": "احمد احمدو بوبيط",
     "num": "L22997",
     "mat": "العقيد1 "
    },
    {
     "dec": "استوفى",
     "moy": 15,
     "note_istidrak": 15,
     "exam": 7,
     "test": 0,
     "name": "البتول يسلم يمب",
     "num": "L23035",
     "mat": "العقيد1 "
    },
    {
     "dec": "استوفى",
     "moy": "14.25",
     "note_istidrak": 14,
     "exam": "4.75",
     "test": "0.25",
     "name": "فاطمة محمد بيين",
     "num": "L23125",
     "mat": "العقيد1 "
    },
    {
     "dec": "استوفى",
     "moy": "14.25",
     "note_istidrak": 14,
     "exam": 3,
     "test": "0.25",
     "name": "عيشة عبد القادر أحمد موجي",
     "num": "L23166",
     "mat": "العقيد1 "
    },
    {
     "dec": "استوفى",
     "moy": "14.75",
     "note_istidrak": "14.5",
     "exam": 2,
     "test": "0.25",
     "name": "سيدي احمد محمد ممان",
     "num": "L23173",
     "mat": "العقيد1 "
    },
    {
     "dec": "استوفى",
     "moy": "17.5",
     "note_istidrak": 15,
     "exam": 3,
     "test": "2.5",
     "name": "الفن الساة سيد عمار",
     "num": "L23180",
     "mat": "العقيد1 "
    },
    {
     "dec": "استوفى",
     "moy": 14,
     "note_istidrak": 14,
     "exam": "5.5",
     "test": 0,
     "name": "فاطمة سيدي اسند",
     "num": "L23188",
     "mat": "العقيد1 "
    },
    {
     "dec": "استوفى",
     "moy": "15.25",
     "note_istidrak": 15,
     "exam": 3,
     "test": "0.25",
     "name": "ديديه زين سيد احمد أعل",
     "num": "L23203",
     "mat": "العقيد1 "
    },
    {
     "dec": "استوفى",
     "moy": 16,
     "note_istidrak": 15,
     "exam": 3,
     "test": 1,
     "name": "مريم فايزة ابوبكر أبييجه",
     "num": "L23230",
     "mat": "العقيد1 "
    },
    {
     "dec": "استوفى",
     "moy": "14.5",
     "note_istidrak": "14.5",
     "exam": 3,
     "test": 0,
     "name": "تل سيدي اسند",
     "num": "L23237",
     "mat": "العقيد1 "
    },
    {
     "dec": "استوفى",
     "moy": "8.75",
     "note_istidrak": 2,
     "exam": 6,
     "test": "2.75",
     "name": "الشيخ صالح محمد فال عيسي",
     "num": "L23261",
     "mat": "العقيد1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 5,
     "note_istidrak": 0,
     "exam": 1,
     "test": 4,
     "name": "فاطم امباركه محمد السالك المهدي",
     "num": "L23267",
     "mat": "العقيد1 "
    },
    {
     "dec": "استوفى",
     "moy": "15.25",
     "note_istidrak": 15,
     "exam": 3,
     "test": "0.25",
     "name": "فاطمة محمادو اميجن",
     "num": "L23354",
     "mat": "العقيد1 "
    },
    {
     "dec": "لم يستوف",
     "moy": "3.5",
     "note_istidrak": 2,
     "exam": 3,
     "test": "0.5",
     "name": "الشيخ محمد فاضل محمد الناجم",
     "num": "L23356",
     "mat": "العقيد1 "
    },
    {
     "dec": "لم يستوف",
     "moy": "7.5",
     "note_istidrak": 0,
     "exam": "7.5",
     "test": 0,
     "name": "ياسين بنعمار",
     "num": "L23374",
     "mat": "العقيد1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 9,
     "note_istidrak": 0,
     "exam": 9,
     "test": 0,
     "name": "إيمان البريني",
     "num": "L23384",
     "mat": "العقيد1 "
    },
    {
     "dec": "لم يستوف",
     "moy": "6.75",
     "note_istidrak": 0,
     "exam": "6.75",
     "test": 0,
     "name": "المصطفى محمد عبد الرحمن سيدي يحي",
     "num": "L23398",
     "mat": "العقيد1 "
    },
    {
     "dec": "استوفى",
     "moy": "15.25",
     "note_istidrak": 15,
     "exam": 2,
     "test": "0.25",
     "name": "خدجة احمد افكينيش",
     "num": "L23416",
     "mat": "العقيد1 "
    },
    {
     "dec": "استوفى",
     "moy": "14.25",
     "note_istidrak": 14,
     "exam": 1,
     "test": "0.25",
     "name": "فاطمة بابه أحمد الشيخ المصطف",
     "num": "L23430",
     "mat": "العقيد1 "
    },
    {
     "dec": "استوفى",
     "moy": "9.5",
     "note_istidrak": "7.5",
     "exam": "9.25",
     "test": "0.25",
     "name": "يحي حمود بوسيف",
     "num": "L23460",
     "mat": "العقيد1 "
    },
    {
     "dec": "استوفى",
     "moy": 9,
     "note_istidrak": 6,
     "exam": 3,
     "test": 3,
     "name": "محجوبه أحمد بلاله",
     "num": "L23478",
     "mat": "العقيد1 "
    },
    {
     "dec": "استوفى",
     "moy": "15.25",
     "note_istidrak": 15,
     "exam": 5,
     "test": "0.25",
     "name": "نفيسه محمد حرمه الأمين",
     "num": "L23492",
     "mat": "العقيد1 "
    },
    {
     "dec": "لم يستوف",
     "moy": "7.75",
     "note_istidrak": 1,
     "exam": "7.5",
     "test": "0.25",
     "name": "أحمد أحمد باب عمر",
     "num": "L23501",
     "mat": "العقيد1 "
    },
    {
     "dec": "استوفى",
     "moy": "17.25",
     "note_istidrak": "14.5",
     "exam": 6,
     "test": "2.75",
     "name": "اقبال محمد محمود بيلاهي",
     "num": "L23533",
     "mat": "العقيد1 "
    },
    {
     "dec": "استوفى",
     "moy": "15.25",
     "note_istidrak": 15,
     "exam": "2.25",
     "test": "0.25",
     "name": "زبيدة ماء العينين محمد الحسن",
     "num": "L23544",
     "mat": "العقيد1 "
    },
    {
     "dec": "استوفى",
     "moy": "6.5",
     "note_istidrak": 4,
     "exam": 0,
     "test": "2.5",
     "name": "اطويلت لعمر محمد سالم يحى",
     "num": "L23563",
     "mat": "العقيد1 "
    },
    {
     "dec": "استوفى",
     "moy": 15,
     "note_istidrak": 14,
     "exam": 7,
     "test": 1,
     "name": "محمد مولود محمدوببان",
     "num": "L23600",
     "mat": "العقيد1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 9,
     "note_istidrak": 2,
     "exam": 8,
     "test": 1,
     "name": "محمد سالم محمد ابريك",
     "num": "L23610",
     "mat": "العقيد1 "
    },
    {
     "dec": "استوفى",
     "moy": 19,
     "note_istidrak": 14,
     "exam": 0,
     "test": 5,
     "name": "الشفاء محمد امين",
     "num": "L23619",
     "mat": "العقيد1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 3,
     "note_istidrak": 0,
     "exam": 3,
     "test": 0,
     "name": "سيدي محمد الحسن الزافي",
     "num": "L23646",
     "mat": "العقيد1 "
    },
    {
     "dec": "استوفى",
     "moy": "15.25",
     "note_istidrak": 15,
     "exam": 8,
     "test": "0.25",
     "name": "النانة اسلم سيد القاظي",
     "num": "L23669",
     "mat": "العقيد1 "
    },
    {
     "dec": "استوفى",
     "moy": "15.25",
     "note_istidrak": 15,
     "exam": 5,
     "test": "0.25",
     "name": "فطمة محمد يسلم عبد اﷲ",
     "num": "L23711",
     "mat": "العقيد1 "
    },
    {
     "dec": "لم يستوف",
     "moy": "4.25",
     "note_istidrak": 0,
     "exam": 0,
     "test": "4.25",
     "name": "عبد المحسن محمد عبد اﷲ محمد",
     "num": "L23750",
     "mat": "العقيد1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 1,
     "note_istidrak": 0,
     "exam": 0,
     "test": 1,
     "name": "مريم محمد المختار البوساتي",
     "num": "L23843",
     "mat": "العقيد1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 6,
     "note_istidrak": 3,
     "exam": 3,
     "test": 3,
     "name": "اخت البنين محمد الامين محمد سيدي",
     "num": "L23850",
     "mat": "العقيد1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 9,
     "note_istidrak": 0,
     "exam": 9,
     "test": 0,
     "name": "الشيخ محمد المامي",
     "num": "L23858",
     "mat": "العقيد1 "
    },
    {
     "dec": "استوفى",
     "moy": 16,
     "note_istidrak": 15,
     "exam": "8.25",
     "test": 1,
     "name": "الماميه احمد عمار",
     "num": "L23889",
     "mat": "العقيد1 "
    },
    {
     "dec": "لم يستوف",
     "moy": "3.75",
     "note_istidrak": 0,
     "exam": "3.5",
     "test": "0.25",
     "name": "ورده محمد سالم محمد العباس",
     "num": "L23890",
     "mat": "العقيد1 "
    },
    {
     "dec": "لم يستوف",
     "moy": "4.25",
     "note_istidrak": 2,
     "exam": 4,
     "test": "0.25",
     "name": "عبد اﷲ سالو سوماري",
     "num": "L23903",
     "mat": "العقيد1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 4,
     "note_istidrak": 2,
     "exam": 3,
     "test": 1,
     "name": "محمد علي جالو",
     "num": "L23923",
     "mat": "العقيد1 "
    },
    {
     "dec": "استوفى",
     "moy": "7.75",
     "note_istidrak": "7.5",
     "exam": 3,
     "test": "0.25",
     "name": "محمد مختار بلدي",
     "num": "L23925",
     "mat": "العقيد1 "
    },
    {
     "dec": "استوفى",
     "moy": 15,
     "note_istidrak": 15,
     "exam": "4.5",
     "test": 0,
     "name": "فاطمة محمد المختار سيداتي",
     "num": "L23978",
     "mat": "العقيد1 "
    },
    {
     "dec": "استوفى",
     "moy": 8,
     "note_istidrak": "7.5",
     "exam": 8,
     "test": 0,
     "name": "ابراهيم الطالب دابو",
     "num": "L24033",
     "mat": "العقيد1 "
    },
    {
     "dec": "لم يستوف",
     "moy": "7.5",
     "note_istidrak": "7.5",
     "exam": 7,
     "test": 0,
     "name": "محمود باتلي",
     "num": "L24068",
     "mat": "العقيد1 "
    },
    {
     "dec": "استوفى",
     "moy": "14.25",
     "note_istidrak": 13,
     "exam": 7,
     "test": "1.25",
     "name": "مريم زيدان موسى",
     "num": "L24096",
     "mat": "العقيد1 "
    },
    {
     "dec": "استوفى",
     "moy": 15,
     "note_istidrak": 15,
     "exam": "3.75",
     "test": 0,
     "name": "اطيبه محمد امبارك لكوري",
     "num": "L24180",
     "mat": "العقيد1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 6,
     "note_istidrak": 5,
     "exam": 6,
     "test": 0,
     "name": "السالم فال الحسين السملالي",
     "num": "L24185",
     "mat": "العقيد1 "
    },
    {
     "dec": "استوفى",
     "moy": 14,
     "note_istidrak": 14,
     "exam": "7.5",
     "test": 0,
     "name": "ابراهيم اعمر مسعود",
     "num": "L24205",
     "mat": "العقيد1 "
    },
    {
     "dec": "القرار",
     "moy": "المعدل",
     "note_istidrak": "درجة الاستدراك",
     "exam": "درجة الامتحان",
     "test": "درجة الاختبار",
     "name": "الاسم",
     "num": "الرقم",
     "mat": "مدخل لدراسة أصول الفقه"
    },
    {
     "dec": "لم يستوف",
     "moy": 3,
     "note_istidrak": 0,
     "exam": 3,
     "test": 0,
     "name": "محمد لمين محفوظ سيد أحمد",
     "num": 5454,
     "mat": "مدخل لدراسة أصول الفقه"
    },
    {
     "dec": "لم يستوف",
     "moy": 5,
     "note_istidrak": 3,
     "exam": 3,
     "test": 2,
     "name": "عزيزة محمد الأمين اليعقوبي",
     "num": 18249,
     "mat": "مدخل لدراسة أصول الفقه"
    },
    {
     "dec": "لم يستوف",
     "moy": 8,
     "note_istidrak": 0,
     "exam": 5,
     "test": 3,
     "name": "امو احمدباباسماعيل",
     "num": 19349,
     "mat": "مدخل لدراسة أصول الفقه"
    },
    {
     "dec": "لم يستوف",
     "moy": 4,
     "note_istidrak": 4,
     "exam": 0,
     "test": 0,
     "name": "ميمونه محمذن حمدي",
     "num": "L21278",
     "mat": "مدخل لدراسة أصول الفقه"
    },
    {
     "dec": "لم يستوف",
     "moy": 7,
     "note_istidrak": 3,
     "exam": 5,
     "test": 2,
     "name": "ميمونه محمذن حمدي",
     "num": "L21278",
     "mat": "مدخل لدراسة أصول الفقه"
    },
    {
     "dec": "لم يستوف",
     "moy": 4,
     "note_istidrak": 0,
     "exam": 4,
     "test": 0,
     "name": "خديجة كابر بلال",
     "num": "L21480",
     "mat": "مدخل لدراسة أصول الفقه"
    },
    {
     "dec": "استوفى",
     "moy": 8,
     "note_istidrak": 0,
     "exam": 6,
     "test": 2,
     "name": "محمد محمد سيد آب",
     "num": "L21517",
     "mat": "مدخل لدراسة أصول الفقه"
    },
    {
     "dec": "استوفى",
     "moy": 5,
     "note_istidrak": 5,
     "exam": 4,
     "test": 0,
     "name": "محمد يحي محمد الأمجد أمباب",
     "num": "L21729",
     "mat": "مدخل لدراسة أصول الفقه"
    },
    {
     "dec": "لم يستوف",
     "moy": 5,
     "note_istidrak": 3,
     "exam": 3,
     "test": 2,
     "name": "محمد ابراهيم محمد الصغير",
     "num": "L21897",
     "mat": "مدخل لدراسة أصول الفقه"
    },
    {
     "dec": "استوفى",
     "moy": 6,
     "note_istidrak": 3,
     "exam": 6,
     "test": 0,
     "name": "عيشة محمد المختار ميلود",
     "num": "L21902",
     "mat": "مدخل لدراسة أصول الفقه"
    },
    {
     "dec": "لم يستوف",
     "moy": 0,
     "note_istidrak": 0,
     "exam": 0,
     "test": 0,
     "name": "محمد محفوظ محمد عبد اﷲ كبود",
     "num": "L21960",
     "mat": "مدخل لدراسة أصول الفقه"
    },
    {
     "dec": "لم يستوف",
     "moy": 7,
     "note_istidrak": 6,
     "exam": 7,
     "test": 0,
     "name": "فاطمة دحود الحمد",
     "num": "L22120",
     "mat": "مدخل لدراسة أصول الفقه"
    },
    {
     "dec": "استوفى",
     "moy": 7,
     "note_istidrak": 3,
     "exam": 4,
     "test": 3,
     "name": "عبد اﷲ السالم احمدو فال الخيري",
     "num": "L22136",
     "mat": "مدخل لدراسة أصول الفقه"
    },
    {
     "dec": "استوفى",
     "moy": 8,
     "note_istidrak": 3,
     "exam": 5,
     "test": 3,
     "name": "فاطمة الخراشي باكي",
     "num": "L22170",
     "mat": "مدخل لدراسة أصول الفقه"
    },
    {
     "dec": "استوفى",
     "moy": 8,
     "note_istidrak": 3,
     "exam": 5,
     "test": 3,
     "name": "عبداﷲ مختار السالم المختار السالم",
     "num": "L22213",
     "mat": "مدخل لدراسة أصول الفقه"
    },
    {
     "dec": "لم يستوف",
     "moy": 5,
     "note_istidrak": 0,
     "exam": 5,
     "test": 0,
     "name": "زينب محمد حبيب حبيب",
     "num": "L22394",
     "mat": "مدخل لدراسة أصول الفقه"
    },
    {
     "dec": "استوفى",
     "moy": 8,
     "note_istidrak": 4,
     "exam": 5,
     "test": 3,
     "name": "سلمان محمدون امبيريك",
     "num": "L22395",
     "mat": "مدخل لدراسة أصول الفقه"
    },
    {
     "dec": "لم يستوف",
     "moy": 4,
     "note_istidrak": 4,
     "exam": 0,
     "test": 0,
     "name": "محمد فاضل ابنو",
     "num": "L22429",
     "mat": "مدخل لدراسة أصول الفقه"
    },
    {
     "dec": "لم يستوف",
     "moy": 3,
     "note_istidrak": 0,
     "exam": 0,
     "test": 3,
     "name": "أحمد سالم ابراهيم فال البخاري",
     "num": "L22447",
     "mat": "مدخل لدراسة أصول الفقه"
    },
    {
     "dec": "استوفى",
     "moy": 7,
     "note_istidrak": 4,
     "exam": 7,
     "test": 0,
     "name": "سيد أحمد اركيب محمد عال عبد المجيد",
     "num": "L22674",
     "mat": "مدخل لدراسة أصول الفقه"
    },
    {
     "dec": "لم يستوف",
     "moy": 7,
     "note_istidrak": 3,
     "exam": 4,
     "test": 3,
     "name": "آمنة حمود الكوري",
     "num": "L22676",
     "mat": "مدخل لدراسة أصول الفقه"
    },
    {
     "dec": "لم يستوف",
     "moy": 4,
     "note_istidrak": 4,
     "exam": 4,
     "test": 0,
     "name": "أحمد باباه سيدي",
     "num": "L22679",
     "mat": "مدخل لدراسة أصول الفقه"
    },
    {
     "dec": "استوفى",
     "moy": 7,
     "note_istidrak": 4,
     "exam": 4,
     "test": 3,
     "name": "الشيخ جعفر احمد صافي",
     "num": "L22693",
     "mat": "مدخل لدراسة أصول الفقه"
    },
    {
     "dec": "استوفى",
     "moy": 8,
     "note_istidrak": 6,
     "exam": 5,
     "test": 2,
     "name": "خدجة محمد المختار محمد",
     "num": "L22697",
     "mat": "مدخل لدراسة أصول الفقه"
    },
    {
     "dec": "استوفى",
     "moy": 6,
     "note_istidrak": 3,
     "exam": 4,
     "test": 2,
     "name": "محمد محمد عبد اﷲ محمد بوبه",
     "num": "L22715",
     "mat": "مدخل لدراسة أصول الفقه"
    },
    {
     "dec": "استوفى",
     "moy": 9,
     "note_istidrak": 5,
     "exam": 6,
     "test": 3,
     "name": "محمد نافع ألمان النون",
     "num": "L22723",
     "mat": "مدخل لدراسة أصول الفقه"
    },
    {
     "dec": "لم يستوف",
     "moy": 8,
     "note_istidrak": 5,
     "exam": 5,
     "test": 3,
     "name": "محمدو لمين دودو",
     "num": "L22731",
     "mat": "مدخل لدراسة أصول الفقه"
    },
    {
     "dec": "لم يستوف",
     "moy": 8,
     "note_istidrak": 0,
     "exam": 5,
     "test": 3,
     "name": "محمد عبد اﷲ برهم",
     "num": "L22734",
     "mat": "مدخل لدراسة أصول الفقه"
    },
    {
     "dec": "استوفى",
     "moy": 15,
     "note_istidrak": 13,
     "exam": 5,
     "test": 2,
     "name": "ميمونه عبد الرحمن عبد القادر",
     "num": "L22735",
     "mat": "مدخل لدراسة أصول الفقه"
    },
    {
     "dec": "استوفى",
     "moy": 7,
     "note_istidrak": 3,
     "exam": 4,
     "test": 3,
     "name": "الطاهره الهيبه الشيخ محمد فاضل",
     "num": "L22737",
     "mat": "مدخل لدراسة أصول الفقه"
    },
    {
     "dec": "استوفى",
     "moy": 7,
     "note_istidrak": 5,
     "exam": 4,
     "test": 2,
     "name": "بابي محمد محمود سيد لمين المحمود",
     "num": "L22738",
     "mat": "مدخل لدراسة أصول الفقه"
    },
    {
     "dec": "استوفى",
     "moy": 9,
     "note_istidrak": 4,
     "exam": 7,
     "test": 2,
     "name": "عيشة سيد عبد اﷲ اعليات",
     "num": "L22753",
     "mat": "مدخل لدراسة أصول الفقه"
    },
    {
     "dec": "استوفى",
     "moy": 8,
     "note_istidrak": 4,
     "exam": 5,
     "test": 3,
     "name": "حورية بوناه بوميه",
     "num": "L22759",
     "mat": "مدخل لدراسة أصول الفقه"
    },
    {
     "dec": "لم يستوف",
     "moy": 8,
     "note_istidrak": 5,
     "exam": 4,
     "test": 3,
     "name": "أحمد نوح سيدي سيدي",
     "num": "L22781",
     "mat": "مدخل لدراسة أصول الفقه"
    },
    {
     "dec": "استوفى",
     "moy": 9,
     "note_istidrak": 4,
     "exam": 7,
     "test": 2,
     "name": "ينصره سيد محمد",
     "num": "L22782",
     "mat": "مدخل لدراسة أصول الفقه"
    },
    {
     "dec": "لم يستوف",
     "moy": 0,
     "note_istidrak": 0,
     "exam": 0,
     "test": 0,
     "name": "موسى الشيخ سيدي عالي",
     "num": "L22786",
     "mat": "مدخل لدراسة أصول الفقه"
    },
    {
     "dec": "لم يستوف",
     "moy": 3,
     "note_istidrak": 0,
     "exam": 0,
     "test": 3,
     "name": "فاطمة محمد عيسى بله",
     "num": "L22796",
     "mat": "مدخل لدراسة أصول الفقه"
    },
    {
     "dec": "استوفى",
     "moy": 7,
     "note_istidrak": 4,
     "exam": 5,
     "test": 2,
     "name": "عائيش عبد اﷲ ميلود",
     "num": "L22804",
     "mat": "مدخل لدراسة أصول الفقه"
    },
    {
     "dec": "استوفى",
     "moy": 5,
     "note_istidrak": 3,
     "exam": 3,
     "test": 2,
     "name": "لاله محمد الب لكويري",
     "num": "L22808",
     "mat": "مدخل لدراسة أصول الفقه"
    },
    {
     "dec": "لم يستوف",
     "moy": 8,
     "note_istidrak": 5,
     "exam": 3,
     "test": 3,
     "name": "سيد محمد محمد ابراهيم لخليفه",
     "num": "L22809",
     "mat": "مدخل لدراسة أصول الفقه"
    },
    {
     "dec": "استوفى",
     "moy": 6,
     "note_istidrak": 4,
     "exam": 4,
     "test": 2,
     "name": "انوه ينج الشيخ عبد اﷲ",
     "num": "L22810",
     "mat": "مدخل لدراسة أصول الفقه"
    },
    {
     "dec": "استوفى",
     "moy": 7,
     "note_istidrak": 5,
     "exam": 5,
     "test": 2,
     "name": "مامه المخطار لبشاره",
     "num": "L22832",
     "mat": "مدخل لدراسة أصول الفقه"
    },
    {
     "dec": "استوفى",
     "moy": 8,
     "note_istidrak": 5,
     "exam": 4,
     "test": 3,
     "name": "زينب محمد اعمر ويس",
     "num": "L22833",
     "mat": "مدخل لدراسة أصول الفقه"
    },
    {
     "dec": "استوفى",
     "moy": 6,
     "note_istidrak": 0,
     "exam": 3,
     "test": 3,
     "name": "آمنة محمد أحمد الشيخ سيدي",
     "num": "L22846",
     "mat": "مدخل لدراسة أصول الفقه"
    },
    {
     "dec": "لم يستوف",
     "moy": 6,
     "note_istidrak": 0,
     "exam": 4,
     "test": 2,
     "name": "الزهره محمد الدوه",
     "num": "L22853",
     "mat": "مدخل لدراسة أصول الفقه"
    },
    {
     "dec": "لم يستوف",
     "moy": 4,
     "note_istidrak": 4,
     "exam": 4,
     "test": 0,
     "name": "ابراهيم المين ابراهيمات",
     "num": "L22860",
     "mat": "مدخل لدراسة أصول الفقه"
    },
    {
     "dec": "استوفى",
     "moy": 7,
     "note_istidrak": 4,
     "exam": 5,
     "test": 2,
     "name": "تمن محمد السالك سيدها",
     "num": "L22868",
     "mat": "مدخل لدراسة أصول الفقه"
    },
    {
     "dec": "لم يستوف",
     "moy": 7,
     "note_istidrak": 0,
     "exam": 4,
     "test": 3,
     "name": "اسحاق حامد يعقوب",
     "num": "L22875",
     "mat": "مدخل لدراسة أصول الفقه"
    },
    {
     "dec": "لم يستوف",
     "moy": 6,
     "note_istidrak": 0,
     "exam": 4,
     "test": 2,
     "name": "محمد أحمدالتجاني جاه",
     "num": "L22878",
     "mat": "مدخل لدراسة أصول الفقه"
    },
    {
     "dec": "استوفى",
     "moy": 7,
     "note_istidrak": 3,
     "exam": 5,
     "test": 2,
     "name": "لميمه محفوظ بونعامه",
     "num": "L22882",
     "mat": "مدخل لدراسة أصول الفقه"
    },
    {
     "dec": "لم يستوف",
     "moy": 5,
     "note_istidrak": 0,
     "exam": 5,
     "test": 0,
     "name": "عبد اﷲ شيخو سيسى",
     "num": "L22889",
     "mat": "مدخل لدراسة أصول الفقه"
    },
    {
     "dec": "استوفى",
     "moy": 7,
     "note_istidrak": 4,
     "exam": 5,
     "test": 2,
     "name": "عيشة ابراهيم امبارك",
     "num": "L22891",
     "mat": "مدخل لدراسة أصول الفقه"
    },
    {
     "dec": "لم يستوف",
     "moy": 6,
     "note_istidrak": 0,
     "exam": 4,
     "test": 2,
     "name": "محمد محفوظ محمد عبد اﷲ",
     "num": "L22893",
     "mat": "مدخل لدراسة أصول الفقه"
    },
    {
     "dec": "لم يستوف",
     "moy": 7,
     "note_istidrak": 0,
     "exam": 4,
     "test": 3,
     "name": "سيدي محمد المولود أنجاي",
     "num": "L22898",
     "mat": "مدخل لدراسة أصول الفقه"
    },
    {
     "dec": "استوفى",
     "moy": 7,
     "note_istidrak": 3,
     "exam": 5,
     "test": 2,
     "name": "أم كلثوم اباخو محمد السالم",
     "num": "L22903",
     "mat": "مدخل لدراسة أصول الفقه"
    },
    {
     "dec": "لم يستوف",
     "moy": 7,
     "note_istidrak": 0,
     "exam": 4,
     "test": 3,
     "name": "عايشه احمدو لمليح",
     "num": "L22907",
     "mat": "مدخل لدراسة أصول الفقه"
    },
    {
     "dec": "استوفى",
     "moy": 7,
     "note_istidrak": 3,
     "exam": 5,
     "test": 2,
     "name": "الطيب محمدو أحمد السالم",
     "num": "L22917",
     "mat": "مدخل لدراسة أصول الفقه"
    },
    {
     "dec": "لم يستوف",
     "moy": 5,
     "note_istidrak": 3,
     "exam": 5,
     "test": 0,
     "name": "مريم محمد سالم عفان",
     "num": "L22920",
     "mat": "مدخل لدراسة أصول الفقه"
    },
    {
     "dec": "استوفى",
     "moy": 11,
     "note_istidrak": 8,
     "exam": 0,
     "test": 3,
     "name": "الشيخ التجاني أحمد سالم",
     "num": "L22922",
     "mat": "مدخل لدراسة أصول الفقه"
    },
    {
     "dec": "استوفى",
     "moy": 8,
     "note_istidrak": 3,
     "exam": 5,
     "test": 3,
     "name": "حنان محمد فاضل البشير",
     "num": "L22931",
     "mat": "مدخل لدراسة أصول الفقه"
    },
    {
     "dec": "لم يستوف",
     "moy": 8,
     "note_istidrak": 4,
     "exam": 8,
     "test": 0,
     "name": "عيش باب سمي",
     "num": "L22933",
     "mat": "مدخل لدراسة أصول الفقه"
    },
    {
     "dec": "لم يستوف",
     "moy": 6,
     "note_istidrak": 3,
     "exam": 3,
     "test": 3,
     "name": "مريم محمد عبد الرحمان آب جدوا",
     "num": "L22962",
     "mat": "مدخل لدراسة أصول الفقه"
    },
    {
     "dec": "استوفى",
     "moy": 7,
     "note_istidrak": 3,
     "exam": 4,
     "test": 3,
     "name": "مريم محمد محمود امد لبهم",
     "num": "L22965",
     "mat": "مدخل لدراسة أصول الفقه"
    },
    {
     "dec": "استوفى",
     "moy": 5,
     "note_istidrak": 0,
     "exam": 3,
     "test": 2,
     "name": "محمد مولود محمد انديات",
     "num": "L22972",
     "mat": "مدخل لدراسة أصول الفقه"
    },
    {
     "dec": "استوفى",
     "moy": 7,
     "note_istidrak": 4,
     "exam": 4,
     "test": 3,
     "name": "ام المؤمنين محمدانفع البن",
     "num": "L22980",
     "mat": "مدخل لدراسة أصول الفقه"
    },
    {
     "dec": "استوفى",
     "moy": 6,
     "note_istidrak": 3,
     "exam": 4,
     "test": 2,
     "name": "محجوبة أحمدو بمب الصوفي",
     "num": "L23005",
     "mat": "مدخل لدراسة أصول الفقه"
    },
    {
     "dec": "لم يستوف",
     "moy": 5,
     "note_istidrak": 5,
     "exam": 4,
     "test": 0,
     "name": "البتول يسلم يمب",
     "num": "L23035",
     "mat": "مدخل لدراسة أصول الفقه"
    },
    {
     "dec": "استوفى",
     "moy": 7,
     "note_istidrak": 4,
     "exam": 3,
     "test": 3,
     "name": "الفن الساة سيد عمار",
     "num": "L23180",
     "mat": "مدخل لدراسة أصول الفقه"
    },
    {
     "dec": "لم يستوف",
     "moy": 4,
     "note_istidrak": 3,
     "exam": 4,
     "test": 0,
     "name": "فاطمة سيدي اسند",
     "num": "L23188",
     "mat": "مدخل لدراسة أصول الفقه"
    },
    {
     "dec": "استوفى",
     "moy": 7,
     "note_istidrak": 0,
     "exam": 4,
     "test": 3,
     "name": "خدجة زيدان العربي",
     "num": "L23195",
     "mat": "مدخل لدراسة أصول الفقه"
    },
    {
     "dec": "لم يستوف",
     "moy": 8,
     "note_istidrak": 4,
     "exam": 8,
     "test": 0,
     "name": "الداه المان من اﷲ",
     "num": "L23204",
     "mat": "مدخل لدراسة أصول الفقه"
    },
    {
     "dec": "لم يستوف",
     "moy": 5,
     "note_istidrak": 5,
     "exam": 4,
     "test": 0,
     "name": "تل سيدي اسند",
     "num": "L23237",
     "mat": "مدخل لدراسة أصول الفقه"
    },
    {
     "dec": "لم يستوف",
     "moy": 4,
     "note_istidrak": 4,
     "exam": 4,
     "test": 0,
     "name": "الشيخ صالح محمد فال عيسي",
     "num": "L23261",
     "mat": "مدخل لدراسة أصول الفقه"
    },
    {
     "dec": "لم يستوف",
     "moy": 7,
     "note_istidrak": 0,
     "exam": 4,
     "test": 3,
     "name": "فاطم امباركه محمد السالك المهدي",
     "num": "L23267",
     "mat": "مدخل لدراسة أصول الفقه"
    },
    {
     "dec": "استوفى",
     "moy": 8,
     "note_istidrak": 4,
     "exam": 6,
     "test": 2,
     "name": "نانه العالم اعبيدي",
     "num": "L23277",
     "mat": "مدخل لدراسة أصول الفقه"
    },
    {
     "dec": "استوفى",
     "moy": 8,
     "note_istidrak": 0,
     "exam": 6,
     "test": 2,
     "name": "الشيخ محمد فاضل محمد الناجم",
     "num": "L23356",
     "mat": "مدخل لدراسة أصول الفقه"
    },
    {
     "dec": "لم يستوف",
     "moy": 8,
     "note_istidrak": 0,
     "exam": 8,
     "test": 0,
     "name": "إيمان البريني",
     "num": "L23384",
     "mat": "مدخل لدراسة أصول الفقه"
    },
    {
     "dec": "لم يستوف",
     "moy": 6,
     "note_istidrak": 0,
     "exam": 6,
     "test": 0,
     "name": "المصطفى محمد عبد الرحمن سيدي يحي",
     "num": "L23398",
     "mat": "مدخل لدراسة أصول الفقه"
    },
    {
     "dec": "استوفى",
     "moy": 8,
     "note_istidrak": 4,
     "exam": 5,
     "test": 3,
     "name": "خدجة احمد افكينيش",
     "num": "L23416",
     "mat": "مدخل لدراسة أصول الفقه"
    },
    {
     "dec": "استوفى",
     "moy": 7,
     "note_istidrak": 3,
     "exam": 4,
     "test": 3,
     "name": "فاطمة بابه أحمد الشيخ المصطف",
     "num": "L23430",
     "mat": "مدخل لدراسة أصول الفقه"
    },
    {
     "dec": "لم يستوف",
     "moy": 3,
     "note_istidrak": 0,
     "exam": 3,
     "test": 0,
     "name": "نفيسه محمد حرمه الأمين",
     "num": "L23492",
     "mat": "مدخل لدراسة أصول الفقه"
    },
    {
     "dec": "استوفى",
     "moy": 6,
     "note_istidrak": 3,
     "exam": 3,
     "test": 3,
     "name": "مريم محمد العتيق محمد المختار",
     "num": "L23498",
     "mat": "مدخل لدراسة أصول الفقه"
    },
    {
     "dec": "استوفى",
     "moy": 8,
     "note_istidrak": 6,
     "exam": 6,
     "test": 2,
     "name": "أحمد أحمد باب عمر",
     "num": "L23501",
     "mat": "مدخل لدراسة أصول الفقه"
    },
    {
     "dec": "استوفى",
     "moy": 9,
     "note_istidrak": 6,
     "exam": 5,
     "test": 3,
     "name": "اقبال محمد محمود بيلاهي",
     "num": "L23533",
     "mat": "مدخل لدراسة أصول الفقه"
    },
    {
     "dec": "استوفى",
     "moy": 9,
     "note_istidrak": 3,
     "exam": 6,
     "test": 3,
     "name": "زبيدة ماء العينين محمد الحسن",
     "num": "L23544",
     "mat": "مدخل لدراسة أصول الفقه"
    },
    {
     "dec": "استوفى",
     "moy": 9,
     "note_istidrak": 4,
     "exam": 6,
     "test": 3,
     "name": "محمد مولود محمدوببان",
     "num": "L23600",
     "mat": "مدخل لدراسة أصول الفقه"
    },
    {
     "dec": "لم يستوف",
     "moy": 2,
     "note_istidrak": 0,
     "exam": 0,
     "test": 2,
     "name": "سلمه محمد عبداﷲ محمد الولي",
     "num": "L23601",
     "mat": "مدخل لدراسة أصول الفقه"
    },
    {
     "dec": "استوفى",
     "moy": 10,
     "note_istidrak": 6,
     "exam": 0,
     "test": 4,
     "name": "الشفاء محمد امين",
     "num": "L23619",
     "mat": "مدخل لدراسة أصول الفقه"
    },
    {
     "dec": "استوفى",
     "moy": 7,
     "note_istidrak": 3,
     "exam": 4,
     "test": 3,
     "name": "عزه لمام محمد المختار",
     "num": "L23621",
     "mat": "مدخل لدراسة أصول الفقه"
    },
    {
     "dec": "لم يستوف",
     "moy": 6,
     "note_istidrak": 0,
     "exam": 6,
     "test": 0,
     "name": "سيدي محمد الحسن الزافي",
     "num": "L23646",
     "mat": "مدخل لدراسة أصول الفقه"
    },
    {
     "dec": "استوفى",
     "moy": 8,
     "note_istidrak": 3,
     "exam": 6,
     "test": 2,
     "name": "النانة اسلم سيد القاظي",
     "num": "L23669",
     "mat": "مدخل لدراسة أصول الفقه"
    },
    {
     "dec": "استوفى",
     "moy": 6,
     "note_istidrak": 4,
     "exam": 3,
     "test": 2,
     "name": "محمد البشير سعد بوه نور الدين",
     "num": "L23673",
     "mat": "مدخل لدراسة أصول الفقه"
    },
    {
     "dec": "لم يستوف",
     "moy": 6,
     "note_istidrak": 0,
     "exam": 6,
     "test": 0,
     "name": "فطمة محمد يسلم عبد اﷲ",
     "num": "L23711",
     "mat": "مدخل لدراسة أصول الفقه"
    },
    {
     "dec": "لم يستوف",
     "moy": 7,
     "note_istidrak": 0,
     "exam": 5,
     "test": 2,
     "name": "مريم محمد المختار البوساتي",
     "num": "L23843",
     "mat": "مدخل لدراسة أصول الفقه"
    },
    {
     "dec": "لم يستوف",
     "moy": 8,
     "note_istidrak": 0,
     "exam": 5,
     "test": 3,
     "name": "زينب محمد احميده",
     "num": "L23881",
     "mat": "مدخل لدراسة أصول الفقه"
    },
    {
     "dec": "لم يستوف",
     "moy": 2,
     "note_istidrak": 0,
     "exam": 0,
     "test": 2,
     "name": "ورده محمد سالم محمد العباس",
     "num": "L23890",
     "mat": "مدخل لدراسة أصول الفقه"
    },
    {
     "dec": "استوفى",
     "moy": 6,
     "note_istidrak": 4,
     "exam": 4,
     "test": 2,
     "name": "محمد مختار بلدي",
     "num": "L23925",
     "mat": "مدخل لدراسة أصول الفقه"
    },
    {
     "dec": "لم يستوف",
     "moy": 6,
     "note_istidrak": 3,
     "exam": 4,
     "test": 2,
     "name": "محمد عمر محمد اليعقوبي",
     "num": "L23960",
     "mat": "مدخل لدراسة أصول الفقه"
    },
    {
     "dec": "لم يستوف",
     "moy": 5,
     "note_istidrak": 5,
     "exam": 5,
     "test": 0,
     "name": "فاطمة محمد المختار سيداتي",
     "num": "L23978",
     "mat": "مدخل لدراسة أصول الفقه"
    },
    {
     "dec": "لم يستوف",
     "moy": 4,
     "note_istidrak": 0,
     "exam": 4,
     "test": 0,
     "name": "محمدن السالم",
     "num": "L23982",
     "mat": "مدخل لدراسة أصول الفقه"
    },
    {
     "dec": "لم يستوف",
     "moy": 4,
     "note_istidrak": 3,
     "exam": 4,
     "test": 0,
     "name": "ابراهيم الطالب دابو",
     "num": "L24033",
     "mat": "مدخل لدراسة أصول الفقه"
    },
    {
     "dec": "استوفى",
     "moy": 5,
     "note_istidrak": 5,
     "exam": 3,
     "test": 0,
     "name": "محمود باتلي",
     "num": "L24068",
     "mat": "مدخل لدراسة أصول الفقه"
    },
    {
     "dec": "استوفى",
     "moy": 7,
     "note_istidrak": 4,
     "exam": 5,
     "test": 2,
     "name": "مريم زيدان موسى",
     "num": "L24096",
     "mat": "مدخل لدراسة أصول الفقه"
    },
    {
     "dec": "استوفى",
     "moy": 5,
     "note_istidrak": 4,
     "exam": 5,
     "test": 0,
     "name": "دبو محمد المختار الشيخ",
     "num": "L24202",
     "mat": "مدخل لدراسة أصول الفقه"
    },
    {
     "dec": "لم يستوف",
     "moy": 4,
     "note_istidrak": 0,
     "exam": 4,
     "test": 0,
     "name": "ابراهيم اعمر مسعود",
     "num": "L24205",
     "mat": "مدخل لدراسة أصول الفقه"
    },
    {
     "dec": "لم يستوف",
     "moy": 3,
     "note_istidrak": 0,
     "exam": 0,
     "test": 3,
     "name": "محمد الامين خطري ابكر",
     "num": "L24241",
     "mat": "مدخل لدراسة أصول الفقه"
    },
    {
     "dec": "القرار",
     "moy": "المعدل",
     "note_istidrak": "درجة الاستدراك",
     "exam": "درجة الامتحان",
     "test": "درجة الاختبار",
     "name": "الاسم",
     "num": "الرقم",
     "mat": "فقه العبادات1 "
    },
    {
     "dec": "استوفى",
     "moy": 8,
     "note_istidrak": 0,
     "exam": 8,
     "test": 0,
     "name": "محمد محمد سيد آب",
     "num": "L21517",
     "mat": "فقه العبادات1 "
    },
    {
     "dec": "استوفى",
     "moy": 6,
     "note_istidrak": 6,
     "exam": 3,
     "test": 0,
     "name": "محمد يحي محمد الأمجد أمباب",
     "num": "L21729",
     "mat": "فقه العبادات1 "
    },
    {
     "dec": "لم يستوف",
     "moy": "8.5",
     "note_istidrak": 0,
     "exam": 7,
     "test": "1.5",
     "name": "محمد ابراهيم محمد الصغير",
     "num": "L21897",
     "mat": "فقه العبادات1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 4,
     "note_istidrak": 0,
     "exam": 0,
     "test": 4,
     "name": "يحي محمدن أحمد مسكه",
     "num": "L21920",
     "mat": "فقه العبادات1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 4,
     "note_istidrak": 0,
     "exam": 0,
     "test": 4,
     "name": "محمد محفوظ محمد عبد اﷲ كبود",
     "num": "L21960",
     "mat": "فقه العبادات1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 5,
     "note_istidrak": 0,
     "exam": 0,
     "test": 5,
     "name": "أحمد سالم ابراهيم فال البخاري",
     "num": "L22447",
     "mat": "فقه العبادات1 "
    },
    {
     "dec": "استوفى",
     "moy": 10,
     "note_istidrak": 10,
     "exam": 7,
     "test": 0,
     "name": "الشيخ جعفر احمد صافي",
     "num": "L22693",
     "mat": "فقه العبادات1 "
    },
    {
     "dec": "استوفى",
     "moy": 12,
     "note_istidrak": 8,
     "exam": 7,
     "test": 4,
     "name": "محمد عبد اﷲ برهم",
     "num": "L22734",
     "mat": "فقه العبادات1 "
    },
    {
     "dec": "استوفى",
     "moy": 11,
     "note_istidrak": 7,
     "exam": 5,
     "test": 4,
     "name": "الطاهره الهيبه الشيخ محمد فاضل",
     "num": "L22737",
     "mat": "فقه العبادات1 "
    },
    {
     "dec": "استوفى",
     "moy": 11,
     "note_istidrak": 8,
     "exam": 6,
     "test": 3,
     "name": "بابي محمد محمود سيد لمين المحمود",
     "num": "L22738",
     "mat": "فقه العبادات1 "
    },
    {
     "dec": "استوفى",
     "moy": 11,
     "note_istidrak": 8,
     "exam": 6,
     "test": 3,
     "name": "عيشة سيد عبد اﷲ اعليات",
     "num": "L22753",
     "mat": "فقه العبادات1 "
    },
    {
     "dec": "استوفى",
     "moy": 11,
     "note_istidrak": 7,
     "exam": 4,
     "test": 4,
     "name": "أحمد نوح سيدي سيدي",
     "num": "L22781",
     "mat": "فقه العبادات1 "
    },
    {
     "dec": "استوفى",
     "moy": 9,
     "note_istidrak": 6,
     "exam": 5,
     "test": 3,
     "name": "لاله محمد الب لكويري",
     "num": "L22808",
     "mat": "فقه العبادات1 "
    },
    {
     "dec": "استوفى",
     "moy": 10,
     "note_istidrak": 6,
     "exam": 4,
     "test": 4,
     "name": "سيد محمد محمد ابراهيم لخليفه",
     "num": "L22809",
     "mat": "فقه العبادات1 "
    },
    {
     "dec": "استوفى",
     "moy": 15,
     "note_istidrak": 12,
     "exam": 0,
     "test": 3,
     "name": "عبد اﷲ محمد باب أوفي",
     "num": "L22849",
     "mat": "فقه العبادات1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 5,
     "note_istidrak": 0,
     "exam": 5,
     "test": 0,
     "name": "الزهره محمد الدوه",
     "num": "L22853",
     "mat": "فقه العبادات1 "
    },
    {
     "dec": "لم يستوف",
     "moy": "6.5",
     "note_istidrak": 5,
     "exam": 4,
     "test": "1.5",
     "name": "ابراهيم المين ابراهيمات",
     "num": "L22860",
     "mat": "فقه العبادات1 "
    },
    {
     "dec": "استوفى",
     "moy": 12,
     "note_istidrak": 8,
     "exam": 4,
     "test": 4,
     "name": "تمن محمد السالك سيدها",
     "num": "L22868",
     "mat": "فقه العبادات1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 9,
     "note_istidrak": 0,
     "exam": 5,
     "test": 4,
     "name": "محمد أحمدالتجاني جاه",
     "num": "L22878",
     "mat": "فقه العبادات1 "
    },
    {
     "dec": "استوفى",
     "moy": 12,
     "note_istidrak": 8,
     "exam": 5,
     "test": 4,
     "name": "عبد اﷲ شيخو سيسى",
     "num": "L22889",
     "mat": "فقه العبادات1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 4,
     "note_istidrak": 0,
     "exam": 0,
     "test": 4,
     "name": "سيدي محمد المولود أنجاي",
     "num": "L22898",
     "mat": "فقه العبادات1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 8,
     "note_istidrak": 8,
     "exam": 7,
     "test": 0,
     "name": "مريم محمد سالم عفان",
     "num": "L22920",
     "mat": "فقه العبادات1 "
    },
    {
     "dec": "استوفى",
     "moy": 17,
     "note_istidrak": 13,
     "exam": 0,
     "test": 4,
     "name": "الشيخ التجاني أحمد سالم",
     "num": "L22922",
     "mat": "فقه العبادات1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 8,
     "note_istidrak": 8,
     "exam": 6,
     "test": 0,
     "name": "مريم محمد عبد الرحمان آب جدوا",
     "num": "L22962",
     "mat": "فقه العبادات1 "
    },
    {
     "dec": "استوفى",
     "moy": 12,
     "note_istidrak": 9,
     "exam": 6,
     "test": 3,
     "name": "محجوبة أحمدو بمب الصوفي",
     "num": "L23005",
     "mat": "فقه العبادات1 "
    },
    {
     "dec": "استوفى",
     "moy": 12,
     "note_istidrak": 12,
     "exam": 8,
     "test": 0,
     "name": "الداه المان من اﷲ",
     "num": "L23204",
     "mat": "فقه العبادات1 "
    },
    {
     "dec": "استوفى",
     "moy": 12,
     "note_istidrak": 11,
     "exam": 5,
     "test": 1,
     "name": "الشيخ محمد فاضل محمد الناجم",
     "num": "L23356",
     "mat": "فقه العبادات1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 6,
     "note_istidrak": 0,
     "exam": 6,
     "test": 0,
     "name": "إيمان البريني",
     "num": "L23384",
     "mat": "فقه العبادات1 "
    },
    {
     "dec": "استوفى",
     "moy": 13,
     "note_istidrak": 11,
     "exam": 3,
     "test": 2,
     "name": "خدجة احمد افكينيش",
     "num": "L23416",
     "mat": "فقه العبادات1 "
    },
    {
     "dec": "استوفى",
     "moy": 10,
     "note_istidrak": 9,
     "exam": 0,
     "test": 1,
     "name": "فاطمة بابه أحمد الشيخ المصطف",
     "num": "L23430",
     "mat": "فقه العبادات1 "
    },
    {
     "dec": "استوفى",
     "moy": 13,
     "note_istidrak": 10,
     "exam": 0,
     "test": 3,
     "name": "أحمد أحمد باب عمر",
     "num": "L23501",
     "mat": "فقه العبادات1 "
    },
    {
     "dec": "استوفى",
     "moy": 9,
     "note_istidrak": 0,
     "exam": 6,
     "test": 3,
     "name": "اقبال محمد محمود بيلاهي",
     "num": "L23533",
     "mat": "فقه العبادات1 "
    },
    {
     "dec": "استوفى",
     "moy": 11,
     "note_istidrak": 10,
     "exam": 8,
     "test": 1,
     "name": "زبيدة ماء العينين محمد الحسن",
     "num": "L23544",
     "mat": "فقه العبادات1 "
    },
    {
     "dec": "استوفى",
     "moy": 11,
     "note_istidrak": 10,
     "exam": 4,
     "test": 1,
     "name": "محمد مولود محمدوببان",
     "num": "L23600",
     "mat": "فقه العبادات1 "
    },
    {
     "dec": "استوفى",
     "moy": 13,
     "note_istidrak": 8,
     "exam": 0,
     "test": 5,
     "name": "الشفاء محمد امين",
     "num": "L23619",
     "mat": "فقه العبادات1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 6,
     "note_istidrak": 0,
     "exam": 6,
     "test": 0,
     "name": "سيدي محمد الحسن الزافي",
     "num": "L23646",
     "mat": "فقه العبادات1 "
    },
    {
     "dec": "استوفى",
     "moy": 13,
     "note_istidrak": 10,
     "exam": 6,
     "test": 3,
     "name": "خديجة المامون لمرابط",
     "num": "L23665",
     "mat": "فقه العبادات1 "
    },
    {
     "dec": "استوفى",
     "moy": 10,
     "note_istidrak": 7,
     "exam": 4,
     "test": 3,
     "name": "محمد البشير سعد بوه نور الدين",
     "num": "L23673",
     "mat": "فقه العبادات1 "
    },
    {
     "dec": "استوفى",
     "moy": 8,
     "note_istidrak": 7,
     "exam": 3,
     "test": 1,
     "name": "عمران محمد امان",
     "num": "L23694",
     "mat": "فقه العبادات1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 3,
     "note_istidrak": 0,
     "exam": 0,
     "test": 3,
     "name": "سيد محمد الشيخ ادوم امحمد",
     "num": "L23737",
     "mat": "فقه العبادات1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 9,
     "note_istidrak": 0,
     "exam": 6,
     "test": 3,
     "name": "زينب محمد احميده",
     "num": "L23881",
     "mat": "فقه العبادات1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 6,
     "note_istidrak": 0,
     "exam": 6,
     "test": 0,
     "name": "محمدن السالم",
     "num": "L23982",
     "mat": "فقه العبادات1 "
    },
    {
     "dec": "استوفى",
     "moy": 17,
     "note_istidrak": 12,
     "exam": 10,
     "test": 5,
     "name": "محمود باتلي",
     "num": "L24068",
     "mat": "فقه العبادات1 "
    },
    {
     "dec": "استوفى",
     "moy": 14,
     "note_istidrak": 10,
     "exam": 3,
     "test": 4,
     "name": "مريم زيدان موسى",
     "num": "L24096",
     "mat": "فقه العبادات1 "
    },
    {
     "dec": "استوفى",
     "moy": 12,
     "note_istidrak": 12,
     "exam": 6,
     "test": 0,
     "name": "اطيبه محمد امبارك لكوري",
     "num": "L24180",
     "mat": "فقه العبادات1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 9,
     "note_istidrak": 9,
     "exam": 7,
     "test": 0,
     "name": "السالم فال الحسين السملالي",
     "num": "L24185",
     "mat": "فقه العبادات1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 9,
     "note_istidrak": 9,
     "exam": 7,
     "test": 0,
     "name": "ابراهيم اعمر مسعود",
     "num": "L24205",
     "mat": "فقه العبادات1 "
    },
    {
     "dec": "القرار",
     "moy": "المعدل",
     "note_istidrak": "درجة الاستدراك",
     "exam": "درجة الامتحان",
     "test": "درجة الاختبار",
     "name": "الاسم",
     "num": "الرقم",
     "mat": "السيرة النبوية"
    },
    {
     "dec": "لم يستوف",
     "moy": "6.5",
     "note_istidrak": "6.5",
     "exam": 0,
     "test": 0,
     "name": "محمد لمين محفوظ سيد أحمد",
     "num": 5454,
     "mat": "السيرة النبوية"
    },
    {
     "dec": "لم يستوف",
     "moy": 9,
     "note_istidrak": 5,
     "exam": 6,
     "test": 3,
     "name": "عزيزة محمد الأمين اليعقوبي",
     "num": 18249,
     "mat": "السيرة النبوية"
    },
    {
     "dec": "لم يستوف",
     "moy": "8.5",
     "note_istidrak": 0,
     "exam": 6,
     "test": "2.5",
     "name": "امو احمدباباسماعيل",
     "num": 19349,
     "mat": "السيرة النبوية"
    },
    {
     "dec": "استوفى",
     "moy": "9.5",
     "note_istidrak": 8,
     "exam": "9.5",
     "test": 0,
     "name": "عيشة محمد المختار ميلود",
     "num": "L21902",
     "mat": "السيرة النبوية"
    },
    {
     "dec": "لم يستوف",
     "moy": "7.5",
     "note_istidrak": "7.5",
     "exam": 5,
     "test": 0,
     "name": "فاطمة دحود الحمد",
     "num": "L22120",
     "mat": "السيرة النبوية"
    },
    {
     "dec": "استوفى",
     "moy": 11,
     "note_istidrak": 8,
     "exam": 5,
     "test": 3,
     "name": "عبد اﷲ السالم احمدو فال الخيري",
     "num": "L22136",
     "mat": "السيرة النبوية"
    },
    {
     "dec": "استوفى",
     "moy": "11.5",
     "note_istidrak": 9,
     "exam": 6,
     "test": "2.5",
     "name": "فاطمة الخراشي باكي",
     "num": "L22170",
     "mat": "السيرة النبوية"
    },
    {
     "dec": "استوفى",
     "moy": "8.5",
     "note_istidrak": 5,
     "exam": "5.5",
     "test": 3,
     "name": "عبداﷲ مختار السالم المختار السالم",
     "num": "L22213",
     "mat": "السيرة النبوية"
    },
    {
     "dec": "استوفى",
     "moy": 11,
     "note_istidrak": 8,
     "exam": 0,
     "test": 3,
     "name": "زينب محمد حبيب حبيب",
     "num": "L22394",
     "mat": "السيرة النبوية"
    },
    {
     "dec": "استوفى",
     "moy": 15,
     "note_istidrak": "12.5",
     "exam": 5,
     "test": "2.5",
     "name": "سلمان محمدون امبيريك",
     "num": "L22395",
     "mat": "السيرة النبوية"
    },
    {
     "dec": "لم يستوف",
     "moy": "7.5",
     "note_istidrak": 5,
     "exam": 5,
     "test": "2.5",
     "name": "آمنة حمود الكوري",
     "num": "L22676",
     "mat": "السيرة النبوية"
    },
    {
     "dec": "استوفى",
     "moy": 12,
     "note_istidrak": 8,
     "exam": 4,
     "test": 4,
     "name": "محمد نافع ألمان النون",
     "num": "L22723",
     "mat": "السيرة النبوية"
    },
    {
     "dec": "لم يستوف",
     "moy": "8.5",
     "note_istidrak": 0,
     "exam": 6,
     "test": "2.5",
     "name": "محمد عبد اﷲ برهم",
     "num": "L22734",
     "mat": "السيرة النبوية"
    },
    {
     "dec": "استوفى",
     "moy": 12,
     "note_istidrak": 9,
     "exam": 6,
     "test": 3,
     "name": "ميمونه عبد الرحمن عبد القادر",
     "num": "L22735",
     "mat": "السيرة النبوية"
    },
    {
     "dec": "استوفى",
     "moy": 9,
     "note_istidrak": 6,
     "exam": 6,
     "test": 3,
     "name": "الطاهره الهيبه الشيخ محمد فاضل",
     "num": "L22737",
     "mat": "السيرة النبوية"
    },
    {
     "dec": "لم يستوف",
     "moy": "3.5",
     "note_istidrak": 0,
     "exam": 0,
     "test": "3.5",
     "name": "موسى الشيخ سيدي عالي",
     "num": "L22786",
     "mat": "السيرة النبوية"
    },
    {
     "dec": "لم يستوف",
     "moy": 9,
     "note_istidrak": 6,
     "exam": 6,
     "test": 3,
     "name": "فاطمة محمد عيسى بله",
     "num": "L22796",
     "mat": "السيرة النبوية"
    },
    {
     "dec": "استوفى",
     "moy": "10.5",
     "note_istidrak": "7.5",
     "exam": 6,
     "test": 3,
     "name": "عائيش عبد اﷲ ميلود",
     "num": "L22804",
     "mat": "السيرة النبوية"
    },
    {
     "dec": "استوفى",
     "moy": "9.5",
     "note_istidrak": 6,
     "exam": "6.5",
     "test": 3,
     "name": "مامه المخطار لبشاره",
     "num": "L22832",
     "mat": "السيرة النبوية"
    },
    {
     "dec": "استوفى",
     "moy": "11.5",
     "note_istidrak": "8.5",
     "exam": 6,
     "test": 3,
     "name": "زينب محمد اعمر ويس",
     "num": "L22833",
     "mat": "السيرة النبوية"
    },
    {
     "dec": "استوفى",
     "moy": "10.5",
     "note_istidrak": "7.5",
     "exam": 6,
     "test": 3,
     "name": "ابراهيم المين ابراهيمات",
     "num": "L22860",
     "mat": "السيرة النبوية"
    },
    {
     "dec": "استوفى",
     "moy": "9.5",
     "note_istidrak": "7.5",
     "exam": "7.5",
     "test": 2,
     "name": "تمن محمد السالك سيدها",
     "num": "L22868",
     "mat": "السيرة النبوية"
    },
    {
     "dec": "لم يستوف",
     "moy": 9,
     "note_istidrak": 0,
     "exam": 6,
     "test": 3,
     "name": "اسحاق حامد يعقوب",
     "num": "L22875",
     "mat": "السيرة النبوية"
    },
    {
     "dec": "استوفى",
     "moy": 11,
     "note_istidrak": 8,
     "exam": "6.5",
     "test": 3,
     "name": "عيشة ابراهيم امبارك",
     "num": "L22891",
     "mat": "السيرة النبوية"
    },
    {
     "dec": "استوفى",
     "moy": 12,
     "note_istidrak": "8.5",
     "exam": "5.5",
     "test": "3.5",
     "name": "الطيب محمدو أحمد السالم",
     "num": "L22917",
     "mat": "السيرة النبوية"
    },
    {
     "dec": "استوفى",
     "moy": 18,
     "note_istidrak": 13,
     "exam": 0,
     "test": 5,
     "name": "الشيخ التجاني أحمد سالم",
     "num": "L22922",
     "mat": "السيرة النبوية"
    },
    {
     "dec": "استوفى",
     "moy": 12,
     "note_istidrak": 12,
     "exam": 8,
     "test": 0,
     "name": "عيش باب سمي",
     "num": "L22933",
     "mat": "السيرة النبوية"
    },
    {
     "dec": "استوفى",
     "moy": "13.5",
     "note_istidrak": "10.5",
     "exam": "6.5",
     "test": 3,
     "name": "مريم محمد محمود امد لبهم",
     "num": "L22965",
     "mat": "السيرة النبوية"
    },
    {
     "dec": "استوفى",
     "moy": "10.5",
     "note_istidrak": 8,
     "exam": 6,
     "test": "2.5",
     "name": "ام المؤمنين محمدانفع البن",
     "num": "L22980",
     "mat": "السيرة النبوية"
    },
    {
     "dec": "لم يستوف",
     "moy": 9,
     "note_istidrak": "7.5",
     "exam": 9,
     "test": 0,
     "name": "البتول يسلم يمب",
     "num": "L23035",
     "mat": "السيرة النبوية"
    },
    {
     "dec": "استوفى",
     "moy": 11,
     "note_istidrak": 8,
     "exam": "6.5",
     "test": 3,
     "name": "الفن الساة سيد عمار",
     "num": "L23180",
     "mat": "السيرة النبوية"
    },
    {
     "dec": "لم يستوف",
     "moy": "7.5",
     "note_istidrak": "7.5",
     "exam": 5,
     "test": 0,
     "name": "فاطمة سيدي اسند",
     "num": "L23188",
     "mat": "السيرة النبوية"
    },
    {
     "dec": "لم يستوف",
     "moy": "9.5",
     "note_istidrak": "8.5",
     "exam": "9.5",
     "test": 0,
     "name": "الداه المان من اﷲ",
     "num": "L23204",
     "mat": "السيرة النبوية"
    },
    {
     "dec": "لم يستوف",
     "moy": "9.5",
     "note_istidrak": 6,
     "exam": "9.5",
     "test": 0,
     "name": "تل سيدي اسند",
     "num": "L23237",
     "mat": "السيرة النبوية"
    },
    {
     "dec": "لم يستوف",
     "moy": "9.5",
     "note_istidrak": 0,
     "exam": 6,
     "test": "3.5",
     "name": "فاطم امباركه محمد السالك المهدي",
     "num": "L23267",
     "mat": "السيرة النبوية"
    },
    {
     "dec": "استوفى",
     "moy": 12,
     "note_istidrak": 9,
     "exam": 0,
     "test": 3,
     "name": "نانه العالم اعبيدي",
     "num": "L23277",
     "mat": "السيرة النبوية"
    },
    {
     "dec": "استوفى",
     "moy": "12.5",
     "note_istidrak": 9,
     "exam": 6,
     "test": "3.5",
     "name": "الشيخ محمد فاضل محمد الناجم",
     "num": "L23356",
     "mat": "السيرة النبوية"
    },
    {
     "dec": "لم يستوف",
     "moy": 9,
     "note_istidrak": 0,
     "exam": 9,
     "test": 0,
     "name": "المصطفى محمد عبد الرحمن سيدي يحي",
     "num": "L23398",
     "mat": "السيرة النبوية"
    },
    {
     "dec": "استوفى",
     "moy": 9,
     "note_istidrak": "6.5",
     "exam": 6,
     "test": "2.5",
     "name": "أحمد أحمد باب عمر",
     "num": "L23501",
     "mat": "السيرة النبوية"
    },
    {
     "dec": "استوفى",
     "moy": "9.5",
     "note_istidrak": "6.5",
     "exam": 6,
     "test": 3,
     "name": "زبيدة ماء العينين محمد الحسن",
     "num": "L23544",
     "mat": "السيرة النبوية"
    },
    {
     "dec": "لم يستوف",
     "moy": 3,
     "note_istidrak": 0,
     "exam": 0,
     "test": 3,
     "name": "سلمه محمد عبداﷲ محمد الولي",
     "num": "L23601",
     "mat": "السيرة النبوية"
    },
    {
     "dec": "استوفى",
     "moy": 11,
     "note_istidrak": 6,
     "exam": 0,
     "test": 5,
     "name": "الشفاء محمد امين",
     "num": "L23619",
     "mat": "السيرة النبوية"
    },
    {
     "dec": "لم يستوف",
     "moy": "8.5",
     "note_istidrak": 0,
     "exam": "8.5",
     "test": 0,
     "name": "سيدي محمد الحسن الزافي",
     "num": "L23646",
     "mat": "السيرة النبوية"
    },
    {
     "dec": "استوفى",
     "moy": 11,
     "note_istidrak": 8,
     "exam": 6,
     "test": 3,
     "name": "خديجة المامون لمرابط",
     "num": "L23665",
     "mat": "السيرة النبوية"
    },
    {
     "dec": "استوفى",
     "moy": "9.5",
     "note_istidrak": "7.5",
     "exam": "6.5",
     "test": 2,
     "name": "النانة اسلم سيد القاظي",
     "num": "L23669",
     "mat": "السيرة النبوية"
    },
    {
     "dec": "استوفى",
     "moy": "7.5",
     "note_istidrak": "7.5",
     "exam": "7.5",
     "test": 0,
     "name": "محمد البشير سعد بوه نور الدين",
     "num": "L23673",
     "mat": "السيرة النبوية"
    },
    {
     "dec": "لم يستوف",
     "moy": 5,
     "note_istidrak": 0,
     "exam": 5,
     "test": 0,
     "name": "فطمة محمد يسلم عبد اﷲ",
     "num": "L23711",
     "mat": "السيرة النبوية"
    },
    {
     "dec": "لم يستوف",
     "moy": "8.5",
     "note_istidrak": 0,
     "exam": 6,
     "test": "2.5",
     "name": "زينب محمد احميده",
     "num": "L23881",
     "mat": "السيرة النبوية"
    },
    {
     "dec": "لم يستوف",
     "moy": "8.5",
     "note_istidrak": 0,
     "exam": "5.5",
     "test": 3,
     "name": "ورده محمد سالم محمد العباس",
     "num": "L23890",
     "mat": "السيرة النبوية"
    },
    {
     "dec": "استوفى",
     "moy": "9.5",
     "note_istidrak": "7.5",
     "exam": 6,
     "test": 2,
     "name": "محمد مختار بلدي",
     "num": "L23925",
     "mat": "السيرة النبوية"
    },
    {
     "dec": "لم يستوف",
     "moy": 9,
     "note_istidrak": 5,
     "exam": 9,
     "test": 0,
     "name": "محمد عمر محمد اليعقوبي",
     "num": "L23960",
     "mat": "السيرة النبوية"
    },
    {
     "dec": "لم يستوف",
     "moy": 7,
     "note_istidrak": 0,
     "exam": 7,
     "test": 0,
     "name": "فاطمة محمد المختار سيداتي",
     "num": "L23978",
     "mat": "السيرة النبوية"
    },
    {
     "dec": "لم يستوف",
     "moy": "8.5",
     "note_istidrak": 0,
     "exam": "8.5",
     "test": 0,
     "name": "محمدن السالم",
     "num": "L23982",
     "mat": "السيرة النبوية"
    },
    {
     "dec": "استوفى",
     "moy": 12,
     "note_istidrak": 12,
     "exam": 9,
     "test": 0,
     "name": "ابراهيم الطالب دابو",
     "num": "L24033",
     "mat": "السيرة النبوية"
    },
    {
     "dec": "استوفى",
     "moy": "12.5",
     "note_istidrak": "12.5",
     "exam": 9,
     "test": 0,
     "name": "محمود باتلي",
     "num": "L24068",
     "mat": "السيرة النبوية"
    },
    {
     "dec": "استوفى",
     "moy": "8.5",
     "note_istidrak": "8.5",
     "exam": "8.5",
     "test": 0,
     "name": "اطيبه محمد امبارك لكوري",
     "num": "L24180",
     "mat": "السيرة النبوية"
    },
    {
     "dec": "لم يستوف",
     "moy": 9,
     "note_istidrak": 9,
     "exam": 9,
     "test": 0,
     "name": "السالم فال الحسين السملالي",
     "num": "L24185",
     "mat": "السيرة النبوية"
    },
    {
     "dec": "استوفى",
     "moy": "8.5",
     "note_istidrak": "8.5",
     "exam": "7.5",
     "test": 0,
     "name": "دبو محمد المختار الشيخ",
     "num": "L24202",
     "mat": "السيرة النبوية"
    },
    {
     "dec": "لم يستوف",
     "moy": 9,
     "note_istidrak": 0,
     "exam": 9,
     "test": 0,
     "name": "ابراهيم اعمر مسعود",
     "num": "L24205",
     "mat": "السيرة النبوية"
    },
    {
     "dec": "القرار",
     "moy": "المعدل",
     "note_istidrak": "درجة الاستدراك",
     "exam": "درجة الامتحان",
     "test": "درجة الاختبار",
     "name": "الاسم",
     "num": "الرقم",
     "mat": "مدخل لدراسة الإقتصاد الإسلامي1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 7,
     "note_istidrak": 3,
     "exam": 5,
     "test": 2,
     "name": "عزيزة محمد الأمين اليعقوبي",
     "num": 18249,
     "mat": "مدخل لدراسة الإقتصاد الإسلامي1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 8,
     "note_istidrak": 0,
     "exam": 5,
     "test": 3,
     "name": "امو احمدباباسماعيل",
     "num": 19349,
     "mat": "مدخل لدراسة الإقتصاد الإسلامي1 "
    },
    {
     "dec": "استوفى",
     "moy": "15.5",
     "note_istidrak": 13,
     "exam": 6,
     "test": "2.5",
     "name": "عائشه الطالب عبد اﷲ الشيخ أحمد",
     "num": "L22362",
     "mat": "مدخل لدراسة الإقتصاد الإسلامي1 "
    },
    {
     "dec": "استوفى",
     "moy": "10.5",
     "note_istidrak": 8,
     "exam": 6,
     "test": "2.5",
     "name": "نسيبه محمد المختار حمود",
     "num": "L22369",
     "mat": "مدخل لدراسة الإقتصاد الإسلامي1 "
    },
    {
     "dec": "لم يستوف",
     "moy": "9.5",
     "note_istidrak": 2,
     "exam": 6,
     "test": "3.5",
     "name": "زينب محمد حبيب حبيب",
     "num": "L22394",
     "mat": "مدخل لدراسة الإقتصاد الإسلامي1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 8,
     "note_istidrak": 0,
     "exam": 8,
     "test": 0,
     "name": "محمد فاضل ابنو",
     "num": "L22429",
     "mat": "مدخل لدراسة الإقتصاد الإسلامي1 "
    },
    {
     "dec": "لم يستوف",
     "moy": "3.5",
     "note_istidrak": 0,
     "exam": 0,
     "test": "3.5",
     "name": "أحمدو محمد فاضل",
     "num": "L22539",
     "mat": "مدخل لدراسة الإقتصاد الإسلامي1 "
    },
    {
     "dec": "استوفى",
     "moy": 15,
     "note_istidrak": 13,
     "exam": 6,
     "test": 2,
     "name": "سيد أحمد اركيب محمد عال عبد المجيد",
     "num": "L22674",
     "mat": "مدخل لدراسة الإقتصاد الإسلامي1 "
    },
    {
     "dec": "استوفى",
     "moy": 8,
     "note_istidrak": 0,
     "exam": 6,
     "test": 2,
     "name": "محمد محمد عبد اﷲ محمد بوبه",
     "num": "L22715",
     "mat": "مدخل لدراسة الإقتصاد الإسلامي1 "
    },
    {
     "dec": "لم يستوف",
     "moy": "7.5",
     "note_istidrak": 3,
     "exam": 5,
     "test": "2.5",
     "name": "محمدو لمين دودو",
     "num": "L22731",
     "mat": "مدخل لدراسة الإقتصاد الإسلامي1 "
    },
    {
     "dec": "استوفى",
     "moy": 11,
     "note_istidrak": 9,
     "exam": 3,
     "test": 2,
     "name": "محمد عبد اﷲ برهم",
     "num": "L22734",
     "mat": "مدخل لدراسة الإقتصاد الإسلامي1 "
    },
    {
     "dec": "استوفى",
     "moy": "14.5",
     "note_istidrak": 11,
     "exam": 5,
     "test": "3.5",
     "name": "الطاهره الهيبه الشيخ محمد فاضل",
     "num": "L22737",
     "mat": "مدخل لدراسة الإقتصاد الإسلامي1 "
    },
    {
     "dec": "استوفى",
     "moy": 12,
     "note_istidrak": 10,
     "exam": 6,
     "test": 2,
     "name": "لاله محمد الب لكويري",
     "num": "L22808",
     "mat": "مدخل لدراسة الإقتصاد الإسلامي1 "
    },
    {
     "dec": "استوفى",
     "moy": 13,
     "note_istidrak": 10,
     "exam": 6,
     "test": 3,
     "name": "سيد محمد محمد ابراهيم لخليفه",
     "num": "L22809",
     "mat": "مدخل لدراسة الإقتصاد الإسلامي1 "
    },
    {
     "dec": "استوفى",
     "moy": 15,
     "note_istidrak": 13,
     "exam": 5,
     "test": 2,
     "name": "زينب محمد اعمر ويس",
     "num": "L22833",
     "mat": "مدخل لدراسة الإقتصاد الإسلامي1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 5,
     "note_istidrak": 0,
     "exam": 5,
     "test": 0,
     "name": "الزهره محمد الدوه",
     "num": "L22853",
     "mat": "مدخل لدراسة الإقتصاد الإسلامي1 "
    },
    {
     "dec": "استوفى",
     "moy": "11.5",
     "note_istidrak": 10,
     "exam": 6,
     "test": "1.5",
     "name": "ابراهيم المين ابراهيمات",
     "num": "L22860",
     "mat": "مدخل لدراسة الإقتصاد الإسلامي1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 4,
     "note_istidrak": 0,
     "exam": 4,
     "test": 0,
     "name": "محمد يحي بلاهي",
     "num": "L22864",
     "mat": "مدخل لدراسة الإقتصاد الإسلامي1 "
    },
    {
     "dec": "استوفى",
     "moy": 12,
     "note_istidrak": 10,
     "exam": 4,
     "test": 2,
     "name": "محمد محفوظ محمد عبد اﷲ",
     "num": "L22893",
     "mat": "مدخل لدراسة الإقتصاد الإسلامي1 "
    },
    {
     "dec": "استوفى",
     "moy": "9.5",
     "note_istidrak": 0,
     "exam": 6,
     "test": "3.5",
     "name": "أم كلثوم اباخو محمد السالم",
     "num": "L22903",
     "mat": "مدخل لدراسة الإقتصاد الإسلامي1 "
    },
    {
     "dec": "استوفى",
     "moy": 10,
     "note_istidrak": 8,
     "exam": 6,
     "test": 2,
     "name": "عايشه احمدو لمليح",
     "num": "L22907",
     "mat": "مدخل لدراسة الإقتصاد الإسلامي1 "
    },
    {
     "dec": "استوفى",
     "moy": 10,
     "note_istidrak": 10,
     "exam": 7,
     "test": 0,
     "name": "مريم محمد سالم عفان",
     "num": "L22920",
     "mat": "مدخل لدراسة الإقتصاد الإسلامي1 "
    },
    {
     "dec": "استوفى",
     "moy": 15,
     "note_istidrak": 10,
     "exam": 0,
     "test": 5,
     "name": "الشيخ التجاني أحمد سالم",
     "num": "L22922",
     "mat": "مدخل لدراسة الإقتصاد الإسلامي1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 7,
     "note_istidrak": 0,
     "exam": 7,
     "test": 0,
     "name": "عيش باب سمي",
     "num": "L22933",
     "mat": "مدخل لدراسة الإقتصاد الإسلامي1 "
    },
    {
     "dec": "استوفى",
     "moy": 16,
     "note_istidrak": 12,
     "exam": 5,
     "test": 4,
     "name": "محمد مولود محمد انديات",
     "num": "L22972",
     "mat": "مدخل لدراسة الإقتصاد الإسلامي1 "
    },
    {
     "dec": "استوفى",
     "moy": "13.5",
     "note_istidrak": 11,
     "exam": 7,
     "test": "2.5",
     "name": "محجوبة أحمدو بمب الصوفي",
     "num": "L23005",
     "mat": "مدخل لدراسة الإقتصاد الإسلامي1 "
    },
    {
     "dec": "استوفى",
     "moy": 11,
     "note_istidrak": 9,
     "exam": 6,
     "test": 2,
     "name": "البتول يسلم يمب",
     "num": "L23035",
     "mat": "مدخل لدراسة الإقتصاد الإسلامي1 "
    },
    {
     "dec": "استوفى",
     "moy": 12,
     "note_istidrak": 10,
     "exam": 4,
     "test": 2,
     "name": "فاطمة سيدي اسند",
     "num": "L23188",
     "mat": "مدخل لدراسة الإقتصاد الإسلامي1 "
    },
    {
     "dec": "استوفى",
     "moy": 13,
     "note_istidrak": 11,
     "exam": 6,
     "test": 2,
     "name": "تل سيدي اسند",
     "num": "L23237",
     "mat": "مدخل لدراسة الإقتصاد الإسلامي1 "
    },
    {
     "dec": "لم يستوف",
     "moy": "8.5",
     "note_istidrak": 0,
     "exam": 5,
     "test": "3.5",
     "name": "فاطم امباركه محمد السالك المهدي",
     "num": "L23267",
     "mat": "مدخل لدراسة الإقتصاد الإسلامي1 "
    },
    {
     "dec": "استوفى",
     "moy": "13.5",
     "note_istidrak": 10,
     "exam": 0,
     "test": "3.5",
     "name": "أحمد محمدو يسلم سيد سالم",
     "num": "L23447",
     "mat": "مدخل لدراسة الإقتصاد الإسلامي1 "
    },
    {
     "dec": "استوفى",
     "moy": 15,
     "note_istidrak": 11,
     "exam": 4,
     "test": 4,
     "name": "يحي حمود بوسيف",
     "num": "L23460",
     "mat": "مدخل لدراسة الإقتصاد الإسلامي1 "
    },
    {
     "dec": "استوفى",
     "moy": "12.5",
     "note_istidrak": 10,
     "exam": 4,
     "test": "2.5",
     "name": "نفيسه محمد حرمه الأمين",
     "num": "L23492",
     "mat": "مدخل لدراسة الإقتصاد الإسلامي1 "
    },
    {
     "dec": "استوفى",
     "moy": 15,
     "note_istidrak": 10,
     "exam": 0,
     "test": 5,
     "name": "الشفاء محمد امين",
     "num": "L23619",
     "mat": "مدخل لدراسة الإقتصاد الإسلامي1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 8,
     "note_istidrak": 0,
     "exam": 8,
     "test": 0,
     "name": "فاطمةمحمدالأمين فاضل",
     "num": "L23699",
     "mat": "مدخل لدراسة الإقتصاد الإسلامي1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 6,
     "note_istidrak": 0,
     "exam": 4,
     "test": 2,
     "name": "عبد المحسن محمد عبد اﷲ محمد",
     "num": "L23750",
     "mat": "مدخل لدراسة الإقتصاد الإسلامي1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 3,
     "note_istidrak": 0,
     "exam": 3,
     "test": 0,
     "name": "ورده محمد سالم محمد العباس",
     "num": "L23890",
     "mat": "مدخل لدراسة الإقتصاد الإسلامي1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 8,
     "note_istidrak": 6,
     "exam": 3,
     "test": 2,
     "name": "عبد اﷲ سالو سوماري",
     "num": "L23903",
     "mat": "مدخل لدراسة الإقتصاد الإسلامي1 "
    },
    {
     "dec": "استوفى",
     "moy": "13.5",
     "note_istidrak": 10,
     "exam": 6,
     "test": "3.5",
     "name": "محمد علي جالو",
     "num": "L23923",
     "mat": "مدخل لدراسة الإقتصاد الإسلامي1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 8,
     "note_istidrak": 6,
     "exam": 5,
     "test": 2,
     "name": "محمد عمر محمد اليعقوبي",
     "num": "L23960",
     "mat": "مدخل لدراسة الإقتصاد الإسلامي1 "
    },
    {
     "dec": "استوفى",
     "moy": 12,
     "note_istidrak": 10,
     "exam": 7,
     "test": 2,
     "name": "فاطمة محمد المختار سيداتي",
     "num": "L23978",
     "mat": "مدخل لدراسة الإقتصاد الإسلامي1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 6,
     "note_istidrak": 0,
     "exam": 6,
     "test": 0,
     "name": "محمدن السالم",
     "num": "L23982",
     "mat": "مدخل لدراسة الإقتصاد الإسلامي1 "
    },
    {
     "dec": "استوفى",
     "moy": 12,
     "note_istidrak": 12,
     "exam": 7,
     "test": 0,
     "name": "ابراهيم الطالب دابو",
     "num": "L24033",
     "mat": "مدخل لدراسة الإقتصاد الإسلامي1 "
    },
    {
     "dec": "استوفى",
     "moy": 13,
     "note_istidrak": 11,
     "exam": 7,
     "test": 2,
     "name": "محمود باتلي",
     "num": "L24068",
     "mat": "مدخل لدراسة الإقتصاد الإسلامي1 "
    },
    {
     "dec": "استوفى",
     "moy": 10,
     "note_istidrak": 10,
     "exam": 8,
     "test": 0,
     "name": "ابراهيم اعمر مسعود",
     "num": "L24205",
     "mat": "مدخل لدراسة الإقتصاد الإسلامي1 "
    },
    {
     "dec": "القرار",
     "moy": "المعدل",
     "note_istidrak": "درجة الاستدراك",
     "exam": "درجة الامتحان",
     "test": "درجة الاختبار",
     "name": "الاسم",
     "num": "الرقم",
     "mat": "مدخل لدراسة القانون"
    },
    {
     "dec": "استوفى",
     "moy": "8.5",
     "note_istidrak": 6,
     "exam": 2,
     "test": "2.5",
     "name": "فطمة محمد يسلم عبد اﷲ",
     "num": "L23711",
     "mat": "مدخل لدراسة القانون"
    },
    {
     "dec": "لم يستوف",
     "moy": "2.5",
     "note_istidrak": 0,
     "exam": 0,
     "test": "2.5",
     "name": "عبد المحسن محمد عبد اﷲ محمد",
     "num": "L23750",
     "mat": "مدخل لدراسة القانون"
    },
    {
     "dec": "لم يستوف",
     "moy": 3,
     "note_istidrak": 0,
     "exam": 3,
     "test": 0,
     "name": "مريم محمد المختار البوساتي",
     "num": "L23843",
     "mat": "مدخل لدراسة القانون"
    },
    {
     "dec": "لم يستوف",
     "moy": 6,
     "note_istidrak": 0,
     "exam": 6,
     "test": 0,
     "name": "الشيخ محمد المامي",
     "num": "L23858",
     "mat": "مدخل لدراسة القانون"
    },
    {
     "dec": "لم يستوف",
     "moy": "7.5",
     "note_istidrak": 0,
     "exam": "4.5",
     "test": 3,
     "name": "زينب محمد احميده",
     "num": "L23881",
     "mat": "مدخل لدراسة القانون"
    },
    {
     "dec": "لم يستوف",
     "moy": 9,
     "note_istidrak": 0,
     "exam": 6,
     "test": 3,
     "name": "ورده محمد سالم محمد العباس",
     "num": "L23890",
     "mat": "مدخل لدراسة القانون"
    },
    {
     "dec": "لم يستوف",
     "moy": "7.5",
     "note_istidrak": 5,
     "exam": 5,
     "test": "2.5",
     "name": "عبد اﷲ سالو سوماري",
     "num": "L23903",
     "mat": "مدخل لدراسة القانون"
    },
    {
     "dec": "استوفى",
     "moy": "10.5",
     "note_istidrak": 8,
     "exam": "4.5",
     "test": "2.5",
     "name": "محمد علي جالو",
     "num": "L23923",
     "mat": "مدخل لدراسة القانون"
    },
    {
     "dec": "استوفى",
     "moy": 10,
     "note_istidrak": 8,
     "exam": "4.5",
     "test": 2,
     "name": "محمد مختار بلدي",
     "num": "L23925",
     "mat": "مدخل لدراسة القانون"
    },
    {
     "dec": "استوفى",
     "moy": 10,
     "note_istidrak": 8,
     "exam": "5.5",
     "test": 2,
     "name": "محمد عمر محمد اليعقوبي",
     "num": "L23960",
     "mat": "مدخل لدراسة القانون"
    },
    {
     "dec": "لم يستوف",
     "moy": 8,
     "note_istidrak": 6,
     "exam": 6,
     "test": 2,
     "name": "فاطمة محمد المختار سيداتي",
     "num": "L23978",
     "mat": "مدخل لدراسة القانون"
    },
    {
     "dec": "لم يستوف",
     "moy": 7,
     "note_istidrak": 0,
     "exam": 7,
     "test": 0,
     "name": "محمدن السالم",
     "num": "L23982",
     "mat": "مدخل لدراسة القانون"
    },
    {
     "dec": "لم يستوف",
     "moy": 6,
     "note_istidrak": 5,
     "exam": 6,
     "test": 0,
     "name": "ابراهيم الطالب دابو",
     "num": "L24033",
     "mat": "مدخل لدراسة القانون"
    },
    {
     "dec": "لم يستوف",
     "moy": 9,
     "note_istidrak": 7,
     "exam": 3,
     "test": 2,
     "name": "محمود باتلي",
     "num": "L24068",
     "mat": "مدخل لدراسة القانون"
    },
    {
     "dec": "استوفى",
     "moy": 6,
     "note_istidrak": 6,
     "exam": 0,
     "test": 0,
     "name": "اطيبه محمد امبارك لكوري",
     "num": "L24180",
     "mat": "مدخل لدراسة القانون"
    },
    {
     "dec": "لم يستوف",
     "moy": "4.5",
     "note_istidrak": 0,
     "exam": "4.5",
     "test": 0,
     "name": "السالم فال الحسين السملالي",
     "num": "L24185",
     "mat": "مدخل لدراسة القانون"
    },
    {
     "dec": "لم يستوف",
     "moy": 5,
     "note_istidrak": 5,
     "exam": 0,
     "test": 0,
     "name": "ابراهيم اعمر مسعود",
     "num": "L24205",
     "mat": "مدخل لدراسة القانون"
    },
    {
     "dec": "لم يستوف",
     "moy": 4,
     "note_istidrak": 0,
     "exam": 0,
     "test": 4,
     "name": "محمد الامين خطري ابكر",
     "num": "L24241",
     "mat": "مدخل لدراسة القانون"
    },
    {
     "dec": "القرار",
     "moy": "المعدل",
     "note_istidrak": "درجة الاستدراك",
     "exam": "درجة الامتحان",
     "test": "درجة الاختبار",
     "name": "الاسم",
     "num": "الرقم"
    },
    {
     "dec": "استوفى",
     "moy": 10,
     "note_istidrak": 10,
     "exam": 3,
     "test": 0,
     "name": "محمد لمين محفوظ سيد أحمد",
     "num": 5454
    },
    {
     "dec": "لم يستوف",
     "moy": "6.5",
     "note_istidrak": 4,
     "exam": 3,
     "test": "2.5",
     "name": "عزيزة محمد الأمين اليعقوبي",
     "num": 18249
    },
    {
     "dec": "لم يستوف",
     "moy": 2,
     "note_istidrak": 0,
     "exam": 2,
     "test": 0,
     "name": "امو احمدباباسماعيل",
     "num": 19349
    },
    {
     "dec": "استوفى",
     "moy": 6,
     "note_istidrak": 6,
     "exam": 3,
     "test": 0,
     "name": "الشيخ الولي محمد عبد الرحمن",
     "num": 19678
    },
    {
     "dec": "استوفى",
     "moy": 5,
     "note_istidrak": 5,
     "exam": 4,
     "test": 0,
     "name": "ميمونه محمذن حمدي",
     "num": "L21278"
    },
    {
     "dec": "استوفى",
     "moy": 8,
     "note_istidrak": 8,
     "exam": 2,
     "test": 0,
     "name": "ميمونه محمذن حمدي",
     "num": "L21278"
    },
    {
     "dec": "استوفى",
     "moy": 8,
     "note_istidrak": 4,
     "exam": "1.5",
     "test": 4,
     "name": "محمد يحي محمد الأمجد أمباب",
     "num": "L21729"
    },
    {
     "dec": "لم يستوف",
     "moy": 0,
     "note_istidrak": 0,
     "exam": 0,
     "test": 0,
     "name": "نبقوه سيدي محمد محمد صالح",
     "num": "L21832"
    },
    {
     "dec": "لم يستوف",
     "moy": 4,
     "note_istidrak": 4,
     "exam": 3,
     "test": 0,
     "name": "محمد ابراهيم محمد الصغير",
     "num": "L21897"
    },
    {
     "dec": "استوفى",
     "moy": 10,
     "note_istidrak": 10,
     "exam": "7.5",
     "test": 0,
     "name": "عيشة محمد المختار ميلود",
     "num": "L21902"
    },
    {
     "dec": "لم يستوف",
     "moy": 0,
     "note_istidrak": 0,
     "exam": 0,
     "test": 0,
     "name": "احبيبه محمدن الطالب",
     "num": "L21905"
    },
    {
     "dec": "لم يستوف",
     "moy": 0,
     "note_istidrak": 0,
     "exam": 0,
     "test": 0,
     "name": "محمد محفوظ محمد حبيب اﷲ مسكه",
     "num": "L21908"
    },
    {
     "dec": "لم يستوف",
     "moy": "3.5",
     "note_istidrak": 0,
     "exam": 0,
     "test": "3.5",
     "name": "محمد محفوظ محمد عبد اﷲ كبود",
     "num": "L21960"
    },
    {
     "dec": "لم يستوف",
     "moy": 5,
     "note_istidrak": 5,
     "exam": 4,
     "test": 0,
     "name": "فاطمة دحود الحمد",
     "num": "L22120"
    },
    {
     "dec": "استوفى",
     "moy": 10,
     "note_istidrak": "7.5",
     "exam": 4,
     "test": "2.5",
     "name": "عبد اﷲ السالم احمدو فال الخيري",
     "num": "L22136"
    },
    {
     "dec": "لم يستوف",
     "moy": 9,
     "note_istidrak": 4,
     "exam": 6,
     "test": 3,
     "name": "محمد ناجي السيد ابنو",
     "num": "L22340"
    },
    {
     "dec": "لم يستوف",
     "moy": 4,
     "note_istidrak": 3,
     "exam": 4,
     "test": 0,
     "name": "زينب محمد المختار بيبات",
     "num": "L22361"
    },
    {
     "dec": "استوفى",
     "moy": "6.5",
     "note_istidrak": 3,
     "exam": 3,
     "test": "3.5",
     "name": "عائشه الطالب عبد اﷲ الشيخ أحمد",
     "num": "L22362"
    },
    {
     "dec": "استوفى",
     "moy": "7.5",
     "note_istidrak": 4,
     "exam": 5,
     "test": "2.5",
     "name": "نسيبه محمد المختار حمود",
     "num": "L22369"
    },
    {
     "dec": "لم يستوف",
     "moy": "7.5",
     "note_istidrak": 3,
     "exam": 5,
     "test": "2.5",
     "name": "زينب محمد حبيب حبيب",
     "num": "L22394"
    },
    {
     "dec": "استوفى",
     "moy": 12,
     "note_istidrak": 11,
     "exam": 6,
     "test": 1,
     "name": "سلمان محمدون امبيريك",
     "num": "L22395"
    },
    {
     "dec": "استوفى",
     "moy": 13,
     "note_istidrak": 10,
     "exam": 4,
     "test": 3,
     "name": "آمنة باباه باباه",
     "num": "L22634"
    },
    {
     "dec": "استوفى",
     "moy": "8.5",
     "note_istidrak": 5,
     "exam": 6,
     "test": "2.5",
     "name": "المختار السالم احمدو اصلاي",
     "num": "L22635"
    },
    {
     "dec": "استوفى",
     "moy": 12,
     "note_istidrak": 9,
     "exam": 6,
     "test": 3,
     "name": "الصديق سناد محمود الحاج",
     "num": "L22667"
    },
    {
     "dec": "استوفى",
     "moy": "13.5",
     "note_istidrak": 12,
     "exam": 4,
     "test": "1.5",
     "name": "آمنة حمود الكوري",
     "num": "L22676"
    },
    {
     "dec": "لم يستوف",
     "moy": 4,
     "note_istidrak": 4,
     "exam": 4,
     "test": 0,
     "name": "أحمد باباه سيدي",
     "num": "L22679"
    },
    {
     "dec": "استوفى",
     "moy": "12.5",
     "note_istidrak": 10,
     "exam": 4,
     "test": "2.5",
     "name": "الشيخ جعفر احمد صافي",
     "num": "L22693"
    },
    {
     "dec": "استوفى",
     "moy": "14.5",
     "note_istidrak": 12,
     "exam": 4,
     "test": "2.5",
     "name": "خدجة محمد المختار محمد",
     "num": "L22697"
    },
    {
     "dec": "استوفى",
     "moy": 10,
     "note_istidrak": "7.5",
     "exam": 4,
     "test": "2.5",
     "name": "محمد محمد عبد اﷲ محمد بوبه",
     "num": "L22715"
    },
    {
     "dec": "استوفى",
     "moy": "8.5",
     "note_istidrak": 6,
     "exam": 4,
     "test": "2.5",
     "name": "سيد محمد أواه آج",
     "num": "L22719"
    },
    {
     "dec": "استوفى",
     "moy": 8,
     "note_istidrak": 4,
     "exam": 6,
     "test": 2,
     "name": "عيشه المصطفى تراورى",
     "num": "L22730"
    },
    {
     "dec": "لم يستوف",
     "moy": 9,
     "note_istidrak": 0,
     "exam": "7.5",
     "test": "1.5",
     "name": "محمد عبد اﷲ برهم",
     "num": "L22734"
    },
    {
     "dec": "استوفى",
     "moy": "13.5",
     "note_istidrak": 11,
     "exam": 6,
     "test": "2.5",
     "name": "ميمونه عبد الرحمن عبد القادر",
     "num": "L22735"
    },
    {
     "dec": "استوفى",
     "moy": "6.5",
     "note_istidrak": 3,
     "exam": 4,
     "test": "2.5",
     "name": "الطاهره الهيبه الشيخ محمد فاضل",
     "num": "L22737"
    },
    {
     "dec": "استوفى",
     "moy": "8.5",
     "note_istidrak": 6,
     "exam": 5,
     "test": "2.5",
     "name": "بابي محمد محمود سيد لمين المحمود",
     "num": "L22738"
    },
    {
     "dec": "استوفى",
     "moy": "10.5",
     "note_istidrak": 8,
     "exam": 5,
     "test": "2.5",
     "name": "عيشة سيد عبد اﷲ اعليات",
     "num": "L22753"
    },
    {
     "dec": "استوفى",
     "moy": "12.5",
     "note_istidrak": 10,
     "exam": 4,
     "test": "2.5",
     "name": "حورية بوناه بوميه",
     "num": "L22759"
    },
    {
     "dec": "لم يستوف",
     "moy": "7.5",
     "note_istidrak": 4,
     "exam": 5,
     "test": "2.5",
     "name": "أحمد نوح سيدي سيدي",
     "num": "L22781"
    },
    {
     "dec": "استوفى",
     "moy": "7.5",
     "note_istidrak": 5,
     "exam": 5,
     "test": "2.5",
     "name": "فاطمة محمد عيسى بله",
     "num": "L22796"
    },
    {
     "dec": "استوفى",
     "moy": "7.5",
     "note_istidrak": 0,
     "exam": 5,
     "test": "2.5",
     "name": "لاله محمد الب لكويري",
     "num": "L22808"
    },
    {
     "dec": "استوفى",
     "moy": 10,
     "note_istidrak": "7.5",
     "exam": 4,
     "test": "2.5",
     "name": "سيد محمد محمد ابراهيم لخليفه",
     "num": "L22809"
    },
    {
     "dec": "استوفى",
     "moy": 9,
     "note_istidrak": "6.5",
     "exam": 5,
     "test": "2.5",
     "name": "انوه ينج الشيخ عبد اﷲ",
     "num": "L22810"
    },
    {
     "dec": "استوفى",
     "moy": "10.5",
     "note_istidrak": "7.5",
     "exam": 4,
     "test": 3,
     "name": "مامه المخطار لبشاره",
     "num": "L22832"
    },
    {
     "dec": "استوفى",
     "moy": 8,
     "note_istidrak": "6.5",
     "exam": 4,
     "test": "1.5",
     "name": "زينب محمد اعمر ويس",
     "num": "L22833"
    },
    {
     "dec": "استوفى",
     "moy": 10,
     "note_istidrak": "6.5",
     "exam": 4,
     "test": "3.5",
     "name": "محمد عبد اﷲ اسلم",
     "num": "L22839"
    },
    {
     "dec": "لم يستوف",
     "moy": 5,
     "note_istidrak": 0,
     "exam": 3,
     "test": 2,
     "name": "الزهره محمد الدوه",
     "num": "L22853"
    },
    {
     "dec": "لم يستوف",
     "moy": "7.5",
     "note_istidrak": 0,
     "exam": "7.5",
     "test": 0,
     "name": "ابراهيم المين ابراهيمات",
     "num": "L22860"
    },
    {
     "dec": "استوفى",
     "moy": "7.5",
     "note_istidrak": 5,
     "exam": 4,
     "test": "2.5",
     "name": "تمن محمد السالك سيدها",
     "num": "L22868"
    },
    {
     "dec": "استوفى",
     "moy": "14.5",
     "note_istidrak": 12,
     "exam": 6,
     "test": "2.5",
     "name": "لميمه محفوظ بونعامه",
     "num": "L22882"
    },
    {
     "dec": "لم يستوف",
     "moy": 9,
     "note_istidrak": 5,
     "exam": "6.5",
     "test": "2.5",
     "name": "عبد اﷲ شيخو سيسى",
     "num": "L22889"
    },
    {
     "dec": "استوفى",
     "moy": "14.5",
     "note_istidrak": 12,
     "exam": 3,
     "test": "2.5",
     "name": "عيشة ابراهيم امبارك",
     "num": "L22891"
    },
    {
     "dec": "لم يستوف",
     "moy": "5.5",
     "note_istidrak": 0,
     "exam": 3,
     "test": "2.5",
     "name": "سيدي محمد المولود أنجاي",
     "num": "L22898"
    },
    {
     "dec": "استوفى",
     "moy": 15,
     "note_istidrak": 13,
     "exam": 5,
     "test": 2,
     "name": "أم كلثوم اباخو محمد السالم",
     "num": "L22903"
    },
    {
     "dec": "لم يستوف",
     "moy": "6.5",
     "note_istidrak": 0,
     "exam": 4,
     "test": "2.5",
     "name": "عايشه احمدو لمليح",
     "num": "L22907"
    },
    {
     "dec": "استوفى",
     "moy": "8.5",
     "note_istidrak": 6,
     "exam": 5,
     "test": "2.5",
     "name": "الطيب محمدو أحمد السالم",
     "num": "L22917"
    },
    {
     "dec": "لم يستوف",
     "moy": 5,
     "note_istidrak": 5,
     "exam": 5,
     "test": 0,
     "name": "مريم محمد سالم عفان",
     "num": "L22920"
    },
    {
     "dec": "استوفى",
     "moy": 14,
     "note_istidrak": 9,
     "exam": 0,
     "test": 5,
     "name": "الشيخ التجاني أحمد سالم",
     "num": "L22922"
    },
    {
     "dec": "استوفى",
     "moy": 10,
     "note_istidrak": 10,
     "exam": 5,
     "test": 0,
     "name": "عيش باب سمي",
     "num": "L22933"
    },
    {
     "dec": "لم يستوف",
     "moy": "7.5",
     "note_istidrak": 4,
     "exam": 6,
     "test": "1.5",
     "name": "مريم محمد عبد الرحمان آب جدوا",
     "num": "L22962"
    },
    {
     "dec": "استوفى",
     "moy": "6.5",
     "note_istidrak": 0,
     "exam": 5,
     "test": "1.5",
     "name": "محمد مولود محمد انديات",
     "num": "L22972"
    },
    {
     "dec": "استوفى",
     "moy": "7.5",
     "note_istidrak": 5,
     "exam": 4,
     "test": "2.5",
     "name": "ام المؤمنين محمدانفع البن",
     "num": "L22980"
    },
    {
     "dec": "استوفى",
     "moy": 12,
     "note_istidrak": 9,
     "exam": 5,
     "test": 3,
     "name": "الزينة ادبيه منى",
     "num": "L22989"
    },
    {
     "dec": "استوفى",
     "moy": "8.5",
     "note_istidrak": 6,
     "exam": 5,
     "test": "2.5",
     "name": "محجوبة أحمدو بمب الصوفي",
     "num": "L23005"
    },
    {
     "dec": "لم يستوف",
     "moy": "7.5",
     "note_istidrak": 5,
     "exam": "7.5",
     "test": 0,
     "name": "البتول يسلم يمب",
     "num": "L23035"
    },
    {
     "dec": "لم يستوف",
     "moy": 4,
     "note_istidrak": 4,
     "exam": 4,
     "test": 0,
     "name": "فاطمة محمد بيين",
     "num": "L23125"
    },
    {
     "dec": "استوفى",
     "moy": "7.5",
     "note_istidrak": 5,
     "exam": 5,
     "test": "2.5",
     "name": "عيشة عبد القادر أحمد موجي",
     "num": "L23166"
    },
    {
     "dec": "استوفى",
     "moy": "8.5",
     "note_istidrak": 6,
     "exam": 6,
     "test": "2.5",
     "name": "سيدي احمد محمد ممان",
     "num": "L23173"
    },
    {
     "dec": "القرار",
     "moy": "المعدل",
     "note_istidrak": "درجة الاستدراك",
     "exam": "درجة الامتحان",
     "test": "درجة الاختبار",
     "name": "الاسم",
     "num": "الرقم",
     "mat": "النحو و الصرف1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 6,
     "note_istidrak": 6,
     "exam": 4,
     "test": 0,
     "name": "فاطمة سيدي اسند",
     "num": "L23188",
     "mat": "النحو و الصرف1 "
    },
    {
     "dec": "استوفى",
     "moy": "6.5",
     "note_istidrak": 0,
     "exam": 4,
     "test": "2.5",
     "name": "خدجة زيدان العربي",
     "num": "L23195",
     "mat": "النحو و الصرف1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 5,
     "note_istidrak": 0,
     "exam": 5,
     "test": 0,
     "name": "الداه المان من اﷲ",
     "num": "L23204",
     "mat": "النحو و الصرف1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 5,
     "note_istidrak": 3,
     "exam": 5,
     "test": 0,
     "name": "تل سيدي اسند",
     "num": "L23237",
     "mat": "النحو و الصرف1 "
    },
    {
     "dec": "لم يستوف",
     "moy": "6.5",
     "note_istidrak": 0,
     "exam": 4,
     "test": "2.5",
     "name": "فاطم امباركه محمد السالك المهدي",
     "num": "L23267",
     "mat": "النحو و الصرف1 "
    },
    {
     "dec": "استوفى",
     "moy": "10.5",
     "note_istidrak": 8,
     "exam": 0,
     "test": "2.5",
     "name": "نانه العالم اعبيدي",
     "num": "L23277",
     "mat": "النحو و الصرف1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 6,
     "note_istidrak": 0,
     "exam": 6,
     "test": 0,
     "name": "ياسين بنعمار",
     "num": "L23374",
     "mat": "النحو و الصرف1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 5,
     "note_istidrak": 0,
     "exam": 5,
     "test": 0,
     "name": "إيمان البريني",
     "num": "L23384",
     "mat": "النحو و الصرف1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 4,
     "note_istidrak": 4,
     "exam": 3,
     "test": 0,
     "name": "مريم عبد اﷲ",
     "num": "L23396",
     "mat": "النحو و الصرف1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 4,
     "note_istidrak": 0,
     "exam": 4,
     "test": 0,
     "name": "المصطفى محمد عبد الرحمن سيدي يحي",
     "num": "L23398",
     "mat": "النحو و الصرف1 "
    },
    {
     "dec": "استوفى",
     "moy": "6.5",
     "note_istidrak": 4,
     "exam": 4,
     "test": "2.5",
     "name": "فاطمة بابه أحمد الشيخ المصطف",
     "num": "L23430",
     "mat": "النحو و الصرف1 "
    },
    {
     "dec": "لم يستوف",
     "moy": "8.5",
     "note_istidrak": 6,
     "exam": 5,
     "test": "2.5",
     "name": "نفيسه محمد حرمه الأمين",
     "num": "L23492",
     "mat": "النحو و الصرف1 "
    },
    {
     "dec": "استوفى",
     "moy": 10,
     "note_istidrak": "7.5",
     "exam": 5,
     "test": "2.5",
     "name": "مريم محمد العتيق محمد المختار",
     "num": "L23498",
     "mat": "النحو و الصرف1 "
    },
    {
     "dec": "استوفى",
     "moy": "7.5",
     "note_istidrak": 5,
     "exam": 0,
     "test": "2.5",
     "name": "أحمد أحمد باب عمر",
     "num": "L23501",
     "mat": "النحو و الصرف1 "
    },
    {
     "dec": "استوفى",
     "moy": "11.5",
     "note_istidrak": 9,
     "exam": 3,
     "test": "2.5",
     "name": "اقبال محمد محمود بيلاهي",
     "num": "L23533",
     "mat": "النحو و الصرف1 "
    },
    {
     "dec": "استوفى",
     "moy": "11.5",
     "note_istidrak": 9,
     "exam": 5,
     "test": "2.5",
     "name": "امباركه اسغير سالم",
     "num": "L23550",
     "mat": "النحو و الصرف1 "
    },
    {
     "dec": "استوفى",
     "moy": "14.5",
     "note_istidrak": 12,
     "exam": 5,
     "test": "2.5",
     "name": "محمد مولود محمدوببان",
     "num": "L23600",
     "mat": "النحو و الصرف1 "
    },
    {
     "dec": "لم يستوف",
     "moy": "6.5",
     "note_istidrak": 3,
     "exam": 5,
     "test": "1.5",
     "name": "محمد سالم محمد ابريك",
     "num": "L23610",
     "mat": "النحو و الصرف1 "
    },
    {
     "dec": "استوفى",
     "moy": 15,
     "note_istidrak": 10,
     "exam": 0,
     "test": 5,
     "name": "الشفاء محمد امين",
     "num": "L23619",
     "mat": "النحو و الصرف1 "
    },
    {
     "dec": "استوفى",
     "moy": "6.5",
     "note_istidrak": 4,
     "exam": 4,
     "test": "2.5",
     "name": "عزه لمام محمد المختار",
     "num": "L23621",
     "mat": "النحو و الصرف1 "
    },
    {
     "dec": "لم يستوف",
     "moy": "7.5",
     "note_istidrak": 0,
     "exam": 6,
     "test": "1.5",
     "name": "سيدي محمد الحسن الزافي",
     "num": "L23646",
     "mat": "النحو و الصرف1 "
    },
    {
     "dec": "استوفى",
     "moy": "8.5",
     "note_istidrak": 4,
     "exam": 6,
     "test": "2.5",
     "name": "النانة اسلم سيد القاظي",
     "num": "L23669",
     "mat": "النحو و الصرف1 "
    },
    {
     "dec": "استوفى",
     "moy": "17.5",
     "note_istidrak": 15,
     "exam": 4,
     "test": "2.5",
     "name": "محمد البشير سعد بوه نور الدين",
     "num": "L23673",
     "mat": "النحو و الصرف1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 3,
     "note_istidrak": 0,
     "exam": 3,
     "test": 0,
     "name": "فاطمةمحمدالأمين فاضل",
     "num": "L23699",
     "mat": "النحو و الصرف1 "
    },
    {
     "dec": "لم يستوف",
     "moy": "7.5",
     "note_istidrak": "7.5",
     "exam": "7.5",
     "test": 0,
     "name": "فطمة محمد يسلم عبد اﷲ",
     "num": "L23711",
     "mat": "النحو و الصرف1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 8,
     "note_istidrak": 0,
     "exam": "6.5",
     "test": "1.5",
     "name": "مريم محمد المختار البوساتي",
     "num": "L23843",
     "mat": "النحو و الصرف1 "
    },
    {
     "dec": "استوفى",
     "moy": 10,
     "note_istidrak": "7.5",
     "exam": 5,
     "test": "2.5",
     "name": "اخت البنين محمد الامين محمد سيدي",
     "num": "L23850",
     "mat": "النحو و الصرف1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 7,
     "note_istidrak": 0,
     "exam": 7,
     "test": 0,
     "name": "الشيخ محمد المامي",
     "num": "L23858",
     "mat": "النحو و الصرف1 "
    },
    {
     "dec": "لم يستوف",
     "moy": "8.5",
     "note_istidrak": 0,
     "exam": 6,
     "test": "2.5",
     "name": "زينب محمد احميده",
     "num": "L23881",
     "mat": "النحو و الصرف1 "
    },
    {
     "dec": "استوفى",
     "moy": "10.5",
     "note_istidrak": 8,
     "exam": 6,
     "test": "2.5",
     "name": "الماميه احمد عمار",
     "num": "L23889",
     "mat": "النحو و الصرف1 "
    },
    {
     "dec": "استوفى",
     "moy": 10,
     "note_istidrak": 8,
     "exam": "7.5",
     "test": 2,
     "name": "عبد اﷲ سالو سوماري",
     "num": "L23903",
     "mat": "النحو و الصرف1 "
    },
    {
     "dec": "استوفى",
     "moy": 10,
     "note_istidrak": "7.5",
     "exam": 4,
     "test": "2.5",
     "name": "محمد مختار بلدي",
     "num": "L23925",
     "mat": "النحو و الصرف1 "
    },
    {
     "dec": "لم يستوف",
     "moy": "8.5",
     "note_istidrak": 6,
     "exam": 4,
     "test": "2.5",
     "name": "محمد عمر محمد اليعقوبي",
     "num": "L23960",
     "mat": "النحو و الصرف1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 4,
     "note_istidrak": 4,
     "exam": 4,
     "test": 0,
     "name": "فاطمة محمد المختار سيداتي",
     "num": "L23978",
     "mat": "النحو و الصرف1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 4,
     "note_istidrak": 4,
     "exam": 4,
     "test": 0,
     "name": "ابراهيم الطالب دابو",
     "num": "L24033",
     "mat": "النحو و الصرف1 "
    },
    {
     "dec": "لم يستوف",
     "moy": "7.5",
     "note_istidrak": "7.5",
     "exam": 6,
     "test": 0,
     "name": "محمود باتلي",
     "num": "L24068",
     "mat": "النحو و الصرف1 "
    },
    {
     "dec": "استوفى",
     "moy": "7.5",
     "note_istidrak": 6,
     "exam": 5,
     "test": "1.5",
     "name": "مريم زيدان موسى",
     "num": "L24096",
     "mat": "النحو و الصرف1 "
    },
    {
     "dec": "استوفى",
     "moy": "7.5",
     "note_istidrak": 6,
     "exam": "7.5",
     "test": 0,
     "name": "اطيبه محمد امبارك لكوري",
     "num": "L24180",
     "mat": "النحو و الصرف1 "
    },
    {
     "dec": "استوفى",
     "moy": 10,
     "note_istidrak": 10,
     "exam": 6,
     "test": 0,
     "name": "السالم فال الحسين السملالي",
     "num": "L24185",
     "mat": "النحو و الصرف1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 4,
     "note_istidrak": 0,
     "exam": 4,
     "test": 0,
     "name": "محجوبة محمدعبداﷲ الطالب ولد سيد",
     "num": "L24201",
     "mat": "النحو و الصرف1 "
    },
    {
     "dec": "استوفى",
     "moy": 11,
     "note_istidrak": 11,
     "exam": 5,
     "test": 0,
     "name": "دبو محمد المختار الشيخ",
     "num": "L24202",
     "mat": "النحو و الصرف1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 4,
     "note_istidrak": 4,
     "exam": 4,
     "test": 0,
     "name": "ابراهيم اعمر مسعود",
     "num": "L24205",
     "mat": "النحو و الصرف1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 6,
     "note_istidrak": 0,
     "exam": 6,
     "test": 0,
     "name": "محمد الامين خطري ابكر",
     "num": "L24241",
     "mat": "النحو و الصرف1 "
    },
    {
     "dec": "القرار",
     "moy": "المعدل",
     "note_istidrak": "درجة الاستدراك",
     "exam": "درجة الامتحان",
     "test": "درجة الاختبار",
     "name": "الاسم",
     "num": "الرقم",
     "mat": "اللغة الفرنسية"
    },
    {
     "dec": "لم يستوف",
     "moy": 0,
     "note_istidrak": 0,
     "exam": 0,
     "test": 0,
     "name": "عمر باه",
     "num": "L21692",
     "mat": "اللغة الفرنسية"
    },
    {
     "dec": "استوفى",
     "moy": 15,
     "note_istidrak": 13,
     "exam": "7.5",
     "test": 2,
     "name": "محمد هومن احمد سالم حمزة",
     "num": "L21771",
     "mat": "اللغة الفرنسية"
    },
    {
     "dec": "لم يستوف",
     "moy": "9.5",
     "note_istidrak": 7,
     "exam": "7.5",
     "test": 2,
     "name": "محمد ابراهيم محمد الصغير",
     "num": "L21897",
     "mat": "اللغة الفرنسية"
    },
    {
     "dec": "استوفى",
     "moy": "9.5",
     "note_istidrak": "7.5",
     "exam": 0,
     "test": 2,
     "name": "محجوبة زين العابدين أحمد زروق",
     "num": "L22060",
     "mat": "اللغة الفرنسية"
    },
    {
     "dec": "لم يستوف",
     "moy": 8,
     "note_istidrak": "7.5",
     "exam": 8,
     "test": 0,
     "name": "زينب محمد حبيب حبيب",
     "num": "L22394",
     "mat": "اللغة الفرنسية"
    },
    {
     "dec": "استوفى",
     "moy": "9.5",
     "note_istidrak": 7,
     "exam": "7.5",
     "test": 2,
     "name": "اسماعيل محمد محمود بوبه",
     "num": "L22438",
     "mat": "اللغة الفرنسية"
    },
    {
     "dec": "لم يستوف",
     "moy": 7,
     "note_istidrak": 7,
     "exam": 7,
     "test": 0,
     "name": "أحمد باباه سيدي",
     "num": "L22679",
     "mat": "اللغة الفرنسية"
    },
    {
     "dec": "استوفى",
     "moy": "9.5",
     "note_istidrak": 7,
     "exam": 7,
     "test": "2.5",
     "name": "خدجة محمد المختار محمد",
     "num": "L22697",
     "mat": "اللغة الفرنسية"
    },
    {
     "dec": "لم يستوف",
     "moy": 9,
     "note_istidrak": 7,
     "exam": 7,
     "test": 2,
     "name": "أحمد نوح سيدي سيدي",
     "num": "L22781",
     "mat": "اللغة الفرنسية"
    },
    {
     "dec": "استوفى",
     "moy": "9.5",
     "note_istidrak": 7,
     "exam": "7.5",
     "test": 2,
     "name": "محمد عبد اﷲ اسلم",
     "num": "L22839",
     "mat": "اللغة الفرنسية"
    },
    {
     "dec": "استوفى",
     "moy": "9.5",
     "note_istidrak": "7.5",
     "exam": "7.5",
     "test": 2,
     "name": "تمن محمد السالك سيدها",
     "num": "L22868",
     "mat": "اللغة الفرنسية"
    },
    {
     "dec": "لم يستوف",
     "moy": 9,
     "note_istidrak": 0,
     "exam": 7,
     "test": 2,
     "name": "عبد اﷲ شيخو سيسى",
     "num": "L22889",
     "mat": "اللغة الفرنسية"
    },
    {
     "dec": "استوفى",
     "moy": "9.5",
     "note_istidrak": 7,
     "exam": "7.5",
     "test": 2,
     "name": "الطيب محمدو أحمد السالم",
     "num": "L22917",
     "mat": "اللغة الفرنسية"
    },
    {
     "dec": "استوفى",
     "moy": 15,
     "note_istidrak": 10,
     "exam": 0,
     "test": 5,
     "name": "الشيخ التجاني أحمد سالم",
     "num": "L22922",
     "mat": "اللغة الفرنسية"
    },
    {
     "dec": "لم يستوف",
     "moy": 8,
     "note_istidrak": 7,
     "exam": 8,
     "test": 0,
     "name": "عيش باب سمي",
     "num": "L22933",
     "mat": "اللغة الفرنسية"
    },
    {
     "dec": "لم يستوف",
     "moy": "8.5",
     "note_istidrak": 7,
     "exam": "8.5",
     "test": 0,
     "name": "البتول يسلم يمب",
     "num": "L23035",
     "mat": "اللغة الفرنسية"
    },
    {
     "dec": "استوفى",
     "moy": 10,
     "note_istidrak": 10,
     "exam": 9,
     "test": 0,
     "name": "فاطمة سيدي اسند",
     "num": "L23188",
     "mat": "اللغة الفرنسية"
    },
    {
     "dec": "استوفى",
     "moy": "9.5",
     "note_istidrak": 0,
     "exam": "7.5",
     "test": 2,
     "name": "خدجة زيدان العربي",
     "num": "L23195",
     "mat": "اللغة الفرنسية"
    },
    {
     "dec": "لم يستوف",
     "moy": "7.5",
     "note_istidrak": 7,
     "exam": "7.5",
     "test": 0,
     "name": "الداه المان من اﷲ",
     "num": "L23204",
     "mat": "اللغة الفرنسية"
    },
    {
     "dec": "لم يستوف",
     "moy": "8.5",
     "note_istidrak": "7.5",
     "exam": "8.5",
     "test": 0,
     "name": "تل سيدي اسند",
     "num": "L23237",
     "mat": "اللغة الفرنسية"
    },
    {
     "dec": "استوفى",
     "moy": 9,
     "note_istidrak": 7,
     "exam": 7,
     "test": 2,
     "name": "مريم محمد العتيق محمد المختار",
     "num": "L23498",
     "mat": "اللغة الفرنسية"
    },
    {
     "dec": "استوفى",
     "moy": 15,
     "note_istidrak": 10,
     "exam": 0,
     "test": 5,
     "name": "الشفاء محمد امين",
     "num": "L23619",
     "mat": "اللغة الفرنسية"
    },
    {
     "dec": "لم يستوف",
     "moy": "2.5",
     "note_istidrak": 0,
     "exam": 0,
     "test": "2.5",
     "name": "مريم محمد المختار البوساتي",
     "num": "L23843",
     "mat": "اللغة الفرنسية"
    },
    {
     "dec": "لم يستوف",
     "moy": "9.5",
     "note_istidrak": 0,
     "exam": "7.5",
     "test": 2,
     "name": "زينب محمد احميده",
     "num": "L23881",
     "mat": "اللغة الفرنسية"
    },
    {
     "dec": "لم يستوف",
     "moy": 9,
     "note_istidrak": 7,
     "exam": 7,
     "test": 2,
     "name": "عبد اﷲ سالو سوماري",
     "num": "L23903",
     "mat": "اللغة الفرنسية"
    },
    {
     "dec": "لم يستوف",
     "moy": "7.5",
     "note_istidrak": 7,
     "exam": "7.5",
     "test": 0,
     "name": "محمد عمر محمد اليعقوبي",
     "num": "L23960",
     "mat": "اللغة الفرنسية"
    },
    {
     "dec": "لم يستوف",
     "moy": 7,
     "note_istidrak": 0,
     "exam": 7,
     "test": 0,
     "name": "فاطمة محمد المختار سيداتي",
     "num": "L23978",
     "mat": "اللغة الفرنسية"
    },
    {
     "dec": "لم يستوف",
     "moy": 8,
     "note_istidrak": 0,
     "exam": 8,
     "test": 0,
     "name": "محمدن السالم",
     "num": "L23982",
     "mat": "اللغة الفرنسية"
    },
    {
     "dec": "لم يستوف",
     "moy": "7.5",
     "note_istidrak": 7,
     "exam": "7.5",
     "test": 0,
     "name": "السالم فال الحسين السملالي",
     "num": "L24185",
     "mat": "اللغة الفرنسية"
    },
    {
     "dec": "لم يستوف",
     "moy": 8,
     "note_istidrak": 8,
     "exam": 3,
     "test": 0,
     "name": "محمد لمين محفوظ سيد أحمد",
     "num": 5454,
     "mat": "مدخل لدراسة الإقتصاد العام1 "
    },
    {
     "dec": "لم يستوف",
     "moy": "6.5",
     "note_istidrak": 0,
     "exam": 5,
     "test": "1.5",
     "name": "عزيزة محمد الأمين اليعقوبي",
     "num": 18249,
     "mat": "مدخل لدراسة الإقتصاد العام1 "
    },
    {
     "dec": "لم يستوف",
     "moy": "8.5",
     "note_istidrak": 0,
     "exam": 7,
     "test": "1.5",
     "name": "امو احمدباباسماعيل",
     "num": 19349,
     "mat": "مدخل لدراسة الإقتصاد العام1 "
    },
    {
     "dec": "استوفى",
     "moy": 6,
     "note_istidrak": 6,
     "exam": 0,
     "test": 0,
     "name": "حبيب عبد القادر محمد",
     "num": "L21090",
     "mat": "مدخل لدراسة الإقتصاد العام1 "
    },
    {
     "dec": "استوفى",
     "moy": 10,
     "note_istidrak": 10,
     "exam": "8.5",
     "test": 0,
     "name": "محمد فاضل محمد المامون الحاج",
     "num": "L21351",
     "mat": "مدخل لدراسة الإقتصاد العام1 "
    },
    {
     "dec": "استوفى",
     "moy": 13,
     "note_istidrak": 11,
     "exam": "8.5",
     "test": 2,
     "name": "محمد محمد سيد آب",
     "num": "L21517",
     "mat": "مدخل لدراسة الإقتصاد العام1 "
    },
    {
     "dec": "استوفى",
     "moy": 7,
     "note_istidrak": 0,
     "exam": 7,
     "test": 0,
     "name": "محمد محمد سيد آب",
     "num": "L21517",
     "mat": "مدخل لدراسة الإقتصاد العام1 "
    },
    {
     "dec": "استوفى",
     "moy": "11.5",
     "note_istidrak": 10,
     "exam": 0,
     "test": "1.5",
     "name": "المصطفى محمد اغربط اماه",
     "num": "L21789",
     "mat": "مدخل لدراسة الإقتصاد العام1 "
    },
    {
     "dec": "استوفى",
     "moy": 10,
     "note_istidrak": 9,
     "exam": "6.5",
     "test": 1,
     "name": "سيد أمحمدعابدين آج",
     "num": "L21884",
     "mat": "مدخل لدراسة الإقتصاد العام1 "
    },
    {
     "dec": "استوفى",
     "moy": 7,
     "note_istidrak": 3,
     "exam": 7,
     "test": 0,
     "name": "سيد أمحمدعابدين آج",
     "num": "L21884",
     "mat": "مدخل لدراسة الإقتصاد العام1 "
    },
    {
     "dec": "استوفى",
     "moy": 7,
     "note_istidrak": 7,
     "exam": 0,
     "test": 0,
     "name": "عيشة محمد المختار ميلود",
     "num": "L21902",
     "mat": "مدخل لدراسة الإقتصاد العام1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 0,
     "note_istidrak": 0,
     "exam": 0,
     "test": 0,
     "name": "محمد محفوظ محمد عبد اﷲ كبود",
     "num": "L21960",
     "mat": "مدخل لدراسة الإقتصاد العام1 "
    },
    {
     "dec": "استوفى",
     "moy": "9.5",
     "note_istidrak": 8,
     "exam": 0,
     "test": "1.5",
     "name": "محجوبة زين العابدين أحمد زروق",
     "num": "L22060",
     "mat": "مدخل لدراسة الإقتصاد العام1 "
    },
    {
     "dec": "استوفى",
     "moy": 7,
     "note_istidrak": 6,
     "exam": 7,
     "test": 0,
     "name": "عبداﷲ مختار السالم المختار السالم",
     "num": "L22213",
     "mat": "مدخل لدراسة الإقتصاد العام1 "
    },
    {
     "dec": "استوفى",
     "moy": "8.5",
     "note_istidrak": 4,
     "exam": 7,
     "test": "1.5",
     "name": "ساره محمد فيصل امامه",
     "num": "L22287",
     "mat": "مدخل لدراسة الإقتصاد العام1 "
    },
    {
     "dec": "استوفى",
     "moy": "7.5",
     "note_istidrak": 6,
     "exam": 3,
     "test": "1.5",
     "name": "تته محمد القاظي",
     "num": "L22322",
     "mat": "مدخل لدراسة الإقتصاد العام1 "
    },
    {
     "dec": "استوفى",
     "moy": "8.5",
     "note_istidrak": 4,
     "exam": 7,
     "test": "1.5",
     "name": "محمد ناجي السيد ابنو",
     "num": "L22340",
     "mat": "مدخل لدراسة الإقتصاد العام1 "
    },
    {
     "dec": "لم يستوف",
     "moy": "8.5",
     "note_istidrak": 7,
     "exam": 7,
     "test": "1.5",
     "name": "زينب محمد المختار بيبات",
     "num": "L22361",
     "mat": "مدخل لدراسة الإقتصاد العام1 "
    },
    {
     "dec": "استوفى",
     "moy": "9.5",
     "note_istidrak": 0,
     "exam": 8,
     "test": "1.5",
     "name": "عائشه الطالب عبد اﷲ الشيخ أحمد",
     "num": "L22362",
     "mat": "مدخل لدراسة الإقتصاد العام1 "
    },
    {
     "dec": "استوفى",
     "moy": 9,
     "note_istidrak": 7,
     "exam": "7.5",
     "test": "1.5",
     "name": "نسيبه محمد المختار حمود",
     "num": "L22369",
     "mat": "مدخل لدراسة الإقتصاد العام1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 8,
     "note_istidrak": 0,
     "exam": 8,
     "test": 0,
     "name": "زينب محمد حبيب حبيب",
     "num": "L22394",
     "mat": "مدخل لدراسة الإقتصاد العام1 "
    },
    {
     "dec": "استوفى",
     "moy": 8,
     "note_istidrak": 7,
     "exam": 4,
     "test": 1,
     "name": "سلمان محمدون امبيريك",
     "num": "L22395",
     "mat": "مدخل لدراسة الإقتصاد العام1 "
    },
    {
     "dec": "استوفى",
     "moy": 11,
     "note_istidrak": 10,
     "exam": "7.5",
     "test": 1,
     "name": "عبد الرحمن محمد فال أوفى",
     "num": "L22410",
     "mat": "مدخل لدراسة الإقتصاد العام1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 8,
     "note_istidrak": 8,
     "exam": "7.5",
     "test": 0,
     "name": "محمد فاضل ابنو",
     "num": "L22429",
     "mat": "مدخل لدراسة الإقتصاد العام1 "
    },
    {
     "dec": "استوفى",
     "moy": 9,
     "note_istidrak": 7,
     "exam": 6,
     "test": 2,
     "name": "آمنة باباه باباه",
     "num": "L22634",
     "mat": "مدخل لدراسة الإقتصاد العام1 "
    },
    {
     "dec": "استوفى",
     "moy": 8,
     "note_istidrak": 7,
     "exam": 6,
     "test": 1,
     "name": "المختار السالم احمدو اصلاي",
     "num": "L22635",
     "mat": "مدخل لدراسة الإقتصاد العام1 "
    },
    {
     "dec": "استوفى",
     "moy": 12,
     "note_istidrak": 12,
     "exam": 5,
     "test": 0,
     "name": "سيد أحمد اركيب محمد عال عبد المجيد",
     "num": "L22674",
     "mat": "مدخل لدراسة الإقتصاد العام1 "
    },
    {
     "dec": "استوفى",
     "moy": 9,
     "note_istidrak": 7,
     "exam": 6,
     "test": 2,
     "name": "آمنة حمود الكوري",
     "num": "L22676",
     "mat": "مدخل لدراسة الإقتصاد العام1 "
    },
    {
     "dec": "لم يستوف",
     "moy": "7.5",
     "note_istidrak": 6,
     "exam": "6.5",
     "test": 1,
     "name": "أحمد باباه سيدي",
     "num": "L22679",
     "mat": "مدخل لدراسة الإقتصاد العام1 "
    },
    {
     "dec": "استوفى",
     "moy": "9.5",
     "note_istidrak": 6,
     "exam": 8,
     "test": "1.5",
     "name": "محمد محمد عبد اﷲ محمد بوبه",
     "num": "L22715",
     "mat": "مدخل لدراسة الإقتصاد العام1 "
    },
    {
     "dec": "استوفى",
     "moy": "8.5",
     "note_istidrak": 0,
     "exam": 7,
     "test": "1.5",
     "name": "سيد أعمر محمد عبد اﷲ",
     "num": "L22717",
     "mat": "مدخل لدراسة الإقتصاد العام1 "
    },
    {
     "dec": "استوفى",
     "moy": 8,
     "note_istidrak": 7,
     "exam": 6,
     "test": 1,
     "name": "سيد محمد أواه آج",
     "num": "L22719",
     "mat": "مدخل لدراسة الإقتصاد العام1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 9,
     "note_istidrak": 8,
     "exam": 7,
     "test": 1,
     "name": "محمدو لمين دودو",
     "num": "L22731",
     "mat": "مدخل لدراسة الإقتصاد العام1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 7,
     "note_istidrak": 4,
     "exam": 6,
     "test": 1,
     "name": "محمد عبد اﷲ برهم",
     "num": "L22734",
     "mat": "مدخل لدراسة الإقتصاد العام1 "
    },
    {
     "dec": "استوفى",
     "moy": "8.5",
     "note_istidrak": 5,
     "exam": "6.5",
     "test": 2,
     "name": "الطاهره الهيبه الشيخ محمد فاضل",
     "num": "L22737",
     "mat": "مدخل لدراسة الإقتصاد العام1 "
    },
    {
     "dec": "لم يستوف",
     "moy": "7.5",
     "note_istidrak": 6,
     "exam": 5,
     "test": "1.5",
     "name": "أحمد نوح سيدي سيدي",
     "num": "L22781",
     "mat": "مدخل لدراسة الإقتصاد العام1 "
    },
    {
     "dec": "استوفى",
     "moy": 9,
     "note_istidrak": 9,
     "exam": "7.5",
     "test": 0,
     "name": "ينصره سيد محمد",
     "num": "L22782",
     "mat": "مدخل لدراسة الإقتصاد العام1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 3,
     "note_istidrak": 0,
     "exam": 0,
     "test": 3,
     "name": "موسى الشيخ سيدي عالي",
     "num": "L22786",
     "mat": "مدخل لدراسة الإقتصاد العام1 "
    },
    {
     "dec": "لم يستوف",
     "moy": "4.5",
     "note_istidrak": 3,
     "exam": 3,
     "test": "1.5",
     "name": "لاله محمد الب لكويري",
     "num": "L22808",
     "mat": "مدخل لدراسة الإقتصاد العام1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 5,
     "note_istidrak": 4,
     "exam": 4,
     "test": 1,
     "name": "سيد محمد محمد ابراهيم لخليفه",
     "num": "L22809",
     "mat": "مدخل لدراسة الإقتصاد العام1 "
    },
    {
     "dec": "لم يستوف",
     "moy": "6.5",
     "note_istidrak": 0,
     "exam": "6.5",
     "test": 0,
     "name": "الزهره محمد الدوه",
     "num": "L22853",
     "mat": "مدخل لدراسة الإقتصاد العام1 "
    },
    {
     "dec": "استوفى",
     "moy": "9.5",
     "note_istidrak": 6,
     "exam": 7,
     "test": "2.5",
     "name": "ابراهيم المين ابراهيمات",
     "num": "L22860",
     "mat": "مدخل لدراسة الإقتصاد العام1 "
    },
    {
     "dec": "لم يستوف",
     "moy": "7.5",
     "note_istidrak": 0,
     "exam": "6.5",
     "test": 1,
     "name": "محمد يحي بلاهي",
     "num": "L22864",
     "mat": "مدخل لدراسة الإقتصاد العام1 "
    },
    {
     "dec": "لم يستوف",
     "moy": "4.5",
     "note_istidrak": 0,
     "exam": 3,
     "test": "1.5",
     "name": "اسحاق حامد يعقوب",
     "num": "L22875",
     "mat": "مدخل لدراسة الإقتصاد العام1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 8,
     "note_istidrak": 7,
     "exam": 4,
     "test": 1,
     "name": "محمد محفوظ محمد عبد اﷲ",
     "num": "L22893",
     "mat": "مدخل لدراسة الإقتصاد العام1 "
    },
    {
     "dec": "لم يستوف",
     "moy": "8.5",
     "note_istidrak": 0,
     "exam": 7,
     "test": "1.5",
     "name": "سيدي محمد المولود أنجاي",
     "num": "L22898",
     "mat": "مدخل لدراسة الإقتصاد العام1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 9,
     "note_istidrak": 4,
     "exam": 7,
     "test": 2,
     "name": "عايشه احمدو لمليح",
     "num": "L22907",
     "mat": "مدخل لدراسة الإقتصاد العام1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 9,
     "note_istidrak": 8,
     "exam": 9,
     "test": 0,
     "name": "مريم محمد سالم عفان",
     "num": "L22920",
     "mat": "مدخل لدراسة الإقتصاد العام1 "
    },
    {
     "dec": "استوفى",
     "moy": 11,
     "note_istidrak": 6,
     "exam": 0,
     "test": 5,
     "name": "الشيخ التجاني أحمد سالم",
     "num": "L22922",
     "mat": "مدخل لدراسة الإقتصاد العام1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 6,
     "note_istidrak": 4,
     "exam": 6,
     "test": 0,
     "name": "البتول يسلم يمب",
     "num": "L23035",
     "mat": "مدخل لدراسة الإقتصاد العام1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 7,
     "note_istidrak": 7,
     "exam": 6,
     "test": 0,
     "name": "فاطمة سيدي اسند",
     "num": "L23188",
     "mat": "مدخل لدراسة الإقتصاد العام1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 9,
     "note_istidrak": 9,
     "exam": 7,
     "test": 0,
     "name": "تل سيدي اسند",
     "num": "L23237",
     "mat": "مدخل لدراسة الإقتصاد العام1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 0,
     "note_istidrak": 0,
     "exam": 0,
     "test": 0,
     "name": "طه ياسين سيدي عبد اﷲ أن",
     "num": "L23271",
     "mat": "مدخل لدراسة الإقتصاد العام1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 7,
     "note_istidrak": 7,
     "exam": 7,
     "test": 0,
     "name": "مريم عبد اﷲ",
     "num": "L23396",
     "mat": "مدخل لدراسة الإقتصاد العام1 "
    },
    {
     "dec": "استوفى",
     "moy": "11.5",
     "note_istidrak": 10,
     "exam": 8,
     "test": "1.5",
     "name": "يحي حمود بوسيف",
     "num": "L23460",
     "mat": "مدخل لدراسة الإقتصاد العام1 "
    },
    {
     "dec": "استوفى",
     "moy": "9.5",
     "note_istidrak": 7,
     "exam": "7.5",
     "test": 2,
     "name": "نفيسه محمد حرمه الأمين",
     "num": "L23492",
     "mat": "مدخل لدراسة الإقتصاد العام1 "
    },
    {
     "dec": "لم يستوف",
     "moy": "8.5",
     "note_istidrak": 7,
     "exam": 7,
     "test": "1.5",
     "name": "أحمد أحمد باب عمر",
     "num": "L23501",
     "mat": "مدخل لدراسة الإقتصاد العام1 "
    },
    {
     "dec": "استوفى",
     "moy": "9.5",
     "note_istidrak": 8,
     "exam": 0,
     "test": "1.5",
     "name": "اطويلت لعمر محمد سالم يحى",
     "num": "L23563",
     "mat": "مدخل لدراسة الإقتصاد العام1 "
    },
    {
     "dec": "استوفى",
     "moy": 12,
     "note_istidrak": 7,
     "exam": 0,
     "test": 5,
     "name": "الشفاء محمد امين",
     "num": "L23619",
     "mat": "مدخل لدراسة الإقتصاد العام1 "
    },
    {
     "dec": "لم يستوف",
     "moy": "7.5",
     "note_istidrak": 0,
     "exam": "7.5",
     "test": 0,
     "name": "سيدي محمد الحسن الزافي",
     "num": "L23646",
     "mat": "مدخل لدراسة الإقتصاد العام1 "
    },
    {
     "dec": "استوفى",
     "moy": 9,
     "note_istidrak": 8,
     "exam": 0,
     "test": 1,
     "name": "خديجة المامون لمرابط",
     "num": "L23665",
     "mat": "مدخل لدراسة الإقتصاد العام1 "
    },
    {
     "dec": "استوفى",
     "moy": 9,
     "note_istidrak": 5,
     "exam": 7,
     "test": 2,
     "name": "عمران محمد امان",
     "num": "L23694",
     "mat": "مدخل لدراسة الإقتصاد العام1 "
    },
    {
     "dec": "استوفى",
     "moy": 9,
     "note_istidrak": 9,
     "exam": 9,
     "test": 0,
     "name": "فطمة محمد يسلم عبد اﷲ",
     "num": "L23711",
     "mat": "مدخل لدراسة الإقتصاد العام1 "
    },
    {
     "dec": "لم يستوف",
     "moy": "8.5",
     "note_istidrak": 0,
     "exam": 7,
     "test": "1.5",
     "name": "عبد المحسن محمد عبد اﷲ محمد",
     "num": "L23750",
     "mat": "مدخل لدراسة الإقتصاد العام1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 8,
     "note_istidrak": 0,
     "exam": 8,
     "test": 0,
     "name": "الشيخ محمد المامي",
     "num": "L23858",
     "mat": "مدخل لدراسة الإقتصاد العام1 "
    },
    {
     "dec": "لم يستوف",
     "moy": "8.5",
     "note_istidrak": 0,
     "exam": 7,
     "test": "1.5",
     "name": "زينب محمد احميده",
     "num": "L23881",
     "mat": "مدخل لدراسة الإقتصاد العام1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 6,
     "note_istidrak": 0,
     "exam": 4,
     "test": 2,
     "name": "ورده محمد سالم محمد العباس",
     "num": "L23890",
     "mat": "مدخل لدراسة الإقتصاد العام1 "
    },
    {
     "dec": "القرار",
     "moy": "المعدل",
     "note_istidrak": "درجة الاستدراك",
     "exam": "درجة الامتحان",
     "test": "درجة الاختبار",
     "name": "الاسم",
     "num": "الرقم",
     "mat": "مدخل لدراسة الإقتصاد العام1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 9,
     "note_istidrak": 8,
     "exam": 4,
     "test": 1,
     "name": "عبد اﷲ سالو سوماري",
     "num": "L23903",
     "mat": "مدخل لدراسة الإقتصاد العام1 "
    },
    {
     "dec": "استوفى",
     "moy": 12,
     "note_istidrak": 12,
     "exam": 0,
     "test": 0,
     "name": "محمد علي جالو",
     "num": "L23923",
     "mat": "مدخل لدراسة الإقتصاد العام1 "
    },
    {
     "dec": "استوفى",
     "moy": 10,
     "note_istidrak": 10,
     "exam": 3,
     "test": 0,
     "name": "محمد مختار بلدي",
     "num": "L23925",
     "mat": "مدخل لدراسة الإقتصاد العام1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 8,
     "note_istidrak": 8,
     "exam": 5,
     "test": 0,
     "name": "محمد عمر محمد اليعقوبي",
     "num": "L23960",
     "mat": "مدخل لدراسة الإقتصاد العام1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 9,
     "note_istidrak": 9,
     "exam": "8.5",
     "test": 0,
     "name": "فاطمة محمد المختار سيداتي",
     "num": "L23978",
     "mat": "مدخل لدراسة الإقتصاد العام1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 8,
     "note_istidrak": 0,
     "exam": 8,
     "test": 0,
     "name": "محمدن السالم",
     "num": "L23982",
     "mat": "مدخل لدراسة الإقتصاد العام1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 8,
     "note_istidrak": 6,
     "exam": 8,
     "test": 0,
     "name": "ابراهيم الطالب دابو",
     "num": "L24033",
     "mat": "مدخل لدراسة الإقتصاد العام1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 7,
     "note_istidrak": 6,
     "exam": 7,
     "test": 0,
     "name": "محمود باتلي",
     "num": "L24068",
     "mat": "مدخل لدراسة الإقتصاد العام1 "
    },
    {
     "dec": "استوفى",
     "moy": 9,
     "note_istidrak": 0,
     "exam": 9,
     "test": 0,
     "name": "اطيبه محمد امبارك لكوري",
     "num": "L24180",
     "mat": "مدخل لدراسة الإقتصاد العام1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 9,
     "note_istidrak": 8,
     "exam": 9,
     "test": 0,
     "name": "السالم فال الحسين السملالي",
     "num": "L24185",
     "mat": "مدخل لدراسة الإقتصاد العام1 "
    },
    {
     "dec": "لم يستوف",
     "moy": 7,
     "note_istidrak": 5,
     "exam": 7,
     "test": 0,
     "name": "ابراهيم اعمر مسعود",
     "num": "L24205",
     "mat": "مدخل لدراسة الإقتصاد العام1 "
    }
   ]